{
  "ticker": "TSLA",
  "start_date": "2025-10-20",
  "end_date": "2025-10-27",
  "net_gain": -0.030642,
  "articles": [
    {
      "title": "Prediction: This Artificial Intelligence (AI) Stock Will Become the First $6 Trillion Company, According to a Wall Street Analyst",
      "content": "Prediction: This Artificial Intelligence (AI) Stock Will Become the First $6 Trillion Company, According to a Wall Street Analyst By Adam Spatacco – Sep 19, 2025 at 7:05PM Key Points Rising infrastructure investments from AI hyperscalers should fuel further growth for Nvidia's data center business. Over the next year, Nvidia will be increasing the commercialization of its next-generation GPU architectures. Emerging applications and the release of new GPUs should help Nvidia maintain its dominant position in the AI infrastructure landscape. NASDAQ : NVDA Nvidia Market Cap $4.5T Today's Change angle-down ( 2.26 %) $ 4.13 Current Price $ 186.28 Price as of October 24, 2025 at 3:59 PM ET Beth Kindig of the I/O Fund thinks Nvidia will become a $6 trillion stock by next year. Beth Kindig , CEO of the technology research firm I/O Fund, has built a reputation for bold calls in the tech sector. Much like Cathie Wood's long-standing conviction in Tesla , Kindig has consistently expressed unwavering enthusiasm for semiconductor giant Nvidia ( NVDA +2.26% ) . In a recent interview with Bloomberg , Kindig sparked debate after revealing her forecast that Nvidia could reach a $6 trillion market cap by the end of next calendar year -- implying roughly 43% upside from its current levels. Image source: Getty Images. Below, I'll outline the logic behind Kindig's projection and then examine the key drivers that, in my view, lend credibility to her thesis. Expand NASDAQ : NVDA Nvidia Today's Change ( 2.26 %) $ 4.13 Current Price $ 186.28 Key Data Points Market Cap $4526B Day's Range $ 183.51 - $ 187.47 52wk Range $ 86.62 - $ 195.62 Volume 5.1M Avg Vol 173M Gross Margin 69.85 % Dividend Yield 0.00 % What would it take for Nvidia to reach a $6 trillion valuation? The vast majority of Nvidia's revenue is driven by its data center segment. In the second fiscal quarter (ended July 27), Nvidia reported $41.1 billion in data center sales -- a 56% increase year over year. This translates to an annualized run rate of roughly $160 billion. Kindig argues that the probability of Nvidia reaching $50 billion in quarterly data center revenue by year end -- or a $200 billion annual run rate -- is \"very high,\" given the company is still in the early stages of scaling its next-generation Blackwell and Blackwell Ultra GPU architectures . She further contends that Wall Street is underestimating capital expenditure (capex) trends across AI hyperscalers. In her estimation, analysts are not fully modeling the scale of demand for Nvidia's GPUs. Kindig's math suggests that surging investment in infrastructure could push Nvidia's data center operation to $75 billion in quarterly sales ($300 billion annual run rate) by the end of next year -- implying 50% growth compared to her 2025 year-end figures. Of course, understanding the arithmetic is just one piece of the story. The larger question is why I share Kindig's bullish stance -- and what's truly at stake for Nvidia as AI infrastructure spending accelerates. What are the pillars supporting Nvidia's data center growth? At the core of Kindig's thesis is hyperscaler capex spending. The world's largest cloud providers -- Amazon , Microsoft , and Alphabet -- are committing unprecedented sums to expand compute power, setting the stage for the next phase of the AI era. AMZN Capital Expenditures (TTM) data by YCharts The rationale is straightforward: As AI workloads grow and new applications emerge, both training and inference require increasingly sophisticated infrastructure. With hyperscalers doubling down on budgets, Nvidia is positioned to be the primary beneficiary as its GPUs remain the backbone of these AI services. Consider robotics as an example. Companies like Amazon and Tesla are investing in systems that can navigate warehouse operations with human-grade precision. Training physical systems to interpret and engage with real-world environments is far more complex than the reactive large language models (LLMs) that power today's chatbots. Such advancements require massive GPU clusters -- precisely the systems Nvidia delivers. Autonomous systems in transportation, manufacturing, and defense follow a similar trajectory. Moving from proof-of-concept to commercial deployment will drive an exponential increase in demand for compute. Nvidia's Blackwell architecture and its successors are designed for this leap -- combining efficiency with processing power that makes Nvidia an indispensable supplier for enterprises building mission-critical workflows. At the same time, cloud infrastructure is undergoing its own major transformation. A new wave of GPU-as-a-service agreements is gaining momentum, with companies renting access to GPU capacity through providers such as Oracle, CoreWeave , and Nebius Group . This model creates a multiplier effect for Nvidia whereby the company is not only supplying GPUs to the hyperscalers, but it's also partnering with specialized cloud operators that lease its hardware downstream. As businesses increasingly adopt multi-platform cloud strategies , they distribute workloads across several providers. In turn, this expands Nvidia's footprint in the swiftly evolving AI hardware ecosystem. Is Nvidia stock a buy now? Taken together, these catalysts create powerful secular tailwinds supporting Nvidia's long-term growth. The company's expanding data center business is not merely a byproduct of hyperscaler infrastructure investment; rather, it is the inevitable outcome of structural shifts driving the next generation of AI applications. At a high level, the precise timing of a $6 trillion valuation is less important than the underlying trend: Nvidia is well-positioned to remain the dominant force in AI infrastructure. Against this backdrop, I think the stock offers meaningful alpha potential and makes for a compelling long-term position. About the Author Adam Spatacco is a contributing Motley Fool technology analyst covering artificial intelligence, robotics, autonomous driving, e-commerce, and cybersecurity stocks. Previously, Adam was an investment banking analyst specializing in mergers and acquisitions, as well as debt and equity capital raises, for software companies. He later worked in corporate development at venture-backed technology start-ups. He holds a bachelor’s degree in business administration with a concentration in finance from the University of Richmond. TMFmoneyball X @ moneyballinvest Adam Spatacco has positions in Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, Oracle, and Tesla. The Motley Fool recommends Nebius Group and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy . Stocks Mentioned Nvidia NASDAQ: NVDA $186.28 ( +0.02 %) $ +4.13 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Prediction: Nvidia Stock Is Going to Soar After Nov. 20 Is the AI Boom Turning Into a Bubble? Here's What Smart Investors Should Watch. Prediction: This Will Be Nvidia's Stock Price in 2026 Is the Artificial Intelligence (AI) Boom Turning Into a Bubble or Just Getting Started? 3 Top Artificial Intelligence (AI) Stocks Ready for a Bull Run"
    },
    {
      "title": "Tesla wins approval to test autonomous robotaxis in Arizona",
      "content": "Tesla wins approval to test autonomous robotaxis in Arizona FILE PHOTO: Tesla robotaxis launch in Austin, Texas · Reuters Reuters September 19, 2025 1 min read In this article: TSLA (Reuters) - Tesla has been approved to start testing autonomous robotaxi vehicles with a safety monitor in Arizona, the state transportation department said in an email to Reuters on Friday. Tesla had applied in June for a permit to begin trials for an autonomous vehicle ride-sharing service, and now plans to test robotaxis in the Phoenix Metro area using safety drivers, the Arizona Department of Transportation said in its email. Tesla did not respond to a Reuters request for comment. It was not immediately clear when the trials would start or how long they would last. Tesla Chief Executive Elon Musk previously stated that Tesla plans to launch an autonomous ride-hailing service to about half of the U.S. population by the end of this year. Tesla rolled out a small test of its robotaxi service in a limited area of Austin, Texas, in June, with about a dozen vehicles, a select group of passengers and many restrictions, including a safety monitor in the front passenger seat. (Reporting by Chris Kirkham, Preetika Parashuraman and Gnaneshwar Rajan; Editing by Tom Hogue) View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Billionaire Ken Griffin Sells Tesla Stock and Buys an Artificial Intelligence (AI) Stock Up 1,100% Since 2023 (Hint: Not Palantir)",
      "content": "Billionaire Ken Griffin Sells Tesla Stock and Buys an Artificial Intelligence (AI) Stock Up 1,100% Since 2023 (Hint: Not Palantir) By Trevor Jennewine – Sep 20, 2025 at 4:10AM Key Points Billionaire Ken Griffin runs the most successful hedge fund in history as measured by net gains since inception, and he recently sold Tesla and bought Nvidia. Tesla has reported a decline in automotive revenue in three consecutive quarters, but the company has major opportunities in robotaxis and robotics. Nvidia dominates the AI accelerator market not only because it has the fastest chips but also because it provides adjacent hardware and software. NASDAQ : NVDA Nvidia Market Cap $4.5T Today's Change angle-down ( 2.26 %) $ 4.13 Current Price $ 186.28 Price as of October 24, 2025 at 3:59 PM ET Hedge fund manager Ken Griffin continued to sell Tesla in the second quarter, but he bought a substantial position in Nvidia. Ken Griffin of Citadel Advisors is the most successful hedge fund manager in U.S. history as measured by net gains. Further, Citadel beat the S&P 500 (SNPINDEX: ^GSPC) by 9 percentage points during the last three years, which makes his portfolio a good place for individual investors to find inspiration. Griffin made several noteworthy trades during the second quarter. He sold shares of Tesla ( TSLA 3.40% ) for the fourth consecutive quarter, slashing an already-small position by 30%. He also added shares of Nvidia ( NVDA +2.26% ) , increasing his position by 900% such that it now ranks as his second-largest holding. Interestingly, Nvidia has returned 1,100% since the artificial intelligence (AI) boom began in January 2023. But Griffin consistently sold the stock (reducing his exposure in seven of the previous eight quarters) before his big purchase in 2025's Q2. Citadel now has more money invested in Nvidia than at any point since 2022, suggesting Griffin was too quick to sell and has since realized his mistake. Here's what investors should know. Tesla: The stock Ken Griffin sold in the second quarter Tesla's electric car business is struggling. Automotive sales have declined in three straight quarters as the company has navigated increased competition, elevated interest rates, and brand damage caused by CEO Elon Musk's political activities. The company lost more than 3 percentage points of market share in the last year as Chinese automaker BYD became the global leader in electric car sales. However, Tesla has a substantial opportunity in autonomous driving technology. It recently introduced its first commercial autonomous ride-sharing (robotaxi) service in Texas. The company is also testing its vehicles in California, and it recently won approval to begin testing in Nevada. Morgan Stanley analyst Adam Jonas estimates robotaxi revenue will reach $84 billion by 2035. Importantly, while Tesla trails the market leader Alphabet 's Waymo -- which has commercial autonomous ride-sharing services in five U.S. cities -- the company arguably has an edge. Whereas Waymo relies on a costly sensor suite that requires city streets be mapped in extensive detail beforehand, Tesla relies solely on computer vision, which is less expensive and more scalable. Meanwhile, Tesla is also developing an autonomous humanoid robot called Optimus. Musk says it will account for as much as 80% of the company's value in the future, telling analysts earlier this year, \"Optimus has the potential to be north of $10 trillion in revenue.\" Tesla hopes to manufacture at least a million units annually within five years. Tesla currently trades at a 170 times forward earnings based on estimates for 2026, which make it the third-most expensive stock in the S&P 500. Put bluntly, the company is wildly overvalued if it fails to deliver on robotaxis and autonomous robots. But the current price may appear reasonable in hindsight if it executes on those opportunities. Investors will have to decide which outcome they see as most likely. Expand NASDAQ : NVDA Nvidia Today's Change ( 2.26 %) $ 4.13 Current Price $ 186.28 Key Data Points Market Cap $4526B Day's Range $ 183.51 - $ 187.47 52wk Range $ 86.62 - $ 195.62 Volume 5.1M Avg Vol 173M Gross Margin 69.85 % Dividend Yield 0.00 % Nvidia: The stock Ken Griffin bought in the second quarter Nvidia dominates the market for data center graphics processing units (GPUs), chips often called artificial intelligence (AI) accelerators because they speed up demanding workloads like AI training and inference. Nvidia has over 80% market share today, and many analysts think the company will maintain that level for the foreseeable future. Nvidia dominates the AI accelerator market not only because its chips consistently deliver superior results when benchmarked against alternatives but also because the company complements its GPUs with adjacent networking hardware and central processing units (CPUs), as well as software tools that streamline the development of a wide variety of AI applications. Blayne Curtis at Jefferies last year highlighted that competitive moat in a note to clients. \"Nvidia is in control of the ecosystem on both the hardware and software front, and their current cadence of new generations should make that lead only [grow] further,\" he wrote. Indeed, while Nvidia just recently started shipping its latest GPU (called Blackwell), its next generation GPU (called Rubin) will launch next year. Looking ahead, Nvidia is well positioned to maintain its momentum. CEO Jensen Huang expects AI data center expenditures to reach $3 trillion to $4 trillion annually by the end of the decade, up from about $600 billion today. That means its addressable market will grow at least 400% in the next five years, which implies annual revenue growth in the upper 30% range at a minimum. Indeed, Wall Street estimates Nvidia's earnings will increase at 36% annually during the next three years. That makes the current valuation of 50 times earnings seem quite reasonable. Patient investors with a time horizon of at least three years should feel comfortable buying a position in this semiconductor stock today. About the Author Trevor Jennewine is a contributing Motley Fool stock market analyst covering technology, cryptocurrency, and investment planning. Prior to The Motley Fool, Trevor managed several pharmacies. He holds a doctor of pharmacy degree from Oregon State University, a master’s degree in business administration from Miami University, and a bachelor’s degree in biology from Miami University. TMFphoenix12 X @ tjennewine1 Trevor Jennewine has positions in Nvidia and Tesla. The Motley Fool has positions in and recommends Alphabet, Jefferies Financial Group, Nvidia, and Tesla. The Motley Fool recommends BYD Company. The Motley Fool has a disclosure policy . Stocks Mentioned Nvidia NASDAQ: NVDA $186.28 ( +0.02 %) $ +4.13 Tesla NASDAQ: TSLA $433.72 ( 0.03 %) $ 15.26 Alphabet NASDAQ: GOOGL $260.00 ( +0.03 %) $ +6.92 S&P 500 Index SNPINDEX: ^GSPC $6791.69 ( +0.01 %) $ +53.25 Morgan Stanley NYSE: MS $163.86 ( +0.03 %) $ +4.55 Jefferies Financial Group NYSE: JEF $56.75 ( +0.03 %) $ +1.85 BYD Company OTC: BYDDY $13.37 ( 0.01 %) $ 0.08 Alphabet NASDAQ: GOOG $260.51 ( +0.03 %) $ +6.78 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Prediction: Nvidia Stock Is Going to Soar After Nov. 20 Is the AI Boom Turning Into a Bubble? Here's What Smart Investors Should Watch. Prediction: This Will Be Nvidia's Stock Price in 2026 Is the Artificial Intelligence (AI) Boom Turning Into a Bubble or Just Getting Started? 3 Top Artificial Intelligence (AI) Stocks Ready for a Bull Run"
    },
    {
      "title": "Tesla 'Robotaxis' Cleared To Expand Service To Arizona",
      "content": "Tesla 'Robotaxis' Cleared To Expand Service To Arizona Tesla 'Robotaxis' Cleared To Expand Service To Arizona · Investor's Business Daily ED CARSON September 20, 2025 2 min read In this article: TSLA The Tesal Robotaxi could soon be on Phoenix streets, with a safety driver, as Arizona regulators OK a test of the ride-hailing service. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "The 1-Minute Market Report, September 21, 2025",
      "content": ""
    },
    {
      "title": "Tesla: Why I Am Cashing Out Now (Rating Downgrade)",
      "content": ""
    },
    {
      "title": "Is Tesla Stock a Buy, Sell or Hold?",
      "content": "Is Tesla Stock a Buy, Sell or Hold? By Neil Patel – Sep 21, 2025 at 6:10AM Key Points Tesla stock’s incredible rise has resulted in an extremely expensive valuation today. The company’s revenue and profits declined in the latest quarter. It appears the market is bullish on Tesla's ability to find success in the future with robotaxis and robotics. NASDAQ : TSLA Tesla Market Cap $1.4T Today's Change angle-down ( -3.40 %) $ 15.26 Current Price $ 433.72 Price as of October 24, 2025 at 4:00 PM ET The maker of innovative EVs has been a long-term winner for shareholders. Tesla ( TSLA 3.40% ) continues to take investors on a volatile journey. While shares have soared recently due to founder and CEO Elon Musk's $1 billion stock purchase , this remains a very polarizing business. There are valid arguments coming from both bulls and bears as to Tesla's merits as an investment. Is this top electric vehicle (EV) stock a buy, sell, or hold right now? Image source: Tesla. Concerns around valuation In the past decade, Tesla shares have climbed 2,300% (as of Sept. 18). This phenomenal gain is a direct result of the company's success disrupting the global auto industry with its innovative and tech-forward EV fleet. Sales have trended higher over time, and the brand is now widely recognized. However, the stock has overreached. Investors who wish to buy the stock must pay a hefty price tag with shares boasting a price-to-earnings (P/E) ratio in nosebleed territory at 246. This valuation is a convincing enough reason alone for many Tesla shareholders to sell out of their position -- such a high valuation introduces a major headwind to achieving solid future returns. Expand NASDAQ : TSLA Tesla Today's Change ( -3.40 %) $ -15.26 Current Price $ 433.72 Key Data Points Market Cap $1442B Day's Range $ 430.17 - $ 451.68 52wk Range $ 214.25 - $ 488.54 Volume 95M Avg Vol 88M Gross Margin 17.01 % Dividend Yield N/A Tesla's (possible) future To make matters worse, Tesla's automotive revenue declined 16% year over year in the second quarter, and its operating income tanked 42%. A growing backlash against Musk's public profile and increased competition have led to struggles for the EV segment. That said, many investors believe that Tesla will look totally different five or 10 years down the road. They're betting that the company's newly launched Robotaxi business and other technologies like humanoid robots could eventually lead Tesla to higher sales and earnings. The success of those ventures is anything but certain, however, despite how much they may be propping up the current valuation. For much of Tesla's existence as a publicly-traded company, the stock has been highly speculative, and that remains the case now -- the risk-reward profile simply doesn't make sense at these levels. About the Author Neil Patel is a contributing Motley Fool stock market analyst covering consumer staples, consumer discretionary, financials, information technology, and communication services. Prior to The Motley Fool, Neil worked in corporate finance roles at JPMorgan Chase and Capital One. He also has experience working on a start-up in the cryptocurrency space. He holds a bachelor’s degree in business administration with a specialization in finance from Ohio State University and has passed Level I of the CFA Program. TMFNeilPatel Neil Patel has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy . Stocks Mentioned Tesla NASDAQ: TSLA $433.72 ( 0.03 %) $ 15.26 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Tesla Returns to Double-Digit Revenue Growth. Time to Buy the Stock? 2 Reasons I'm Excited About Tesla Stock Following Last Week's Earnings Report Where Will Tesla Be in 1 Year? 1 Terrible Surprise From Tesla's Earnings Call Wednesday 3 Make-or-Break Items From Tesla to Note From Yesterday's Earnings Report"
    },
    {
      "title": "1 Reason to Be Very, Very Excited About Rivian Stock Right Now",
      "content": "1 Reason to Be Very, Very Excited About Rivian Stock Right Now By Ryan Vanzo – Sep 21, 2025 at 9:00AM Key Points Shares of the EV maker remain very cheap compared to the competition. Yet, the company is about to experience its biggest growth spurt in years. NASDAQ : RIVN Rivian Automotive Market Cap $16B Today's Change angle-down ( -0.88 %) $ 0.12 Current Price $ 12.97 Price as of October 24, 2025 at 3:58 PM ET Next year could transform Rivian's entire business. Rivian Automotive ( RIVN 0.88% ) stock trades at a sizable discount to electric-vehicle (EV) competitors like Tesla and Lucid Group . That discount is due to the company's lackluster growth rates in recent quarters. But looking ahead to 2026, Rivian's growth rates should skyrocket. And there's one major reason for this impending growth spurt. Expand NASDAQ : RIVN Rivian Automotive Today's Change ( -0.88 %) $ -0.12 Current Price $ 12.97 Key Data Points Market Cap $16B Day's Range $ 12.94 - $ 13.27 52wk Range $ 9.50 - $ 17.15 Volume 616K Avg Vol 44M Gross Margin -988.16 % Dividend Yield N/A Why does Rivian trade at a discount to Lucid Group and Tesla? According to many valuation metrics, Rivian trades at a sizable discount to other electric vehicle (EV) makers like Tesla and Lucid. Rivian, for example, trades at a price-to-sales ratio of around 3. Lucid shares, meanwhile, trade at around 7 times sales, with Tesla stock trading at an astounding 15 times sales. Why does Rivian trade at such a steep discount? There are two primary reasons. First, Rivian's historical and projected growth rates leave a lot to be desired. Since 2025 began, Rivian has grown revenues by just 3%. Lucid, meanwhile, has grown sales by around 15%. Looking ahead, Rivian is expected to grow sales by just 6% this fiscal year. Lucid, meanwhile, is projected to grow sales by around 61% this fiscal year. Based on these growth statistics, it seems reasonable for Rivian to trade at a discount to Lucid. But here's where things get a little weird. Since 2025, Tesla has actually seen its sales decline by 5.1%. This fiscal year, Tesla is expected to experience a total sales decline of around 4.9%. Why then are Tesla shares trading at such a premium? This brings us to the second reason why Rivian trades at a discount to competitors like Lucid and Tesla. The company doesn't have a clear path toward competing in the global autonomous robotaxi market. Experts like Cathie Wood believe the global robotaxi market could eventually be worth $10 trillion. Tesla has a clear path toward participating through its robotaxi division, which launched in Austin, Texas earlier this year. Lucid, meanwhile, recently partnered with Uber Technologies to supply its robotaxi division. What about Rivian? So far, we haven't heard much about the company's aspirations in this category, potentially leading the market to undervalue the stock. But I predict that Rivian's growth rates should pick up aggressively next year regardless of the company's current lackluster growth rates or its inability to get involved in the robotaxi hype over the short term. Image source: Getty Images. Rivian should see sales explode higher in 2026 and 2027 One of the biggest challenges for an EV maker is getting affordable models to market. And by affordable, we're talking about a starting price of under $50,000. Nearly 70% of all U.S. car buyers are looking for a vehicle under this price threshold for their next purchase. Lucid doesn't currently have any models priced under $50,000, severely limiting its growth potential. Tesla, meanwhile, has only two affordable models: the Model 3 and Model Y. Amazingly, these two models account for more than 90% of its total vehicle sales! As Tesla has proven, getting affordable models to market is critical for achieving mass scale. Lucid is still a couple of years away from this milestone. But Rivian should get its first affordable model to market by early 2026, with two additional affordable models to follow. This has the potential to transform the business. Again, more than 90% of Tesla's sales comes from its two affordable models, and Rivian expects to launch three over the next 18 months. So, while Rivian doesn't have much immediate exposure to the robotaxi market -- an opportunity that should persist for decades to come, giving Rivian plenty of time to catch up down the road -- expect the company's growth rates to pick up considerably in 2026 and 2027. In hindsight, the company's valuation discount versus Tesla and Lucid could be a giant mistake by the market. About the Author Ryan Vanzo is a contributing Motley Fool stock market analyst, covering a range of stocks and market sectors. Ryan previously worked for multiple mutual funds conducting fundamental research. He holds a degree in finance and accounting from Bentley University and has had a strong interest in financial markets since childhood. TMFRyanVanzo Ryan Vanzo has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla and Uber Technologies. The Motley Fool has a disclosure policy . Stocks Mentioned Rivian Automotive NASDAQ: RIVN $12.97 ( 0.01 %) $ 0.12 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Is Rivian a Millionaire-Maker Stock? Where Will Rivian Be in 1 Year? 1 \"Boring\" Stock to Buy Before Nov. 4 Where Will Rivian Stock Be in 5 Years? Is Rivian Stock a Millionaire Maker?"
    },
    {
      "title": "The U.S. Is Forfeiting the Clean-Energy Race to China",
      "content": ""
    },
    {
      "title": "Dow Jones Futures: Nvidia, Tesla, Apple Are Big Winners; Fed Inflation Data Looms",
      "content": "Stock Market Today Dow Jones Futures: Nvidia, Tesla, Apple Are Big Winners; Fed Inflation Data Looms Licensing SCOTT LEHTONEN Updated 09:11 PM ET 09/22/2025 Dow Jones futures, along with S&P 500 futures and Nasdaq 100 futures, traded little changed ahead of Tuesday's open. Meanwhile, Apple (AAPL), Nvidia (NVDA) and Tesla (TSLA) were big winners on the stock market Monday. Apple stock rallied 4.3% Monday, moving further above a handle entry at 241.32 following Friday's breakout move. Nvidia stock surged nearly 4% Monday after the… Tesla Earnings Call Didn't Mention This One Word Again 4:49 AM ET For a second straight Tesla earnings call, \"unboxed\" manufacturing wasn't mentioned. Elon Musk did say Cybercab production will start in... 4:49 AM ET For a second straight Tesla earnings call, \"unboxed\" manufacturing wasn't... IBD Digital Extended Access Sale Keep powering your portfolio with 2 months of IBD Digital for $12—save over $65. Wickedly Good Halloween Sale No tricks, just treats—get 1 month of Leaderboard for only $29. That’s $40 off! Free Investing Podcast Listen to IBD’s podcast for new investing tips and trade ideas every week. Subscribe today! Take a Trial Today Get instant access to exclusive stock lists, expert market analysis and powerful tools with 2 months of IBD Digital for only $20! IBD Videos Get market updates, educational videos, webinars, and stock analysis. Get Started Learn how you can make more money with IBD's investing tools, top-performing stock lists, and educational content."
    },
    {
      "title": "I Lost Money Shorting Tesla; Here's What I Learned",
      "content": ""
    },
    {
      "title": "Wall Street Lunch: Nvidia And OpenAI Deal Begins Next Stage Of AI Growth",
      "content": ""
    },
    {
      "title": "Futurail secures €7.5m funding to advance autonomous train technology",
      "content": "News Futurail secures €7.5m funding to advance autonomous train technology The funding will allow Futurail to grow its workforce, collaborate with train manufacturers, and seek regulatory approval for depot autonomy. September 23, 2025 Share Copy Link Share on X Share on Linkedin Share on Facebook The company’s FUTURAILDriver system is designed for installation on both new and existing train fleets. Credit: Denis Belitsky/Shutterstock.com. European technology company Futurail has secured €7.5m ($8.8m) in a seed funding round to enhance its autonomous train systems. The funding includes €5.5m in seed investment, €1m in public grants, and €1m from pre-seed conversion. Go deeper with GlobalData Reports Intelligent Transportation Systems (ITS) Market Size, Share, Trend ... Reports Cloud in Railway: Centralised train control system Go deeper with GlobalData The gold standard of business intelligence. Find out more Discover B2B Marketing That Performs Combine business intelligence and editorial excellence to reach engaged professionals across 36 leading media platforms. Find out more The investment was co-led by Asterion Ventures in Paris and Munich-based Leap435, alongside contributions from EIT Urban Mobility and US investors Zero Infinity Partners and Heroic Ventures. The funding will enable Futurail to expand its workforce, execute projects with train manufacturers, and pursue regulatory approval for its initial project on depot autonomy. Founded in 2023 by experts who previously worked at Tesla, Argo AI, and Edge Case, Futurail is focused on addressing the shortage of train drivers, which impacts the expansion and cost efficiency of rail services. Operating in both France and Germany, the company combines expertise in autonomous driving and AI with railway systems, aiming to make train travel a more viable option. GlobalData Strategic Intelligence US Tariffs are shifting - will you react or anticipate? Don’t let policy changes catch you off guard. Stay proactive with real-time data and expert analysis. By GlobalData Learn more about Strategic Intelligence Futurail CEO and co-founder Alex Haag said: “While leading the Autopilot team at Tesla, I saw how autonomy can completely transform an entire industry. “We founded Futurail to bring that same revolutionary potential to rail, turning a 200-year-old industry into the backbone of sustainable mobility.” The company’s FUTURAILDriver system is designed to be installed on both new and existing train fleets. The firm is already collaborating with European and US partners to integrate and test its technology. It already partnered with the Lohr Group, a French transport systems manufacturer, and Parallel Systems, a US startup developing battery-electric freight rail vehicles. The firm’s technology is said to bring about a shift from road to rail transport, potentially reducing CO₂ emissions by more than ten million tonnes annually through increased rail use for passengers and freight. Futurail co-founder and chief commercial officer Maximilian Schoffer said: “What excites our partners is that autonomy unlocks both growth and efficiency. “Operators can run more trains, more often, at lower cost. That is a complete game-changer.” Sign up for our daily news round-up! Give your business an edge with our leading industry insights. Sign up Railway Technology Excellence Awards - The Benefits of Entering Gain the recognition you deserve! The Railway Technology Excellence Awards celebrate innovation, leadership, and impact. By entering, you showcase your achievements, elevate your industry profile, and position yourself among top leaders driving rail industry advancements. Don’t miss your chance to stand out—submit your entry today! Nominate Now Share Copy Link Share on X Share on Linkedin Share on Facebook Go deeper with GlobalData Reports Intelligent Transportation Systems (ITS) Market Size, Share, Trend ... Reports Cloud in Railway: Centralised train control system Go deeper with GlobalData The gold standard of business intelligence. Find out more Access deeper industry intelligence Experience unmatched clarity with a single platform that combines unique data, AI, and human expertise. Find out more"
    },
    {
      "title": "Will AI and Robotaxi Expansion Shift Tesla's (TSLA) Investment Narrative?",
      "content": "Will AI and Robotaxi Expansion Shift Tesla's (TSLA) Investment Narrative? Simply Wall St September 24, 2025 3 min read In this article: TSLA In recent weeks, Tesla announced several new shareholder proposals and received analyst attention highlighting its leadership in artificial intelligence and robotics, along with the launch of its first robotaxi service in Austin and expansion efforts in autonomous ride-hailing and energy storage. Elon Musk’s substantial personal investment in Tesla shares and the company’s strategic focus on high-margin recurring software revenues through AI-driven products and services are drawing renewed analyst and investor interest. We’ll now explore how Tesla’s push to scale AI and robotaxi services, alongside increased executive commitment, influences its investment narrative. These 12 companies survived and thrived after COVID and have the right ingredients to survive Trump's tariffs . Discover why before your portfolio feels the trade war pinch. Tesla Investment Narrative Recap To be a Tesla shareholder today, you need to believe that the company's transformation from a carmaker to a leader in real-world AI, robotics, and recurring software revenue streams will drive significant long-term value. The latest round of shareholder proposals, including calls for a child labor audit and board governance reforms, does not materially affect the most important short-term catalyst: rapid scaling of robotaxi and autonomous ride-hailing, while persistent regulatory and execution risks remain the largest immediate challenges to this vision. Among the slew of recent announcements, Tesla's plan to eliminate supermajority voting requirements in its bylaws stands out. This move paves the way for simpler and more responsive shareholder decision-making and is particularly relevant as Tesla seeks broad buy-in for high-impact initiatives such as expansion of its AI-driven robotaxi service, which remains the focus of most growth expectations. On the flip side, investors should be aware of the ongoing regulatory uncertainty around robotaxi and autonomy approvals in key international markets, as... Read the full narrative on Tesla (it's free!) Tesla's narrative projects $148.1 billion revenue and $15.4 billion earnings by 2028. This requires 16.9% yearly revenue growth and a $9.5 billion increase in earnings from $5.9 billion today. Uncover how Tesla's forecasts yield a $331.58 fair value , a 22% downside to its current price. Exploring Other Perspectives TSLA Community Fair Values as at Sep 2025 Fair value estimates from 235 Simply Wall St Community members span from US$67 to more than US$2,700 per share. Yet with robotaxi scaling hingeing on regulatory approvals, the future path could diverge widely depending on market access. Story Continues Explore 235 other fair value estimates on Tesla - why the stock might be worth over 6x more than the current price! Build Your Own Tesla Narrative Disagree with existing narratives? Create your own in under 3 minutes - extraordinary investment returns rarely come from following the herd. A great starting point for your Tesla research is our analysis highlighting 1 key reward and 1 important warning sign that could impact your investment decision. Our free Tesla research report provides a comprehensive fundamental analysis summarized in a single visual - the Snowflake - making it easy to evaluate Tesla's overall financial health at a glance. Searching For A Fresh Perspective? Don't miss your shot at the next 10-bagger. Our latest stock picks just dropped: Trump's oil boom is here - pipelines are primed to profit. Discover the 22 US stocks riding the wave . This technology could replace computers: discover 26 stocks that are working to make quantum computing a reality . We've found 19 US stocks that are forecast to pay a dividend yield of over 6% next year . See the full list for free. This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned. Companies discussed in this article include TSLA . Have feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Alibaba jumps on AI spending, Tesla, Marvell share buybacks",
      "content": "Alibaba jumps on AI spending, Tesla, Marvell share buybacks Yahoo Finance Video and Julie Hyman September 24, 2025 In this video: MRVL NVDA BABAF BABA TSLA Yahoo Finance host Julie Hyman tracks today's top moving stocks and biggest market stories in this Market Minute, including Alibaba's ( BABA ) stock gains after announcing a partnership with Nvidia ( NVDA ) raising its AI spending to over $50 billion, Mizuho analysts raising its price target on Tesla ( TSLA ), and Marvell Technology's ( MRVL ) $5 billion share buyback program. Stay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute. Video Transcript 00:00 Speaker A It is time for Yahoo Finance's Market Minute. 00:02 Speaker A Stocks are lower as Wall Street digests mixed messages from Fed officials on rate cuts and the outlook for AI demand. 00:09 Speaker A Alibaba is benefiting from AI hype though. Those shares are jumping around 9% after announcing plans to boost AI spending beyond the $50 billion it committed to back in February. 00:19 Speaker A The company's also announcing a new deal with Nvidia. 00:22 Speaker A And Tesla is getting a boost as Mizuho Securities lifts its price target on the stock to $450 a share from 375. 00:29 Speaker A The analyst there saying Tesla will see, quote, minimal impact from tariffs and expressed optimism for the company's growth after the approval of CEO Elon Musk's trillion dollar pay package. 00:38 Speaker A And Marvell is rising on news that its board authorized a new $5 billion stock buyback. 00:43 Speaker A The company CEO saying the move reflects their conviction in that business. 00:45 Speaker A And that is your Yahoo Finance Market Minute. Scan the QR code below to track the best and worst performing stocks of the session. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Top Stocks today: uniQure, Lithium Americas and Tesla soar",
      "content": ""
    },
    {
      "title": "Social Buzz: Wallstreetbets Stocks Mixed Premarket Thursday; Lithium Americas, Opendoor Technologies to Advance",
      "content": "PREMIUM Social Buzz: Wallstreetbets Stocks Mixed Premarket Thursday; Lithium Americas, Opendoor Technologies to Advance MT Newswires September 25, 2025 1 min read In this article: LAC.TO OPEN GM MU AMZN The most-talked-about stocks in the Reddit subforum Wallstreetbets were mixed hours before Thursday' PREMIUM Upgrade to read this MT Newswires article and get so much more. A Silver or Gold subscription plan is required to access premium news articles. Upgrade Already have a subscription? Sign in Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Meme Stocks Have Grown Up — And They're Making Money For Investors",
      "content": "Meme Stocks Have Grown Up — And They're Making Money For Investors Meme Stocks Have Grown Up — And They're Making Money For Investors · Investor's Business Daily MATT KRANTZ September 25, 2025 3 min read In this article: ^SPX So-called Meme stocks — or buzz-worthy tickers investors like to talk up on social media — are making a comeback. But they look very different this time. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla urges Trump not to repeal vehicle emissions rules, climate finding",
      "content": "Tesla urges Trump administration to keep vehicle emissions rules, climate finding FILE PHOTO: Illustration shows Tesla logo · Reuters David Shepardson September 25, 2025 2 min read In this article: TSLA VOW.DE By David Shepardson WASHINGTON (Reuters) -Electric vehicle manufacturer Tesla urged the Trump administration not to repeal vehicle emissions standards or the long-standing U.S. finding that greenhouse gas emissions endanger human health. Tesla said in comments posted on Thursday that the Environmental Protection Agency's proposal to repeal the standards \"would give a pass to engine and vehicle manufacturers for all measurement, control, and reporting of GHG emissions for any highway engine and vehicle.\" Earlier this week, a group representing General Motors Toyota, Volkswagen and nearly all other major automakers, asked the EPA to roll back its aggressive vehicle emissions limits that seek to force the industry to build a rising number of electric vehicles. Tesla stands to lose billions of dollars in regulatory credits sold over the coming years as a result of the Trump administration's dismantling of green vehicle rules. Last year, Tesla said it received $2.8 billion in global revenue from earning regulatory credits for selling zero-emission EVs, and from selling those credits to other automakers seeking to meet vehicle emissions targets. Republican Senator Bernie Moreno of Ohio said at a hearing in July that the costs automakers paid Tesla to be in compliance were \"outrageous.\" The EPA’s proposed action \"undermines the stability of this program, diminishes the value of performance-based incentives that electric vehicle manufacturers accrue under the standards, and creates an uneven playing field - reducing the inducement for investment in vehicle innovation,\" Tesla said. In 2019, Tesla began spending $25 per vehicle to generate credits by using environmentally friendly air conditioning. \"This investment ultimately amounted to tens of millions of dollars when scaled over millions of vehicles produced for North America since this time,\" Tesla said. Tesla CEO Elon Musk was a close adviser to U.S. President Donald Trump, before they had a public feud earlier this year. Trump suggested Musk 's objection to a major budget bill was because it eliminated consumer tax credits for electric vehicles, which will end on September 30. In July, the administration told automakers they face no fines for failing to meet fuel efficiency rules dating back to the 2022 model year. Trump in June signed a resolution of disapproval under the Congressional Review Act to bar California's landmark plan to end the sale of gasoline-only vehicles by 2035. (Reporting by David Shepardson; Editing by Chris Reese and Nia Williams) View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Review & Preview: Too Much Good News",
      "content": "Review & Preview: Too Much Good News Review & Preview: Too Much Good News · Barrons.com Alex Eule September 25, 2025 2 min read In this article: ^GSPC ORCL TSLA KMX MU The latest economic data suggest the recent slowing—and the hope for more interest rate cuts—might have been a mirage. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Xiaomi Debuts a $630 Answer to iPhone 17",
      "content": "Xiaomi Debuts a $630 Answer to iPhone 17 Bloomberg September 25, 2025 In this video: 1810.HK AAPL TSLA Xiaomi Corp.'s billionaire co-founder unveiled a $630 smartphone designed to take on the just-released iPhone 17, underscoring the Chinese company's broader ambitions to take on US rivals from Apple Inc. to Tesla Inc. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Most big cryptocurrencies climb on Ethereum, Cardano increases",
      "content": ""
    },
    {
      "title": "There’s No One Who Wants To Go Against Tesla, Inc. (TSLA), Says Jim Cramer",
      "content": "There’s No One Who Wants To Go Against Tesla, Inc. (TSLA), Says Jim Cramer Ramish Cheema September 26, 2025 2 min read In this article: TSLA We recently published 14 Stocks Jim Cramer Discussed Including His 2 Top Quantum Computing Stocks . Tesla, Inc. (NASDAQ:TSLA) is one of the stocks Jim Cramer recently discussed. Like Tesla, Inc. (NASDAQ:TSLA) CEO Elon Musk, Jim Cramer also believes that the firm is more of a technology company than a car company. In this episode, he discussed the firm after Piper Sandler increased the share price target to $500 from $400 after a trip to China. Cramer made interesting comments about the Tesla, Inc. (NASDAQ:TSLA) note: There's No One Who Wants To Go Against Tesla, Inc. (TSLA), Says Jim Cramer Hadrian / Shutterstock.com “[On Piper Sandler’s note] No, that was the first time I’ve seen anything that might be good. I do think that this is a, I don’t want to call it a cold stock, but the idea is this that everybody follows the stock. They see the stock rolling, so then they recommend the stock. There’s no one who wants to go contrary to this stock and say, look this whole move into, you can’t buy for self driving, it’s too far, and you know you don’t want to buy it for robots. No one wants to do that. People just want to get on board, they feel like it had its time of purgatory and it’s ready to roll. And no one wants to get away from it, they all want on it. It’s amazing.” While we acknowledge the potential of TSLA as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the best short-term AI stock . READ NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now . Disclosure: None. This article is originally published at Insider Monkey . View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla Could Reach $2 Trillion Valuation in Early 2026 on Accelerated AI Autonomous Path, Wedbush Says",
      "content": "PREMIUM Tesla Could Reach $2 Trillion Valuation in Early 2026 on Accelerated AI Autonomous Path, Wedbush Says MT Newswires September 26, 2025 1 min read In this article: TSLA Tesla (TSLA) could reach a $2 trillion market capitalization in early 2026 as it takes big steps in PREMIUM Upgrade to read this MT Newswires article and get so much more. A Silver or Gold subscription plan is required to access premium news articles. Upgrade Already have a subscription? Sign in Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "TSLA: Tesla Stock Rises as Wedbush Hikes Target To $600 On AI Growth",
      "content": "TSLA: Tesla Stock Rises as Wedbush Hikes Target To $600 On AI Growth Nauman khan September 26, 2025 1 min read In this article: TSLA This article first appeared on GuruFocus . Sep 26 - Tesla ( NASDAQ:TSLA ) gained 1.5% in early Friday trading after Wedbush Securities boosted its price target on the stock to $600. The firm kept its Outperform rating, pointing to what it sees as a faster path toward artificial intelligence developments within the company. Is TSLA fairly valued? Test your thesis with our free DCF calculator. Wedbush analyst Dan Ives said investors still overlook the scale of transformation taking place at Tesla. He highlighted the company's push into autonomy and robotics as central to its strategy heading into 2026, calling it a defining step for Tesla's future. According to Ives, the AI and autonomous market could bring Tesla an opportunity worth at least $1 trillion. He added that under a Trump White House, regulatory approval for full self-driving and autonomy could speed up, reducing delays that Tesla faced in recent years. In a bull-case outlook, Wedbush sees Tesla's valuation reaching $2 trillion by early 2026, with potential to hit $3 trillion by the end of that year as production of autonomous and robotics programs scales. Investors will next watch Tesla's third-quarter delivery numbers in early October, followed by its quarterly earnings report later in the month. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Dow Jones Futures: Market Rallies Off Key Support, 5 Stocks Eye Buy Points; Tesla Deliveries Due",
      "content": "Dow Jones Futures Rise With Tesla Deliveries, Jobs Report Due; 5 Stocks Eye Buy Points Dow Jones Futures Rise With Tesla Deliveries, Jobs Report Due; 5 Stocks Eye Buy Points · Investor's Business Daily ED CARSON September 28, 2025 6 min read In this article: ^DJI TSLA PLTR ^SPX RBLX The major indexes bounced to end the week. Palantir, DoorDash are near buy points. Tesla deliveries, jobs date and a possible government shutdown loom. Continue Reading View comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla's Annual Deliveries Could Soar Past 2 Million Next Year",
      "content": "Tesla's Annual Deliveries Could Soar Past 2 Million Next Year By Daniel Sparks – Sep 27, 2025 at 3:21AM Key Points Tesla's installed vehicle capacity now tops roughly 2.35 million units. First builds of a more affordable model and an expanding global footprint point to higher throughput. Execution and pricing discipline will be key. NASDAQ : TSLA Tesla Market Cap $1.4T Today's Change angle-down ( -3.40 %) $ 15.26 Current Price $ 433.72 Price as of October 24, 2025 at 4:00 PM ET A new wave of product and capacity catalysts sets up the electric vehicle leader for a volume rebound in 2026. After a sluggish start to 2025, Tesla ( TSLA 3.40% ) shares have rebounded sharply this month as investors refocus on what comes next. The electric vehicle maker and energy storage provider has leaned into autonomy, broadened its charging footprint, and (importantly) started building a cheaper vehicle. Those steps come as the company works through a challenging economic environment, stiffer competition, and its own efforts to revitalize its aging lineup. Against that backdrop, the core question for investors is whether the company can translate its expanding factory base and new models into meaningfully higher volume. With installed capacity already above the 2 million mark and fresh catalysts on deck, Tesla 's annual deliveries could push well beyond 2 million in 2026. Image source: Getty Images. Capacity is in place The math on 2 million starts with capacity. In its second-quarter update, Tesla listed installed annual capacity of more than 550,000 units in California for Model 3 and Y and up to 100,000 units of Model S and X, over 950,000 for Model 3 and Y in Shanghai, and more than 375,000 for Model Y in Berlin. Further, in Texas, it has a capacity of 250,000 for Model Y and 125,000 for Cybertruck. While installed capacity is not the same as current production rate, that footprint collectively supports output well above 2 million vehicles when utilization improves. Recent delivery data shows why utilization is the lever. In the first quarter of 2025, Tesla delivered over 336,000 vehicles following production line changeovers for the refreshed Model Y. And in the second quarter, deliveries improved to more than 384,000. The step up from the first to the second quarter, alongside a broader factory refresh, suggest a pathway back to higher run rates as new configurations stabilize. Product catalysts are arriving But, with the help of new products, there's more production growth on the way. Management recently said the first builds of a more affordable model occurred in June, with volume production planned for the second half of 2025. Tesla also launched an initial robotaxi service in Austin (with a safety rider), while continuing work on Semi and Cybercab for volume production in 2026. These milestones matter because they expand the addressable market and can increase factory utilization by helping to bolster demand for additional units. Expand NASDAQ : TSLA Tesla Today's Change ( -3.40 %) $ -15.26 Current Price $ 433.72 Key Data Points Market Cap $1442B Day's Range $ 430.17 - $ 451.68 52wk Range $ 214.25 - $ 488.54 Volume 95M Avg Vol 88M Gross Margin 17.01 % Dividend Yield N/A Even at roughly 85% utilization of the company's current installed capacity (about 2.35 million units), deliveries would clear 2 million. That outcome also assumes steady throughput in Shanghai (Tesla's export hub) and a continued ramp-up in Texas and Berlin as refreshed Model Y variants and the lower-priced vehicle scale. However, with a more affordable model on the way and its self-driving technology continually improving, demand could jump. Still, investors can't ignore the challenging context the company is operating in. Tesla's global deliveries declined year over year in 2024 to about 1.79 million, marking the electric car maker 's first annual drop in unit sales in more than a decade. This highlighted how pricing, incentives, and competition (particularly from Chinese automakers) are risk factors Tesla investors need to consider. Additionally, the company's shares command an extraordinarily high valuation. Tesla's market capitalization sits at about $1.4 trillion. This is against trailing-12-month revenue and profit of about $93 billion and $5.9 billion, respectively. Any missteps, therefore, could cause a sharp sell-off in the growth stock . The pieces for a delivery rebound are lining up: an installed capacity base above 2 million, the first builds of a cheaper model with volume slated to ramp up, and a broader push in autonomy and energy that can pull more buyers into the ecosystem. The hurdle, however, is execution. Even in the face of high interest rates, Tesla will need to show investors it can grow demand without aggressive discounting, keep factory lines running efficiently, and navigate intensifying global competition. If the company executes well, deliveries could easily surpass 2 million next year, setting a stronger foundation for margins to recover and helping generate cash to fuel Tesla's ambitious growth initiatives. About the Author Daniel Sparks is a contributing Motley Fool stock market analyst covering technology, industrials, financials, and consumer goods. Daniel is the owner and chief investment officer of Sparks Capital Management. He holds a master’s degree in business administration from Colorado State University. The Globe and Mail profiled him and his investing philosophy in an article titled, “This stock picker is outperforming nearly everybody else. Here’s how he is doing it.” TMFDanielSparks X @ sparks_capital Daniel Sparks and/or his clients have positions in Tesla. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy . Stocks Mentioned Tesla NASDAQ: TSLA $433.72 ( 0.03 %) $ 15.26 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Tesla Returns to Double-Digit Revenue Growth. Time to Buy the Stock? 2 Reasons I'm Excited About Tesla Stock Following Last Week's Earnings Report Where Will Tesla Be in 1 Year? 1 Terrible Surprise From Tesla's Earnings Call Wednesday 3 Make-or-Break Items From Tesla to Note From Yesterday's Earnings Report"
    },
    {
      "title": "A New Front Opens Between Zuckerberg and Musk Over Robots",
      "content": "A New Front Opens Between Zuckerberg and Musk Over Robots A New Front Opens Between Zuckerberg and Musk Over Robots · The Wall Street Journal Tim Higgins September 28, 2025 6 min read In this article: TSLA META The rivalry could be one for the ages—right up there with the feud between Bill Gates and the late Steve Jobs. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla is about to show a snapshot of its global sales. Is recent optimism deserved?",
      "content": ""
    },
    {
      "title": "Model Portfolio For Capital Appreciation, September 2025",
      "content": ""
    },
    {
      "title": "Tesla Will Crush Q3 Delivery Expectations: Here's Why",
      "content": "Tesla Will Crush Q3 Delivery Expectations: Here's Why Andrew Rocco September 28, 2025 9 min read In this article: NIO NIOIF BYDDF BYDDY XPEV A mere handful of months ago, Tesla ( TSLA ) shares looked doomed, and it felt as if the bears may have finally gotten their long-awaited moment. Tesla CEO Elon Musk made his foray into politics by spending more than a quarter of a billion dollars to support Donald Trump and the Republicans in 2024. Then, while already spread thin, he took a hiatus from Tesla and managed the ‘Department of Government Efficiency’ DOGE to help seek a solution to America’s soaring debt. However, Musk would soon learn the reality of getting involved in politics in today’s toxic environment. Many democrats felt that Musk wielded too much power, leading to mass left-wing protests against Tesla, boycotts, and widespread vandalism. As if that weren’t bad enough, Musk had a ugly falling out with President Trump, leading to backlash from many partisans on the right. Meanwhile, Tesla’s legacy EV business was slowing, Alphabet’s ( GOOGL ) ‘Waymo’ seemed poised to dominate the robotaxi market, and even some of Musk’s staunchest followers began to lose faith in him, voicing concerns that he was no longer interested in running Tesla. Tesla is on Pace for its Best September Performance Ever However, if there’s one lesson Tesla has taught investors, it’s never to make a long-term bet against Elon Musk and Tesla, no matter how bad things may seem. Despite the slew of bearish headlines and negative earnings growth, TSLA is about to register its best September in history. Tesla shares up more than 30% in September and registered fresh all-time closing highs last week. Zacks Investment Research Image Source: Zacks Investment Research Why are Tesla Shares Rising? Tesla shares are rising for several reasons. The September rally was sparked when Elon Musk confirmed that he was done with politics. For investors, the news was a massive sigh of relief. The importance of Musk’s presence at Tesla was put on full display when he stepped away from Tesla to focus on his acquisition of social media platform Twitter, and TSLA shares dropped swiftly. In addition to Musk leaving politics, investors also cheered the Tesla board’s $1 trillion pay package proposal for Musk, seeing the offer as a way to keep Musk at Tesla and motivated. Tesla shareholders are once again betting on the future. Tesla’s robotaxi service is finally live in Austin and San Francisco, with plans to expand into other cities like Miami and Chicago (pending regulatory approval). In addition, TSLA shares are rising on optimism surrounding its newest ‘Full Self Driving’ (FSD) update, which is slated to launch this week. Tesla FSD v14 will be launched to a limited number of social media influencers this week, with v14.2 set to follow in a few weeks. In a recent tweet, Musk hyped the debut, saying that “The car will feel like it is sentient being by 14.2.” Story continues Tesla Q3 Delivery & Production Preview Though Tesla is working to diversify its business with its energy segment and its upcoming ‘Optimus” humanoid robot, Tesla currently generates roughly three-quarters of its total revenue from its legacy EV business. Unfortunately for Tesla bulls, deliveries are 4% lower over the trailing twelve months, and over the past two years, growth has been sluggish at +1%. Tesla deliveries peaked in Q4 2023 and have been declining ever since. Zacks Investment Research Image Source: Zacks Investment Research However, Tesla has a chance to change the narrative this week when it releases its third-quarter delivery and production numbers, which are expected to drop on Thursday before the US equity market opens. Below is a breakdown of Wall Street’s expectations for Tesla’s Q3 delivery numbers: · Q3 Delivery Expectations: Consensus Wall Street analyst expectations are for 448,000 units. (According to FactSet) · Delivery Comparison to 2024: Tesla delivered 462,890 vehicles in Q3 2024. · Q3 Production Expectations: UBS expects 470k vehicles produced in Q3 2025. · 2025 Full-Year Delivery Outlook: Tesla delivered 336,681 vehicles in Q1 and 384,122 cars in Q2. Wall Street consensus estimates anticipate ~1.85 million vehicles will be delivered in full-year 2025. The Q3 delivery and production numbers will be significantly different from those of previous quarters for several reasons, including tariff impacts, the expiration of the EV tax credit, and the release of the new Model Y. Why Tesla Will Beat Q3 Wall Street Delivery Expectations Though there are several crosscurrents heading into Thursday’s delivery number, there are several reasons for Tesla bulls to be optimistic, including: 1. Tax Credit Expiration-Related Demand: Elon Musk has stated that he supports ending the $7,500 US federal EV tax credit, arguing that it would benefit Tesla and negatively impact its competitors. However, Musk later retracted his statement, arguing that it is unfair that President Trump’s ‘Big Beautiful Bill’ leaves oil and gas subsidies while sunsetting EV and solar incentives. Nevertheless, regardless of what Musk says, Q3 Tesla deliveries are likely to benefit dramatically from a ‘pull forward’ effect, as consumers likely have rushed over the past few months to take advantage of the $7,500 EV tax credit that won’t be available for the first time since the program started in 2009. 2. Elon Musk’s Political Backlash Has Dissipated: While Tesla sales have undoubtedly suffered from Elon Musk’s political affiliations and controversial statements, his stepping back from politics and renewed focus on Tesla should help to alleviate these concerns. Although there are critics on both sides of the political aisle who will never buy a Tesla out of principle, Tesla remains the safest, most popular, and highest-quality EV on the market by far. In addition, Wall Street analysts are likely underestimating the loyalty of Tesla’s customer base. Tesla, which is famous for spending little to no money on marketing, may even benefit from loyalists buying Teslas simply to support Musk. Additionally, Elon Musk was recently seen shaking hands with President Trump at the Charlie Kirk memorial service, an act that may help repair his reputation in right wing political circles. In summary, time heals wounds, especially in the hyperactive modern-day news cycle of 2025. 3. The Model Y Retool is Complete: Tesla’s Model Y SUV has been a smash hit. Since 2023, the Model Y has been the top-selling electric vehicle by far. Tesla recently begun selling a revamped and sleeker ‘Juniper’ Model Y, featuring exterior and interior aesthetic updates, new lighting, improved suspension, a front bumper camera, and enhancements to cabin comfort and noise levels. While the Model Y has mainly received positive customer reviews, anticipation and a wait-and-see mindset for Tesla’s tech-forward customers likely led to a lull in Model Y sales in early 2025. Additionally, Tesla underwent an intensive revamp of its factories in early 2025 to retool them for the new Model Y production. With these short-term barriers in the rearview mirror, the stage is set for an upside surprise on the Model Y front. Also, Tesla’s Cybertruck production is also gaining momentum and becoming more efficient. 4. China’s Economic Rebound Should Boost Tesla Sales: China is Tesla’s second most important market, comprising ~22% of total revenue. Over the past few years, Tesla sales in China have suffered amid a floundering Chinese economy, plagued by high unemployment. However, following a slew of government stimulus measures and a relaxation of anti-business regulations, China’s economy is firing on all cylinders, registering robust GDP growth of 5% last year.  Meanwhile, following stringent lockdowns and government-driven fear surrounding COVID-19, Chinese households currently enjoy massive excess savings. With a still uncertain housing market, many of these Chinese households are likely to spend on EVs,"
    },
    {
      "title": "Why Tesla stock has been rallying in September",
      "content": "Why Tesla stock has been rallying in September Sam Boughedda September 29, 2025 1 min read In this article: TSLA ^SPX Investing.com -- Tesla shares have surged 32% since the end of August, far outpacing the S&P 500’s 3% gain. Barclays analysts said in a note Monday that the rally reflects “favorable near-term fundamental datapoints around deliveries / 3Q EPS, and perhaps more importantly around excitement into the Nov 6 AGM plus an increasingly engaged Elon.’” Barclays argued that the stock’s outperformance is not just about fundamentals. “We believe the rally can also be put in context of Tesla as the ‘OG meme stonk,’ with performance also reflecting a combination of technical factors (i.e. option activity / call purchasing), retail excitement, and Mag7 catch-up,” the analysts wrote. The mix of excitement and positioning has pushed Tesla’s valuation higher. The analysts noted that “these trends have magnified the ongoing disconnect between the stock and near-term earnings power, with the stock trading at a frothy 180x ’26 PE multiple.” Looking ahead, Barclays expects Tesla to deliver strong third-quarter numbers. “We reiterate our expectation for Tesla to beat on 3Q deliveries,” the note said. However, the firm suggested the market may already be pricing in that outcome and warned that “we wouldn’t be surprised if there is a near-term breather.” Still, Barclays highlighted that the upcoming shareholder meeting could provide another catalyst. “Beyond the deliveries print, we think excitement could continue to build into the Nov 6 AGM, which we expect will highlight Elon Musk’s increased engagement with Tesla and excitement on a supercharged growth narrative ahead,” the analysts said. Barclays concluded that Tesla’s September rally can be explained by “re-engaged Elon, favorable datapoints, and the return of the ‘OG meme stonk.’” Related articles Why Tesla stock has been rallying in September Apollo economist warns: AI bubble now bigger than 1990s tech mania Natural Gas: Consolidation Could Set Stage for Breakout Above $3.20 Barrier View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla Jumps 32% in September as Musk Revs Up Ahead of Deliveries, AGM",
      "content": "Tesla Jumps 32% in September as Musk Revs Up Ahead of Deliveries, AGM Faizan Farooque September 29, 2025 1 min read In this article: TSLA This article first appeared on GuruFocus . Tesla ( TSLA , Financials ) shares have rallied 32% in September, boosted by expectations of strong third-quarter deliveries and renewed enthusiasm from CEO Elon Musk ahead of the Nov. 6 annual general meeting. Is TSLA fairly valued? Test your thesis with our free DCF calculator. Analysts at Barclays said the outperformance reflects not only fundamentals but also technical factors and retail investor sentiment, calling Tesla the original meme stock. Options activity, call buying, and excitement around the Magnificent Seven catch-up trade have also fueled momentum. Barclays expects Tesla to beat delivery estimates in Q3 but cautioned the market may have already priced in that outcome. The stock is currently trading at about 180 times projected 2026 earnings, far above peers. Still, analysts said the AGM could serve as another catalyst, highlighting Musk's increased engagement and Tesla's longer-term growth narrative. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla analyst unveils eye-popping stock price target",
      "content": ""
    },
    {
      "title": "Tesla Price Target Lifted to $490 at Canaccord on Rising Deliveries, Energy Demand",
      "content": "Tesla Price Target Lifted to $490 at Canaccord on Rising Deliveries, Energy Demand Faizan Farooque September 30, 2025 1 min read In this article: TSLA This article first appeared on GuruFocus . Tesla ( TSLA , Financials ) received a price target upgrade from Canaccord Genuity , which raised its projection to $490 from $333 and reiterated a Buy rating. The new target represents about 10% upside from the company's last closing price of $443.21. Warning! GuruFocus has detected 11 Warning Signs with WOLF. Is TSLA fairly valued? Test your thesis with our free DCF calculator. The analysts said their research across roughly 30 countries pointed to stronger-than-expected deliveries, reversing several quarters of slowing momentum. They noted that management's commitment to new vehicle launches should help sustain global sales growth despite the phaseout of U.S. tax credits after the third quarter. In addition to vehicles, Canaccord highlighted Tesla's expanding energy storage business. Demand from utilities and hyperscale data centers is expected to drive growth, with energy storage positioned as a critical solution for grid stability and on-site power needs. Elon Musk's use of on-site energy for his AI company, xAI, was cited as an example of broader adoption, though analysts cautioned about environmental risks tied to such projects. They also flagged Musk's new compensation package, which sets ambitious long-term goals and ties investor returns to Tesla's future performance, while offering indirect exposure to his AI ventures. Earlier this month, Tesla secured regulatory approval to begin road testing its autonomous ride-hailing program in Arizona. The pilot includes robotaxis in the Phoenix metro area with safety drivers on board. Investors will be watching Tesla's next earnings report for further clarity on delivery trends, margins, and energy storage growth. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "5 Overlooked Themes For Equity Investors In China",
      "content": ""
    },
    {
      "title": "Ford CEO says customers are not interested in $75,000 EVs",
      "content": "Ford CEO says customers are not interested in $75,000 EVs Brian Sozzi and Francisco Velasquez Updated October 4, 2025 2 min read In this article: F TSLA AAPL MSI 002594.SZ Ford ( F ) CEO Jim Farley says US buyers aren't interested in $75,000 electric vehicles — and the automaker doesn't want to keep living in Tesla's ( TSLA ) shadow. \"We've learned ... people are not willing to pay [a] $30,000 premium for that big battery on a [$50,000], $60,000 utility,\" Farley told Yahoo Finance at Ford's Pro Accelerate conference in Detroit, Mich. \"But they're willing to buy a $30,000 EV if they save $2,000 a year compared to gas costs.\" Farley's comments underscore the challenges Ford faces as it pushes further into EVs. While global EV demand grows, price sensitivity is shaping which models will succeed. The CEO said the automaker has been \"No. 2 to Tesla for three years\" and is taking lessons from that experience to better align with consumer demand. Ford is also rethinking its EV strategy and benchmarking against BYD, China's EV leader. In 2024, BYD reported annual revenue of $107 billion, surpassing Tesla's $97.7 billion. \"[BYD has] full support from the Chinese government ... they've been at this for 20 years,\" he said, adding the company has \"a lot of good\" intellectual property. \"Ford has to innovate, to catch up with BYD because we're a global company,\" Farley said. \"We're going to compete with them around the world.\" He emphasized that electrification is accelerating abroad, and the US is just one part of a worldwide market. Part of those innovation efforts comes in the form of a new \"universal electric vehicle platform\" aimed at affordability. Farley said the goal is a $30,000 EV that appeals to mainstream buyers while maintaining competitive performance and features. \"... We had to reload our capital on what we learned, move as fast as we can, and then we've got to make sure we're future-proof to BYD,\" he added. He compared the industry’s adoption of electrification to the way technology has transformed other sectors. “Anytime there’s new technology … things changed,” he said, pointing to how Apple’s iPhone reshaped mobile devices and disrupted legacy companies like Motorola. Analysts note that Ford's approach aligns with broader market realities. In a note to clients, JPMorgan analyst Ryan Brinkman highlighted that while EV demand is growing, minimizing \"EV-related losses going forward\" remains a critical factor for adoption. Goldman Sachs analyst Mark Delaney wrote that \"the degree of success with company specific initiatives such as the transition to hybrids/EVs\" is a key factor of the firm's Neutral rating on the stock. Story Continues Brian Sozzi is Yahoo Finance's Executive Editor and a member of Yahoo Finance's editorial leadership team. Follow Sozzi on X @BrianSozzi , Instagram , and LinkedIn . Tips on stories? Email brian.sozzi@yahoofinance.com. Francisco Velasquez is a Reporter at Yahoo Finance. He can be reached on LinkedIn and X , or via email at francisco.velasquez@yahooinc.com . Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance StockStory aims to help individual investors beat the market. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "William Blair: ’Increasingly difficult’ to like Tesla stock amid rich valuation",
      "content": "William Blair: ’Increasingly difficult’ to like Tesla stock amid rich valuation Sam Boughedda October 1, 2025 1 min read In this article: TSLA Investing.com -- William Blair analysts said Tuesday they are raising their third-quarter delivery estimates for Tesla but warned that the stock’s lofty valuation makes it “increasingly difficult” to sustain a positive stance. In a note ahead of Tesla’s October 2 results, the firm said the expiration of the $7,500 U.S. EV tax credit has led to a stronger-than-expected pull-forward in demand. “We now estimate 480,000 deliveries versus the Street’s 443,000,” William Blair wrote, adding that U.S. demand for the new Model Y has been a “bright spot,” while a recovery in China and other markets has offset weakness in Europe. Despite the upward revision, analysts expressed caution. “Next quarter we are cautious on margins from a hangover on auto deliveries and lower regulatory credit revenue,” they said. Still, enthusiasm around Tesla’s robotaxi efforts, Elon Musk’s stock purchase, and new energy storage products has “pushed the stock to near all-time highs.” The firm noted that Tesla shares are now trading at “an enterprise value of 118x our 2026 EBITDA estimate… a significant premium to technology peers at 20-25x.” Analysts warned that the impacts from the OBBB could require “a reset to Street consensus as the multiple premium will be put under pressure.” William Blair maintained its Market Perform rating but acknowledged that it is “finding it increasingly difficult to maintain” given the valuation backdrop. The firm said it would look for “more data points on our bullish views on energy storage and robotaxi to regain momentum” once estimates reset, while citing risks from intensifying Chinese competition, geopolitical exposure to China, and “key-man risk with CEO Elon Musk.” Related articles William Blair: ’Increasingly difficult’ to like Tesla stock amid rich valuation Natural Gas: Consolidation Could Set Stage for Breakout Above $3.20 Barrier These Under-$10 Stocks Are Up 100%+ This Quarter - And Some Still Have Room to Run View comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Fermi IPO Is a Risky Bet on AI Power. The Stock Is Soaring in Its Debut.",
      "content": "Fermi IPO Is a Risky Bet on AI Power. The Stock Soared 55% in Its Debut. Fermi IPO Is a Risky Bet on AI Power. The Stock Soared 55% in Its Debut. · Barrons.com Avi Salzman October 1, 2025 4 min read In this article: EQIX AMZN FRMI TSLA The firm priced its offering at the high end of its expected range, valuing the company at $13.8 billion. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla deliveries, Fedspeak, mortgage rates: What to Watch",
      "content": "Tesla deliveries, Fedspeak, mortgage rates: What to Watch Yahoo Finance Video and Josh Lipton October 1, 2025 In this video: TSLA Market Domination Overtime host Josh Lipton previews several of the biggest stories to come tomorrow, Thursday, October 2, including what the expiring EV tax credit could mean for Tesla ( TSLA ) sales as it publishes quarterly deliveries, fresh commentary out from top Federal Reserve officials, and the latest print on mortgage rates. To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime . Video Transcript 00:04 Speaker A Time now for what to watch. Tesla is reporting quarterly deliveries. analysts expect the expiring EV tax credit in the US to provide a boost to deliveries for the electric vehicle maker. 00:15 Speaker A It's coming as Ford posted a seventh consecutive month of sales gains and saw a 30% rise in EV sales for the third quarter. General Motors also reporting another EV sales record. 00:25 Speaker A Turning to the Fed, Dallas Federal Reserve Bank President Logan to speak in Austin, Texas. Logan to make remarks at the UT Evolving Energy and Policy landscape conference. Her commentary is expected to provide insights into the Fed's economic outlook and monetary policy. 00:40 Speaker A On the housing front, Freddie Mac is set to release its weekly report on US mortgage rates. This comes as mortgage rates inched up last week, following several weeks of declines. 00:49 Speaker A The housing market recently seeing US home contract signings surge in August, while the pending home sales index rose by 4% in the month. 00:57 Speaker A And lastly, the weekly initial jobless claims report will not be released as the US finds itself in a government shutdown. Economic data from the US Labor Department will be halted. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Dow Jones Futures: Stock Market Hits Highs, Tesla Deliveries Due; Nvidia Partner Breaks Out",
      "content": "Dow Jones Futures Fall, Techs Rise With Tesla Deliveries Due; Nvidia Partner In Buy Zone Dow Jones Futures Fall, Techs Rise With Tesla Deliveries Due; Nvidia Partner In Buy Zone · Investor's Business Daily ED CARSON October 2, 2025 10 min read In this article: NVDA VRT PLTR ^DJI TSLA Stocks rose Wednesday despite a government shutdown, with Nvidia partner Vertiv breaking out. Tesla deliveries are on tap before the open. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Stocks Mostly Rise Pre-Bell as Traders Shrug Off Government Shutdown",
      "content": "PREMIUM Stocks Mostly Rise Pre-Bell as Traders Shrug Off Government Shutdown MT Newswires October 2, 2025 2 min read In this article: ^SPX ^IXIC ^DJI US equity markets were mostly pointing higher before the opening bell Thursday as traders appeared t PREMIUM Upgrade to read this MT Newswires article and get so much more. A Silver or Gold subscription plan is required to access premium news articles. Upgrade Already have a subscription? Sign in Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla Nears Record Highs -- Q3 Deliveries Set to Smash Wall Street Forecasts",
      "content": "Tesla Nears Record Highs -- Q3 Deliveries Set to Smash Wall Street Forecasts Nauman khan October 2, 2025 1 min read In this article: TSLA This article first appeared on GuruFocus . Tesla ( NASDAQ:TSLA ) stock surged more than 3% on Wednesday ahead of its third-quarter delivery report, which is scheduled for release on Oct. 2. Brokerage William Blair lifted its forecast to 480,000 vehicles for the quarter, topping the market consensus of about 448,000. The company delivered 336,681 vehicles in the first quarter and 384,122 in the second quarter of 2025. Last year in the same period, deliveries totaled 462,890. Warning! GuruFocus has detected 5 Warning Signs with NVDA. Is TSLA fairly valued? Test your thesis with our free DCF calculator. Analyst Jed Dorsheimer said the expiration of the $7,500 U.S. electric vehicle tax credit drove stronger demand than expected. He cautioned, however, that fourth-quarter results could be pressured by weaker margins and softer revenue from regulatory credits. The analyst noted momentum from new initiatives such as robotaxi plans, Elon Musk's recent stock purchase, and energy storage products has helped push Tesla shares near record highs. Demand for the Model Y in the U.S. and a rebound in China are offsetting weakness in European markets, he added. Morgan Stanley analyst Adam Jonas said Tesla, valued at about $1.3 trillion, remains the smallest of the so-called Magnificent Seven but sees its potential as larger given opportunities in areas such as physical artificial intelligence. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Dow, S&P 500, Nasdaq notch records on AI buzz even as government shutdown drags on",
      "content": "Dow, S&P 500, Nasdaq notch records on AI buzz even as government shutdown drags on Amalya Dubrovsky and Karen Friar Updated October 2, 2025 2 min read In this article: ^GSPC ^SPX ^IXIC ^DJI NVDA US stocks rose on Thursday as the AI trade continued to power a push for fresh records amid new buzz around OpenAI ( OPAI.PVT ). Meanwhile, investors kept an eye on developments in Washington, weighing the chances of a lengthy US government shutdown. The tech-heavy Nasdaq Composite ( ^IXIC ) rose 0.4%. The S&P 500 ( ^GSPC ) gained 0.1%. The Dow Jones Industrial Average ( ^DJI ) rose 0.2%. All three major averages posted new records. Stocks rose one day after the S&P 500 closed above 6,700 for the first time. A wave of good news from the AI sector lifted chip stocks worldwide, with Nvidia ( NVDA ) rising to a record high. AMD ( AMD ) and SK Hynix ( 000660.KS , HXSCL ) also gained. OpenAI's ( OPAI.PVT ) valuation soared to $500 billion after an employee share sale, boosting tech rally hopes despite fears of an AI bubble. The ChatGPT maker ousted Elon Musk's SpaceX ( SPAX.PVT ) as the most valuable startup in the world. Markets have so far been unperturbed by the US government shutdown, which looks set to drag on at least until the end of the week. President Trump is amping up his rhetoric against Democrats, threatening to fire \"thousands\" of federal workers and canceling billions of dollars in federal funding to blue states. Trump said he is meeting on Thursday with OMB Director Russ Vought, who has been leading White House strategy in the shutdown, to discuss which \"Democrat Agencies\" should be cut. In any case, Friday's scheduled release of the September jobs report is all but certain to be delayed. That has Wall Street looking elsewhere during the federal data blackout, as Fed policymakers have indicated cracks in the labor market will loom large in their October rate decision. Private data from the firm Challenger, Gray & Christmas released Thursday found hiring plans at their lowest level since 2009, even as layoffs fell. The report provided more evidence of the softening \"low hire, low fire\" labor market after Wednesday's ADP report. Investors remain near-unanimous on bets for a cut at the Fed's next meeting. Elsewhere in corporates, Tesla ( TSLA ) shares took a hit despite a record sales quarter as investors turned focus to future performance without the federal EV tax credit. LIVE COVERAGE IS OVER 25 updates Thu, October 2, 2025 at 8:03 PM UTC Ines Ferré Dow, S&P 500, Nasdaq notch new records US stocks climbed to all-time highs as enthusiasm over OpenAI's ( OPAI.PVT ) $500 billion valuation helped tech equities move higher. The tech-heavy Nasdaq Composite ( ^IXIC ) rose 0.4% to rise to a record high, while the S&P 500 ( ^GSPC ) rose just above the flatline to post its own all-time record close. The Dow Jones Industrial Average ( ^DJI ) also rose 0.1%, setting a new high. Bitcoin ( BTC-USD ) moved above $120,000 per token as momentum across cryptocurrencies grew. Thu, October 2, 2025 at 7:16 PM UTC Ines Ferré Bitcoin climbs above $120,000 as momentum across cryptocurrencies gain steam Bitcoin ( BTC-USD ) rose above $121,000 on Thursday as momentum across cryptocurrencies gained steam. The world's largest token rose 3%, to extend 2025's rally to 29%. Thu, October 2, 2025 at 7:15 PM UTC Ines Ferré GMC's higher-end trucks and SUVs are driving General Motors' bottom line Yahoo Finance's Pras Subramanian reports: Read more here. Thu, October 2, 2025 at 6:30 PM UTC Ines Ferré Bitcoin rises as investors eye 'Uptober' bounce Bitcoin ( BTC-USD ) rose 2% on Thursday to gain for a second session in a row as investors eyed \"Uptober\" as a seasonally favorable period for cryptocurrencies. October has historically been bitcoin's strongest month, while the world's largest cryptocurrency has also been strong in the fourth quarter. Thu, October 2, 2025 at 5:45 PM UTC Ines Ferré Gold takes breather following massive rally Gold ( GC=F ) took a breather on Thursday after a monstrous rally this year. The precious metal has been trading at record highs amid a US government shutdown . Aakash Doshi, head of gold strategy at State Street Investment Management, told Yahoo Finance that he expects the precious metal to reach $4,000 per ounce in the fourth quarter. \"Earlier this week, we already highlighted that $4,000 an ounce is not only a question of if but when, and we do think that that's plausible this month or certainly in the fourth quarter, assigning a 75% probability of breaking above $4,000 an ounce,\" Doshi said. \"Where we go forward from there, there could be some modest retrenchment. November and December are negative seasonals for gold ETFs in particular,\" he added. Gold futures are up roughly 48% year to date. Thu, October 2, 2025 at 5:00 PM UTC Ines Ferré Oil slides 2%, on pace for fourth day in a row of declines Oil prices fell again on Thursday, marking a fourth straight day of declines amid worries of oversupply. West Texas Intermediate ( CL=F ) futures fell roughly 2% to hover near $60 per barrel. Brent crude ( BZ=F ) also fell to hover near $64 per barrel. The Organization of Petroleum Exporting Countries and its allies (OPEC+) are considering a plan to increase output by as much as 500,000 barrels per day in November, which would be three times the agreed-upon increase for October, as Saudi Arabia aims to reclaim market share. Thu, October 2, 2025 at 4:23 PM UTC Grace O'Donnell Mortgage rates rise for second straight week, sapping refinancing demand Yahoo Finance's Claire Boston reports: Read more here. Thu, October 2, 2025 at 3:30 PM UTC Ines Ferré US hiring plans sink to lowest since 2009 in September as labor market slowdown continues Yahoo Finance's Emma Ockerman reports: Read more here. Thu, October 2, 2025 at 3:00 PM UTC Grace O'Donnell Fermi stock bounces around in second day of trading Fermi ( FRMI ) stock swung back and forth on Thursday after rising over 54% in its first day of trading on Wednesday. Shares of the data center REIT rose 9% in premarket trading before dipping 3% lower. At last check, the stock dived The real estate trust co-founded by former US Energy Secretary Rick Perry aims to build hyperscale data centers and power grids to meet the power demands of artificial intelligence. Its development-stage campus, known as the \"President Donald J. Trump Advanced Energy and Intelligence Campus,\" spans more than 5,000 acres of land in the Texas Panhandle. \"The biggest reason that we went public is we have a global supply chain, and I think it makes it easier for our critical vendors to know who we are if we're a public company,\" Fermi America Co-Founder and CEO Toby Neugebauer told Yahoo Finance's Market Domination . \"The No. 1 race on the planet right now is for gas generation and the components associated with electron generation, and we want our customers ... or our vendors to feel good about us.\" Thu, October 2, 2025 at 2:18 PM UTC Grace O'Donnell OpenAI valuation spurs stock rally in Nvidia, AI chipmakers Excitement over OpenAI's ( OPAI.PVT ) $500 billion valuation sparked a rally in AI stocks on Thursday, after the company surpassed Elon Musk's SpaceX ( SPAX.PVT ) as the most valuable startup . Shares of AI chipmakers Nvidia ( NVDA ), Broadcom ( AVGO ), and AMD ( AMD ) gained about 1.5%, 2%, and 3%, respectively, in early trading. Nvidia stock hit an intraday all-time high of $190 on Thursday morning, as optimism around AI chip demand eased investors' concerns about Nvidia's $100 billion investment in OpenAI. It's been a news-filled week for OpenAI, which released its new video generation AI model, Sora, and announced a partnership with Samsung ( 005930.KS ) and SK Hynix ( 000660.KS ) to increase the supply of advanced memory chips. Current and former OpenAI employees also sold about $6.6 billion of stock to investors, which is what boosted the ChatGPT maker's valuation to an estimated $500 billion. Thu, October 2, 2025 at 1:46 PM UTC Grac"
    },
    {
      "title": "Wall Street Notches Fresh Records as Government Shutdown Drags On",
      "content": "PREMIUM Wall Street Notches Fresh Records as Government Shutdown Drags On MT Newswires October 2, 2025 4 min read In this article: ^DJI ^SPX Main equity indexes nudged higher to new peaks on Thursday as Wall Street appeared largely unshaken PREMIUM Upgrade to read this MT Newswires article and get so much more. A Silver or Gold subscription plan is required to access premium news articles. Upgrade Already have a subscription? Sign in Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla sales jump after months of boycotts: Can the momentum continue?",
      "content": "Europe News Thirty-five MEPs urge von der Leyen to push for Várhelyi's resignation Economy Tensions high as China and EU prepare another meeting on rare earths Top News Stories Today Latest news bulletin | October 24th, 2025 – Evening Travel News Angola, Mozambique and Egypt advocate greater cooperation to promote tourism in Africa Europe News Thirty-five MEPs urge von der Leyen to push for Várhelyi's resignation Economy Tensions high as China and EU prepare another meeting on rare earths Top News Stories Today Latest news bulletin | October 24th, 2025 – Evening Travel News Angola, Mozambique and Egypt advocate greater cooperation to promote tourism in Africa Business Business Tesla sales jump after months of boycotts: Can the momentum continue? FILE. Elon Musk speaks during an event with President Donald Trump in the Oval Office at the White House. 11 Feb. 2025. - Copyright AP/Alex Brandon Copyright AP/Alex Brandon By&nbsp AP with Euronews Published on 03/10/2025 - 9:22 GMT+2 Share this article Comments Share this article Facebook Twitter Flipboard Send Reddit Linkedin Messenger Telegram VK Bluesky Threads Whatsapp Tesla stock rose sharply on the sales news, but closed the day down 5% amid scepticism that the new number really signals a turnaround. Months after Elon Musk left the Trump administration — appeasing Tesla investors worried about boycotts — the world's richest man has announced some good news. Sales of Tesla cars are back. Well, maybe. Musk's EV company reported on Thursday that car sales jumped 7% in the three months through September after plunging for most of the year. Musk's embrace of US President Donald Trump and far-right politicians in Europe turned away large swathes of customers, who came to associate the brand with Musk's controversial ideology. But the jump comes with a caveat. Tesla benefitted from consumers in the US taking advantage of a $7,500 (€6,400) tax credit before it expired on 30 September, prompting a surge in buying that helped all EV makers. In fact, many Tesla rivals saw sales rise more. Rivian Automotive, for example, reported a 32% increase. Tesla stock rose sharply on the sales news, but closed the day down around 5% amid scepticism that the new number really signals a turnaround given all the anti-Musk backlash. Related Tesla sales down by 40% in Europe while Chinese BYD triples its sales Musk buys Tesla stock - could he become the first global trillionaire? “I don’t think most people are any more enamoured with Elon now than they were a few months ago,\" said Telemetry Insight's Sam Abuelsamid. \"I expect this is more a blip for Tesla than the restart of growth.” Even Tesla bull Dan Ives of Wedbush Securities was cautious, noting that there are \"still demand issues”. Still, it was a blowout number with sales hitting 497,099 vehicles, versus 462,890 in the same period last year. Analysts expected a small drop to 456,000. Investors cheered Musk’s decision in April to leave Washington for Austin, Texas, where Tesla is headquartered. But he is still heavily involved in political and social wars, alienating potential car buyers. On Wednesday, he posted on X that he was cancelling his Netflix subscription because of what he termed \"transgender woke agenda\", taking offense with the show \"Dead End: Paranormal Park\", which features a transgender character. Musk also responded to a post criticising alleged statements made by the show’s creator, Hamish Steele, related to the assassination of conservative activist Charlie Kirk. Musk's renewed focus on Tesla The sharp fall in Tesla stock on Thursday was remarkable as investors have been surprisingly optimistic about the company in recent weeks, despite terrible financial figures. Investors drove the stock up 34% in September alone in a bet that Musk’s planned new cheaper version of his bestselling Model Y will recharge sales. Musk has also shifted investor attention away from cars to other aspects of the business, such as the rollout of its driverless robotaxi service and its Optimus robots for factory work and household chores. Related Elon Musk's fortune briefly jumped to a record $500 billion Tesla stock rises as Trump-Musk feud cools and robotaxi launch nears Driving the stock higher has also been Musk’s apparent renewed focus on the company. To hold his attention, Tesla's board proposed last month a pay package that would allow Musk to earn $1 trillion (€850 billion) if he meets certain financial goals over the next several years. The pay offer, unprecedented for US companies known for outsized CEO compensation, drew criticism from Pope Leo in an interview lamenting widening income gaps. If Musk meets the goals, he could set a record on top of his own record. He recently became the first person ever to hit $500bn (€430bn) in net worth, at least according to Forbes magazine's rich list. Backlash in Europe The 7% sales rise in the last quarter compares with a 13% drop in the first three months of the year when Musk led Trump’s government cost-cutting efforts at the Department of Government Efficiency. In the following three months through June, sales plunged 13% again. The anti-Musk backlash in Europe had also been fierce. Sales plunged 40% in more than two dozen countries after he publicly supported far-right politicians there. Musk said a British prime minister was an “evil tyrant” who belongs in prison and told Germans “things will get very, very much worse” in their country if they didn’t vote for the anti-immigrant Alternative for Germany party. Protests broke out in several cities, including a hanging of the billionaire in effigy in Milan and posters in London likening him to a Nazi. Robyn Denholm, Tesla's head of the board of directors, nonetheless told Bloomberg that she was unsure if Musk’s politics have had any impact on the company’s finances. Denholm has earned nearly $700 million (€600mn) in compensation for serving on the board since 2014, a package that itself has drawn criticism. Tesla will report third-quarter earnings later this month. Profits for the previous quarter fell 16% as the company continued to lose market share to European EV makers and fast-growing Chinese rivals, such as BYD. Musk's new robotaxi service, which began with a test-run in Austin in June, has had some hitches. There have been reports of the cabs stopping suddenly for no reason and even driving in the opposing lane. But Musk says the service will quickly roll out anyway, with launches in several other cities earmarked for the end of next year. Go to accessibility shortcuts Share this article Comments Read more Business Uzbekistan hosts international forum on fair business Business Jaguar Land Rover cyberattack drives UK car production to 73-year low Business German lift maker responds to Louvre heist with playful marketing post stock exchange Car sales Donald Trump Elon Musk Tesla Electric cars ADVERTISEMENT ADVERTISEMENT Top stories Eurozone private sector logs strongest growth in over two years Warsaw Stock Exchange seeks developed market status within 3-5 years Jaguar Land Rover cyberattack drives UK car production to 73-year low Revolut Western Europe CEO: “Not specifically in a hurry” for licences Tensions high as China and EU prepare another meeting on rare earths ADVERTISEMENT ADVERTISEMENT Most read 1 German lift maker responds to Louvre heist with playful marketing post 2 Trump ends trade talks with Canada over anti-tariff TV advert 3 China focuses on high-tech and consumers as trade wars hit economy 4 Qatar and US warn EU law may threaten energy security in Doha talks 5 Too costly to mint? Germany says 'nein' to silver commemorative coins ADVERTISEMENT ADVERTISEMENT Business Uzbekistan hosts international forum on fair business Business Jaguar Land Rover cyberattack drives UK car production to 73-year low Business German lift maker responds to Louvre heist with playful marketing post Eurozone private sector logs strongest growth in over two years Warsaw Stock Excha"
    },
    {
      "title": "These Stocks Are Moving the Most Today: Tesla, Applied Materials, Boeing, Rumble, and More",
      "content": "These Stocks Moved the Most Today: Tesla, Applied Materials, Apple, Plug Power, Wynn Resorts, Rumble, and More These Stocks Moved the Most Today: Tesla, Applied Materials, Apple, Plug Power, Wynn Resorts, Rumble, and More · Barrons.com Joe Woelfel October 3, 2025 4 min read In this article: MGM TSLA AMAT AAPL PLUG Stocks were mostly higher Friday as investors continued to shrug off the government shutdown. Tesla declined 1.4%, extending losses from Thursday’s session when it fell 5.1% after it reported third-quarter deliveries of 497,099 cars, a record for any quarter. Tesla stock has gained 4.3% this year. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Stock Market Today: Dow Rises As Jobs Report Nixed; Astera, Nvidia, Tesla Rally (Live Coverage)",
      "content": "Stock Market Today: Dow, S&P At Highs; Palantir Slides On Army Network Concerns (Live Coverage) Stock Market Today: Dow, S&P At Highs; Palantir Slides On Army Network Concerns (Live Coverage) · Investor's Business Daily SCOTT LEHTONEN and KEN SHREVE and VIDYA RAMAKRISHNAN October 3, 2025 7 min read In this article: PLTR ^DJI ^SPX ^IXIC Stock Market Today: Small caps lead the way in Friday trading. Shopify jumps, but sellers hit several AI stocks, including Palantir. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tech-heavy Nasdaq turns lower as Palantir, Big Tech stocks drop",
      "content": ""
    },
    {
      "title": "Tesla May Be Behind in Driverless Vehicles, but Here's a Silver Lining",
      "content": "Tesla May Be Behind in Driverless Vehicles, but Here's a Silver Lining By Daniel Miller – Oct 4, 2025 at 6:05PM Key Points Tesla's robotaxi service finally hit the big stage, at least in some form. Tesla remains years behind Waymo in terms of needing a driver to supervise the vehicle. Once Tesla is fully autonomous, it has a couple of advantages it can seize. NASDAQ : TSLA Tesla Market Cap $1.4T Today's Change angle-down ( -3.40 %) $ 15.26 Current Price $ 433.72 Price as of October 24, 2025 at 4:00 PM ET Tesla is set up for wild ups and downs in the coming quarters, but here's what investors should focus on. There are a whirlwind of things happening around Tesla ( TSLA 3.40% ) right now, both good and bad. On the one hand, the company is dealing with a talent exodus with multiple executives leaving, consumer backlash at CEO Elon Musk's political antics, declining global sales, and an aging vehicle lineup, just to name a few. On the other hand, the company believes it can be the most valuable company in the world as it transitions from vehicle production to a company based on artificial intelligence (AI), robotics , and driverless vehicles. The question remains: Where will Tesla's stock trade during all of this madness? Falling behind? One of the biggest developments for Tesla investors over the summer happened in Austin, Texas, where the company launched its robotaxi pilot. However, three months into its robotaxi pilot with a small number of Model Ys operating, it still requires a safety driver just in case, and it still only operates with invite-only passengers. Image source: Tesla. Sure, it was a step forward after the company had long promised such a service, but Tesla is still behind its primary rival, Waymo, which is moving into new cities and doesn't require a safety driver to supervise its driverless vehicle. While the slower and smaller initial test may have made investors cautious, Musk remains ambitious. During Tesla's July 23 earnings call, he noted that the autonomous ride-hailing service would reach across most of the country and \"probably\" address half the U.S. population by the end of 2025 -- lofty targets, to be sure. No small matter Make no mistake, this is a huge development for investors and the stakes are high. Tesla's slow rollout has some onlookers pumping the brakes. \"It's an acknowledgment that their software isn't as mature as they thought it was and they're going to need more time with a safety driver,\" said Carnegie Mellon professor Philip Koopman, an expert in autonomous vehicle safety, according to Automotive News . \"That's OK for everyone except the people who invested thinking there'd be a million of these cars on the road by the end of the year,\" he said. Investors looking for a silver lining might have to squint to see it more clearly, but it's there. One reason Tesla remains a serious threat to its rivals such as Waymo is because once the autonomous technology and robotaxi become fully autonomous, the automaker can easily produce tons of vehicles from its factories in California and Texas. Expand NASDAQ : TSLA Tesla Today's Change ( -3.40 %) $ -15.26 Current Price $ 433.72 Key Data Points Market Cap $1442B Day's Range $ 430.17 - $ 451.68 52wk Range $ 214.25 - $ 488.54 Volume 95M Avg Vol 88M Gross Margin 17.01 % Dividend Yield N/A Long term, Tesla's gigafactory production is an advantage. But the company also has a cost advantage over its rivals as it only uses cameras for its self-driving technology, rather than more expensive sensors such as radar and lidar. Investors also have to keep in mind Tesla may be behind at the moment, but at the same time could make progress faster than its competitors. In fact, if Tesla can change to no safety driver in the next 12 months, that'll be faster than any other robotaxi company that's accomplished the feat. For context, Waymo tested for years with safety drivers before going fully autonomous, but that was back in 2020. What it all means Tesla's progress with autonomous vehicles has been slower than desired, but investors should focus on if the company can do it without sensors, and do it effectively. At this point doing it right is much more valuable than doing it faster -- that battle may already be over. That said, Tesla has seemingly gone all-in on its future transition from only producing vehicles to becoming an AI, robotics, and robotaxi service company, which could be lucrative if it's all achieved. Until then, investors are going to need plenty of patience, especially considering the third quarter is likely to be strong -- remember the end of the $7,500 tax credit pulled demand into the third quarter. That should be followed by several rather bumpy quarters for not only Tesla but the broader electric vehicle industry. About the Author Daniel Miller is a contributing Motley Fool stock market analyst covering industrials and consumer goods, with a focus on automotive companies. He previously worked as a product manager in the automotive aftermarket industry. Miller holds a bachelor’s degree in business management from Emporia State University. TMFTwoCoins Daniel Miller has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy . Stocks Mentioned Tesla NASDAQ: TSLA $433.72 ( 0.03 %) $ 15.26 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Tesla Returns to Double-Digit Revenue Growth. Time to Buy the Stock? 2 Reasons I'm Excited About Tesla Stock Following Last Week's Earnings Report Where Will Tesla Be in 1 Year? 1 Terrible Surprise From Tesla's Earnings Call Wednesday 3 Make-or-Break Items From Tesla to Note From Yesterday's Earnings Report"
    },
    {
      "title": "Tesla Inc. (TSLA) Receives EV Sales Boost in Europe in September",
      "content": "Tesla Inc. (TSLA) Receives EV Sales Boost in Europe in September Abdul Rahman October 5, 2025 2 min read In this article: TSLA Tesla Inc. (NASDAQ: TSLA ) is one of the best stocks to buy right now, according to Nancy Pelosi . On October 1, new data emerged indicating that the electric vehicle giant could be gaining market share in Denmark. Bilstatistik.dk reports that registrations of the company’s latest cars rose by 20.45% in September, with the Model Y topping the list in new registrations. Tesla Inc. (TSLA) Receives EV Sales Boost in Europe in September Pixabay/Public Domain The report also indicates that Tesla sales rose by 2.7% in France, with the revamped Model Y emerging as the best-selling car. In Norway, the US EV giant also reported a 14.7% increase in sales of the Tesla Model Y and Model 3. Nevertheless, the automaker remains under pressure, its sales having dropped by 42.9% from January through August in the European Union. The company has been under pressure from new electric vehicles made by European and Chinese companies. However, it remains optimistic about the updated Model Y, rolled out in June, as it steadies demand and lays the groundwork for recovery. Tesla Inc. (NASDAQ:TSLA) designs, manufactures, and sells electric vehicles (EVs), battery energy storage solutions, and solar energy generation products, with the goal of accelerating the world’s transition to sustainable energy. The company also develops and deploys artificial intelligence (AI) for advanced driver-assistance systems and robotics, and sells related software and hardware. While we acknowledge the potential of TSLA as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 12 Cheap AI Stocks to Buy Right Now and 10 Best Performing ASX Stocks in 2025 . Disclosure: None. This article is originally published at Insider Monkey . View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Government Shutdown, OpenAI Conference and Other Can't Miss Items this Week",
      "content": "Your browser of choice has not been tested for use with Barchart.com. If you have issues, please download one of the browsers listed here . Less than $10/month! Get more Watchlists, Portfolios, Custom Views and Chart Templates with Barchart Plus. FREE 30 Day Trial Log In Menu Stocks | Futures | Watchlist | News | More Advanced search or Select a Commodity Wheat Corn Soybeans Soybean Meal Soybean Oil Oats Rough Rice Hard Red Winter Wheat Spring Wheat Canola Crude Oil WTI ULSD NY Harbor Gasoline RBOB Natural Gas Crude Oil Brent Ethanol Gold Silver High Grade Copper Platinum Palladium Aluminum Live Cattle Feeder Cattle Lean Hogs Pork Cutout Class III Milk Nonfat Dry Milk Dry Whey Butter Cash-Settled Cheese Cash-Settled Cotton #2 Orange Juice Coffee Sugar #11 Cocoa Lumber S&P 500 E-Mini Nasdaq 100 E-Mini Dow Futures E-Mini Russell 2000 E-Mini S&P Midcap E-Mini S&P 500 Micro S&P Nasdaq Micro S&P 500 VIX U.S. Dollar Index Bitcoin Micro Ether Micro British Pound Canadian Dollar Japanese Yen Swiss Franc Euro FX Australian Dollar Mexican Peso New Zealand Dollar South African Rand Brazilian Real T-Bond Ultra T-Bond 10 Year T-Note 5 Year T-Note 2 Year T-Note Ultra T-Note 30 Day Fed Funds 3-Month SOFR Crude Oil Brent Crude Oil WTI Gas Oil UK Natural Gas Dutch TTF Gas RBOB Blendstock Heating Oil Euro Bund Euro Bobl Euro Schatz Euro Buxl Euro OAT Long-Term Euro BTP Long-Term Eurex Conf Long-Term Euro Bono Long-Term 10-Year Long Gilt 3-Month EuriBor 3-Month ESTR 3-Month SONIA 3-Month SARON Rapeseed Feed Wheat Milling Wheat Corn Euro Stoxx 50 Index FTSE 100 Index DAX Index Swiss Market Index CAC 40 Index AEX Index BEL 20 PSI 20 IBEX 35-Mini OMX Swedish Index VSTOXX Mini Steel Scrap Steel Rebar Cocoa #7 Coffee Robusta 10-T Sugar White #5 Watchlist | Portfolio | Dashboard MAIN MENU Home Stocks Options Learn ETFs Futures Currencies Watchlist Investing News Tools Portfolio POPULAR Stocks Percent Change Top 100 Stocks Stocks Highs/Lows Stocks Volume Leaders Unusual Options Activity Options Volume Leaders Commodities Grains Energies Alerts Pre-Market Post-Market Stocks Stocks Market Pulse Stock Market Overview Market Momentum Market Performance Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices S&P Indices S&P Sectors Dow Jones Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map Industry Performance Stocks by Grouping Options Options Market Pulse Options Market Overview Unusual Options Activity Options Flow Upcoming Earnings Volatility IV Rank and IV Percentile Implied vs Realized Vol Highest Implied Volatility %Change in Volatility Volume & Open Interest Most Active Options Unusual Options Volume Options Volume Leaders Highest Open Positions Change in Open Interest %Change in Open Interest Data & Tools Options Time & Sales Options Price History Options Calculator Options Learning Center Option Screeners Options Screener Long Call Screener Long Put Screener Income Strategies Covered Call Naked Put Vertical Spreads Bull Call Spread Bear Call Spread Bear Put Spread Bull Put Spread Protection Strategies Married Put Protective Collar Straddle and Strangle Long Straddle Short Straddle Long Strangle Short Strangle Horizontal Strategies Long Call Calendar Long Put Calendar Long Call Diagonal Short Call Diagonal Long Put Diagonal Short Put Diagonal Butterfly Strategies Long Call Butterfly Short Call Butterfly Long Put Butterfly Short Put Butterfly Long Iron Butterfly Short Iron Butterfly Condor Strategies Long Call Condor Short Call Condor Long Put Condor Short Put Condor Long Iron Condor Short Iron Condor ETFs ETFs Market Pulse ETF Market Overview Popular ETFs ETF Finder Top 100 ETFs Today's Price Surprises New Highs & Lows Top Dividend ETFs ETF Screener Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Signals New Recommendations Top ETFs to Own Top Signal Strength Top Signal Direction ETFs Signal Upgrades Mutual Funds Today's Price Surprises New  Highs & Lows Performance Price Change Funds Screener Futures Futures Market Pulse Futures Market Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures Prices by Exchange Commodity Groupings Commodities Prices Currencies Energies Financials Grains Indices Livestock Metals Softs Mini & Micro Futures Trade Futures With Plus500 Futures Trading Guide Trading Guide Historical Performance Commitment of Traders Commitment of Traders Legacy Report Disaggregated Report Financial TFF Report Resources Contract Specifications Futures Expirations First Notice Dates Options Expirations Economic Calendar Cash Markets Cash Markets Overview Corn Indexes Soybean Indexes European Futures Euro Futures Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures European Groupings Commodities Prices Energies Financials Grains Indices Metals Softs Power Futures Carbon Futures Baltic Freight Indices European Trading Guide European Trading Guide Historical Performance Currencies Currencies Forex Market Pulse Forex Market Overview Long Term Trends Today's Price Surprises Highs & Lows Forex Market Map Performance Leaders Currency Converter Crypto Market Pulse Crypto Market Overview Market Capitalizations Bitcoin Futures Trading Signals New Recommendations Commitment of Traders Commitment of Traders Legacy Report Financial TFF Report Currency Groupings Popular Cross Rates Australian Dollar British Pound Canadian Dollar Euro FX Japanese Yen Swiss Franc US Dollar Metals Rates All Forex Markets Crypto Groupings Popular Coins Bitcoin Bitcoin-Cash Ethereum Litecoin Monero XRP Tether Zcash Investing Investing Investing Ideas Today’s Investing Ideas Top Performing Stocks Top Trending Tickers Barchart Screeners Insider Trading Insider Trading Activity Politician Insider Trading Today's Picks Chart of the Day Top Stock Pick Futures Trading Guide My Screeners Stock Screener ETF Screener Funds Screener Options Screener Technical Ideas Bullish Moving Averages Bearish Moving Averages Breakouts and Reversals Candlestick Patterns eMACD Buy Signals Hot Penny Stocks Standout Stocks Top Stocks Under $10 TTM Squeeze Up Trending Stocks Down Trending Stocks Dividend Ideas Best Dividend Stocks Dividend Aristocrats Dividend Kings Power Investors Cathie Wood Stocks Warren Buffett Stocks Themed Lists AI Stocks Battery Stocks Biotechnology Stocks Cannabis Stocks Clean Energy Stocks Crypto Stocks Cybersecurity Stocks Data Center Stocks EV Stocks Fintech Stocks Gold Stocks Magnificent 7 Metaverse Stocks Nuclear Energy Stocks Oil Stocks Power & Infrastructure Quantum Computing REIT Stocks Semiconductor Stocks Stagflation Stocks SPAC Stocks World Markets News News Barchart Markets Today Barchart News Exclusives Contributors Chart of the Day News Feeds Featured Authors Andrew Hecht Austin Schroeder Caleb Naysmith Darin Newsom Don Dawson Elizabeth H. Volk Gavin McMaster Jim Van Meerten Josh Enomoto Mark Hake Oleksandr Pylypenko Rich Asplund Rick Orford Sarah Holzmann All Authors Commodity News All Commodities Energy Grains Livestock Metals Softs Financial News All Financials Crypto Dividends ETFs FX Interest Rates Options "
    },
    {
      "title": "Why your S&P 500 index fund might be more risky than the internet bubble",
      "content": ""
    },
    {
      "title": "Top Stock Movers Now: AMD, Tesla, Comerica, Verizon, and More",
      "content": "Top Stock Movers Now: AMD, Tesla, Comerica, Verizon, and More By Bill McColl Full Bio Bill McColl has 25+ years of experience as a senior producer and writer for TV, radio, and digital media leading teams of anchors, reporters, and editors in creating news broadcasts, covering some of the most notable news stories of the time. Learn about our editorial policies Published October 06, 2025 12:22 PM EDT AMD shares soared Monday after the chipmaker announced a deal with OpenAI. Costfoto / NurPhoto / Getty Images Close Key Takeaways The S&P 500 and Nasdaq climbed Monday afternoon as tech stocks gained, while a slide in shares of Verizon weighed on the Dow. A deal which could give OpenAI a 10% stake in Advanced Micro Devices sent shares of the chipmaker soaring. Verizon named former PayPal CEO Dan Schulman as its CEO, and shares of the telecom company dropped. Major U.S. equities indexes were mixed in recent trading, as tech sector gains helped lift the S&P 500 and Nasdaq higher to start the week, while a slide in shares of Verizon ( VZ ) weighed on the Dow. Verizon Communications ( VZ ) was the worst-performing stock on the Dow and among the biggest decliners in the S&P 500 after the telecom company announced former PayPal ( PYPL ) CEO Dan Schulman would take over as its new CEO. Shares of International Paper ( IP ) and Smurfit Westrock ( SW ) also dropped as British rival Mondi warned challenging market conditions would hurt profits. Advanced Micro Devices ( AMD ) was the best-performing stock in the S&P 500, adding nearly 30% to hover around their closing record, after the chipmaker announced a deal with ChatGPT maker OpenAI that could have the AI startup take a 10% stake in AMD. Tesla ( TSLA ) stock climbed after the EV maker teased a Tuesday event that analysts think could bring a lower-cost model. Critical Metals ( CRML ) shares soared following a report the Trump administration is considering taking a stake in the rare earth minerals miner. Comerica ( CMA ) shares also jumped after Fifth Third Bancorp ( FITB ) agreed to buy the financial firm in an all-stock deal valued at $10.9 billion. The price of gold hit an all-time high, and oil prices rose after OPEC and its allies agreed to a modest production increase . The yield on the 10-year Treasury note rose. The U.S. dollar gained on the euro, pound, and yen. Most major cryptocurrencies traded higher, after Bitcoin reached a record high over the weekend. Do you have a news tip for Investopedia reporters? Please email us at [email protected] Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace. Read more News Markets News Partner Links Take the Next Step to Invest Advertiser Disclosure × The offers that appear in this table are from partnerships from which Investopedia receives compensation. This compensation may impact how and where listings appear. Investopedia does not include all offers available in the marketplace."
    },
    {
      "title": "Stock Market Today: Dow Jones Dips, But More Stocks Clear Entries; This Cheap Stock Rockets On Trump Report (Live Coverage)",
      "content": "Stock Market Today: Dow Dips, AppLovin Dives; Cathie Wood Loads Up On This Stock (Live Coverage) Stock Market Today: Dow Dips, AppLovin Dives; Cathie Wood Loads Up On This Stock (Live Coverage) · Investor's Business Daily MICHAEL LARKIN and ED CARSON October 6, 2025 14 min read In this article: ^DJI CRTM.L AMD OPAI.PVT PLTR The Dow Jones dipped Monday as AppLovin cratered. Tesla and Palantir rallied on the stock market today. Cathie Wood bought a China stock. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla to reveal cheaper Model Y in response to loss of tax credit",
      "content": "Tesla reveals cheaper Model Y and Model 3 Standard versions The 2 less-expensive Tesla models are expected to boost sales in a post-EV tax credit world. Pras Subramanian · Senior Reporter Updated October 7, 2025 3 min read In this article: TSLA Tesla ( TSLA ) finally revealed a stripped-down version of its Model Y, dubbed the Standard, and in a surprise move announced the Model 3 Standard as well. The two cars are now available for order on Tesla's US website. The Model Y Standard is rear-wheel drive, will start at $39,990, and has an estimated range of 321 miles with standard 18-inch wheels. The Model 3 Standard comes in even cheaper, at $36,990, and has the same range. While the Model Y Standard is available for November/December delivery, the Model 3 Standard arrives a little later, with a December/January delivery range. Appearance-wise, the Standard trim omits the front and rear light bars on the Model Y and comes in only three colors: Stealth Grey, white, and Diamond Black. The only interior color available is black. Tesla's new Model Y Standard. · tesla.com Tesla stock gained more than 5% on Monday after the EV maker posted gifs on Sunday of a spinning company logo with the date \"10/7\" and what appeared to be car headlights shining through smoke . Shares pulled back nearly 4% on Tuesday following the update to Tesla's website. Inside, both Standard trims feature the same 15.4-inch infotainment screen as the more expensive models. However, there's no second-row screen, the ambient lighting has been removed, and cheaper cloth seating inserts surround vegan leather, per Tesla's website. Interestingly, Tesla removed the AM/FM radio tuners from the Standard trim, and the Standard models can only perform \"traffic aware cruise control,\" Tesla's version of adaptive cruise control, and are unable to perform \"autosteer\" functions like Autopilot and Full Self-Driving (FSD). It is also likely that Tesla has wrung out costs from its batteries and electric motors to make the vehicles cheaper. The Model Y and Model 3 Standard versions come after the federal EV tax credit expired in the US on Sept. 30. CEO Elon Musk said in the company's second quarter earnings call that the cheaper Model Y would come out after the tax credit expires. Read more: How to avoid the sticker shock on Tesla car insurance Tesla said following Q2 earnings that the first builds of a more affordable model occurred in June, with volume production planned for the second half of 2025. Tesla's release of these cheaper vehicles is expected to help grow volume for the automaker, which has seen sales dip in recent quarters, although Q3 sales jumped as buyers bought EVs ahead of the tax credit expiration. Tesla's new, cheaper Model 3 Standard sedan. · Tesla.com Last quarter, Tesla CFO Vaibhav Taneja said he expected a pull forward of sales in Q3 because of the tax credit expiration, and the numbers back up that claim. Story continues Tesla reported Q3 deliveries came in at 497,099, easily topping Bloomberg consensus estimates of around 439,800 and the 462,890 units delivered a year ago. Tesla said Q3's total was a new quarterly record for the company. Tesla is set to report full Q3 results on Oct. 22 after the closing bell, with the company's annual shareholder meeting to follow on Nov. 6. StockStory aims to help individual investors beat the market. Pras Subramanian is the lead auto reporter for Yahoo Finance. You can follow him on X and on Instagram . Click here for the latest stock market news and in-depth analysis, including events that move stocks Read the latest financial and business news from Yahoo Finance View comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Stock market today: Dow, S&P 500, Nasdaq slip after records as gold tops $4,000",
      "content": "Stock market today: Dow slides, S&P 500 and Nasdaq snap winning streaks as Oracle leads tech stocks lower Brett LoGiurato , Karen Friar and Ines Ferré Updated October 7, 2025 2 min read In this article: ^GSPC ORCL ^DJI ^SPX ^IXIC US stocks slipped from their latest record-setting run on Tuesday, as Wall Street weighed worries over the government shutdown against hopes for artificial intelligence. The Dow Jones Industrial Average ( ^DJI ) fell 0.2%. The S&P 500 ( ^GSPC ) dropped around 0.4%, while the tech-heavy Nasdaq Composite ( ^IXIC ) decreased roughly 0.7% after fresh record high closes on Wall Street. Gold ( GC=F ) futures topped $4,000 per ounce for the first time ever, as investors continue to flock to the safe-haven asset . The pullback in stocks comes after the S&P and Nasdaq both scored their seventh win in a row on Monday, boosted by news of a multibillion-dollar deal between AMD ( AMD ) and OpenAI ( OPAI.PVT ) that sent the chip company's stock rocketing higher. But the AI trade lost some steam Tuesday, led by a decline in Oracle ( ORCL ) stock after a report said the profit margin in its cloud computing business was likely lower than many Wall Street forecasts. Shares of Oracle fell as much as 7% throughout the day but closed 2% lower. Tesla ( TSLA ) shares also lost steam, dropping 4%, after the EV maker unveiled a cheaper Model Y priced under $40,000 on Tuesday in a launch initially teased in a series of cryptic social media posts. Earnings results will take on even greater prominence than usual for markets during the US government shutdown. The longer the federal stoppage drags on, the more clouded the picture of the economy will become for investors as key data releases dry up, making it hard to divine the path of interest rates. It has already delayed the September jobs report that was due Friday. Next week's releases on consumer and producer inflation, crucial to the Federal Reserve's decision making, could also be postponed. Meanwhile, the Washington gridlock on a funding bill continues. President Trump signaled he would negotiate with Democrats over the healthcare subsidies they want to extend but only after the government is reopened. He also amped up threats toward federal workers. LIVE COVERAGE IS OVER 23 updates Tue, October 7, 2025 at 8:01 PM UTC Ines Ferré Stocks retreat from record highs as Oracle shares sink Stocks pulled back from record highs on Tuesday as Oracle ( ORCL ) shares fell after a report suggested the software giant’s cloud-computing margins may be smaller than what Wall Street anticipates. The Dow Jones Industrial Average ( ^DJI ), S&P 500 ( ^GSPC ), and Nasdaq Composite ( ^IXIC ) all fell less than 1% after the broader index and tech-heavy gauge notched new records in the prior session. Stocks turned negative after a report from the Information stated that internal documents show Oracle's overall gross margin has fallen to 67.3%, its lowest in more than a year, amid heavy spending on chips and data center expansion. Oracle stock fell 7% before trimming losses. At the close, it was down 2%. Tue, October 7, 2025 at 7:15 PM UTC Ines Ferré Gold’s melt-up could be due for a pause or pullback, says strategist Gold could be due for a pullback following a massive year-to-date gain of more than 50%, warns one strategist. Gold rallied to record highs above $4,000 on Tuesday after completing a seven-week winning streak. \"A breakout above the channel would be a bullish sign for a continuation of the accelerating uptrend,\" said Adam Turnquist, chief technical strategist for LPL Financial. \"However, a failure here would suggest gold’s melt-up could be due for a pause or pullback,\" he added. Turnquist noted the latest leg higher has been underpinned by growing uncertainty over the US government shutdown and fear of missing out (FOMO) flows into physical gold ETFs, which reached record levels in September and the last quarter. Tue, October 7, 2025 at 6:57 PM UTC Ines Ferré Tesla prices more affordable Model Y at under $40,000 Tesla ( TSLA ) has priced its Model Y SUV below $40,000 in its debut of a more affordable version of its bestselling car. The standard model is offered in Stealth Grey for $39,990. White Pearl and Diamond Black-colored cars are offered at just over $40,000. Meanwhile, the Model 3 standard is offered at just under $37,000. Tesla shares declined on Tuesday after jumping 5% in the prior session in reaction to the EV maker's social media posts over the weekend, which ignited excitement among the company's fans. Tue, October 7, 2025 at 6:00 PM UTC Ines Ferré Bull market 'on track' despite fears of AI bubble, says UBS Megadeals with the AI industry have been fueling market euphoria. OpenAI's ( OPAI.PVT ) latest deals with heavyweights like AMD, Nvidia, Oracle, and Broadcom pushed the S&P 500 ( ^GSPC ) into its seventh consecutive day of gains on Tues, its longest winning streak since May. “With hundreds of billions in investment commitments and the bull market on track for its three-year anniversary, fears of an AI bubble that could rival the dotcom era are mounting. But there have been warnings of a bubble for almost as long as the AI boom has been in full swing,\" said UBS strategists led by Ulrike Hoffmann-Burchardi, chief investment officer Americas and Global Head of Equities at UBS. \"In our view, a period of consolidation would not come as a surprise after such a strong recent run, but we believe the equity rally is underpinned by solid fundamentals that should continue to support the market.” On Tuesday, tech stocks pulled back after a report suggested that Oracle's ( ORCL ) cloud-computing margins may be smaller than what Wall Street has been estimating. Tue, October 7, 2025 at 5:35 PM UTC Ines Ferré Oracle shares sink on report margins are smaller than what Wall Street expects Oracle ( ORCL ) shares fell on Tuesday, weighing on the broader market after a report suggested the software giant’s cloud-computing margins are smaller than what Wall Street expects. According to the Information, internal documents show Oracle generated about $900 million from renting Nvidia-powered servers during the quarter ended in August, but earned just $125 million in gross profit. The company’s overall gross margin fell to 67.3%, its lowest in more than a year, amid heavy spending on chips and data-center expansion. The report said Oracle lost “considerable” sums on some smaller Nvidia chip rentals. Oracle shares sank 3% during Tuesday's session. Shares have surged more than 60% this year on surging AI demand and a deal with OpenAI ( OPAI.PVT ) to provide 4.5 gigawatts of data center capacity. Tue, October 7, 2025 at 5:15 PM UTC Ines Ferré Income growth expectations slide to lowest since 2021 amid weak job market Yahoo Finance's Emma Ockerman reports: Read more here. Tue, October 7, 2025 at 4:30 PM UTC Ines Ferré Why small-cap stocks are starting to see earnings growth after best quarter since 2021 Yahoo Finance's Jake Conley reports: Read more here. Tue, October 7, 2025 at 3:45 PM UTC Ines Ferré CEOs send Trump a warning: Tariffs will pound our business — and we'll raise prices Yahoo Finance's Francisco Velasquez reports: Read more here. Tue, October 7, 2025 at 3:15 PM UTC Ines Ferré Trilogy Metals stock explodes on news of 10% stake by Trump admin and EO ordering permits for Alaska road Yahoo Finance's Jake Conley reports: Read more here. Tue, October 7, 2025 at 2:45 PM UTC Ines Ferré A healthcare compromise could end the shutdown. The question is when. Yahoo Finance's Ben Werschkul reports: Read more here. Tue, October 7, 2025 at 1:52 PM UTC Karen Friar Gold soars above $4,000 as ETFs see strongest quarter on record Gold futures ( GC=F ) soared to all-time highs above $4,000 on Tuesday as investors piled into the precious metal amid a weakening dollar and growing expectations for more Federal Reserve rate cuts. Meanwhile, global ETFs backed by gold just recorded their biggest quarterly inflows ever, per a World Go"
    },
    {
      "title": "Tesla offers cheaper versions of 2 electric vehicles in bid to win back market share in tough year",
      "content": "Tesla offers cheaper versions of 2 electric vehicles in bid to win back market share in tough year BERNARD CONDON October 7, 2025 2 min read In this article: TSLA NEW YORK (AP) — Tesla rolled out new, cheaper versions of two of its electric car models on Tuesday in hopes the offerings will help revive flagging sales but investors dumped its stock anyway. The new Model Y, costing just under $40,000 with a stripped-down interior, comes in a brutal year for Tesla as it tries to attract more customers despite an aging lineup, stiff competition from foreign EV makers and anti-Elon Musk boycotts targeting the company. The reaction from the stock market after the news broke suggests the new models are not expected to help much. “Investors were looking for something truly different, not an iteration of a old product,” said Edmunds analyst Ivan Drury, speaking as Tesla stock dropped sharply in the last minutes of trading. “I can’t imagine this will bring levels back to what they want.” Tesla also announced a cheaper version of its Model 3 for under $37,000. For New York residents taking advantage of a state rebate, the price was below $35,000. Tesla has talked about a cheaper car to appeal to more cost-conscious consumers for years, though the two new “standard” models are priced well above the $25,000 price tag promised. They come as customers are widely expected to hold off from purchases over the next several months due to the recent expiration of a $7,500 federal tax credit for electric vehicles. Tesla stock fell 4.5% to $443.09 on Tuesday after closing the day before up more than 5% on anticipation of the new model announcement. Compared to previous models, the new Model Y comes with a shorter 321-mile driving range, fewer audio speakers and a fabric interior, not microsuede. The model also lacks a panoramic glass roof and a touchscreen in the second row. This model faces stiff competition in the $40,000 range for EVs from vehicles including Ford’s Mustang Mach-E, Chevrolet’s Equinox EV and Hyundai’s Ioniq 5. The new Model 3 has also cut down on the driving range, ambient lighting and other features. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "How major US stock indexes fared Tuesday, 10/7/2025",
      "content": "How major US stock indexes fared Tuesday, 10/7/2025 The Associated Press October 7, 2025 1 min read In this article: ^SPX ^DJI ^IXIC TSLA ORCL Wall Street’s record-breaking rally is running out of momentum. The S&P 500 dipped 0.4% Tuesday from its latest all-time high and broke a seven-day winning streak. The Dow Jones Industrial Average fell 0.2%, and the Nasdaq composite lost 0.7%. Drops for Tesla and Oracle helped weigh on the market. They offset gains for several stocks benefiting from the continued boom in artificial-intelligence technology. Gold climbed and topped $4,000 per ounce to continue its stellar year amid worries about politics and the potential for high inflation in the future. On Tuesday: The S&P 500 fell 25.69 points, or 0.4%, to 6,714.59. The Dow Jones Industrial Average fell 91.99 points, or 0.2%, to 46,602.98. The Nasdaq composite fell 153.30 points, or 0.7%, to 22,788.36. The Russell 2000 index of smaller companies fell 27.93 points, or 1.1%, to 2,458.42. For the week: The S&P 500 is down 1.20 points, or less than 0.1%. The Dow is down 155.30 points, or 0.3%. The Nasdaq is up 7.86 points, or less than 0.1%. The Russell 2000 is down 17.75 points, or 0.7%. For the year: The S&P 500 is up 832.96 points, or 14.2%. The Dow is up 4,058.76 points, or 9.5%. The Nasdaq is up 3,477.57 points, or 18%. The Russell 2000 is up 228.27 points, or 10.2%. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Review and Preview: Gold Outshines Stocks",
      "content": "Review and Preview: Gold Outshines Stocks Review and Preview: Gold Outshines Stocks · Barrons.com Sabrina Escobar October 7, 2025 3 min read In this article: GC=F Gold prices topped $4,000 for the first time ever, while the S&P 500 snapped a 7-day winning streak. Plus, Tesla is rolling out cheaper cars. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Does Tesla's Surprise Delivery Surge Mean Its Sales Slump Is Over?",
      "content": "Does Tesla's Surprise Delivery Surge Mean Its Sales Slump Is Over? By John Bromels – Oct 7, 2025 at 8:20PM Key Points Electric vehicle sales in the U.S. were juiced last month, as it was people's last chance to benefit from the federal EV tax credit. Tesla's sales in Europe have collapsed. None of this may have much effect on the surprisingly resilient stock price. NASDAQ : TSLA Tesla Market Cap $1.4T Today's Change angle-down ( -3.40 %) $ 15.26 Current Price $ 433.72 Price as of October 24, 2025 at 4:00 PM ET The electric vehicle maker's sales unexpectedly jumped in September. Is this a turning point? Back in April, the unthinkable happened. Tesla ( TSLA 3.40% ) -- the world's largest car company by market cap, the biggest global manufacturer of electric vehicles (EVs) , and the maker of the best-selling automobile on Earth in 2023 and 2024 -- posted a year-over-year quarterly delivery decline. Then in July, it happened again. So investors were bracing for another quarter of shrinking sales when Tesla released its Q3 delivery numbers this month, but instead, the automaker blew expectations out of the water, reporting record-high deliveries of 497,099 vehicles, up 7.4% over the prior year. So, do these record sales numbers mark a turning point for Tesla and its controversial CEO, Elon Musk ? Let's not read too much into this. Here's what's really going on. Beating the clock Although Tesla is a global brand , the U.S. is its largest market, responsible for about 40% of its sales in 2024. And there was a huge incentive to buy a Tesla in the U.S. in the third quarter: The \"Big Beautiful Bill\" eliminated the $7,500 electric vehicle tax credit as of October. That likely pulled a lot of purchases forward from the fourth quarter into the third quarter. After all, if you know you want to buy a Tesla this year, why would you give up a huge discount by waiting until October, November, or December? This explanation for the surge in Tesla's Q3 deliveries tracks with data from other U.S. automakers. General Motors ( GM +4.20% ) , Ford ( F +12.16% ) , and Stellantis ( STLA +1.25% ) all reported higher sales in the third quarter, largely driven by huge increases in electric vehicle sales. Ford, for example, reported an 8.2% increase in overall vehicle sales, but a much sharper increase of 19.8% in electric vehicle sales (including hybrids), led by a 39.7% increase in F-150 Lightning sales and a jaw-dropping 50.7% increase in Mustang Mach-E sales. At GM, the results were even stronger, with total Q3 vehicle sales up 8% year-over-year, but EV sales surging by 107%. The record-breaking EV sales numbers from Tesla's rivals put its comparatively puny 7.4% sales increase in perspective. Sales in Europe look shaky Tesla's U.S. sales probably surged more than 7.4% in Q3, but were offset by sales declines in its other major markets like China (which accounted for about 30% of 2024 sales) and Europe (about 20% of 2024 sales). While Tesla doesn't release a breakdown of its sales by country, several European markets keep track of new Tesla registrations, which are considered a proxy for its new vehicle sales. And, boy, do those numbers look bleak. Even though September sales were up 20.5% year over year in Denmark, for example, and 14.7% in Norway, those countries combined represented only about 2% of all Tesla sales worldwide in 2024. Elsewhere, even the bright spots weren't so bright: In September, Tesla sales rose 3.4% in Spain (also 0.9% of 2024 sales), 2.7% in France (2% of 2024 sales), and were flat in the U.K. (which at 3% of 2024 sales is Tesla's biggest European market). Perhaps Sweden gives us the clearest picture of Tesla's European market woes, though. It only sold 210 vehicles in Sweden in August. In response, the company rolled out new sales incentives for September, including zero-interest financing and a trade-in bonus of about $4,200 per vehicle. Swedish September sales then \"surged\" by 721% month over month to about 1,700 vehicles, but that was still a year-over-year drop of 65% (!) compared with the 4,792 vehicles it sold in September 2024. Brace yourself for... not much These numbers show that Tesla's business hasn't turned a corner. If anything, it's primed for a steeper-than-ever sales decline in the fourth quarter. The federal $7,500 tax credit is no longer supporting U.S. sales, European sales are collapsing despite huge sales incentives, and the company will face a tough comparison to Q4 2024, which represented a then-record for Tesla deliveries. Even so, the slumping sales seem unlikely to have a major effect on Tesla's stock price . The shares have declined by only single-digit percentages since the Q3 numbers came out, and the stock is still up by more than 6% year-to-date: Expand NASDAQ : TSLA Tesla Today's Change ( -3.40 %) $ -15.26 Current Price $ 433.72 Key Data Points Market Cap $1442B Day's Range $ 430.17 - $ 451.68 52wk Range $ 214.25 - $ 488.54 Volume 95M Avg Vol 88M Gross Margin 17.01 % Dividend Yield N/A If recent sales declines and a bleak outlook for future sales haven't dealt major damage to Tesla's lofty share price , it's unlikely that further sales declines will have any major impact on its valuation, which is now more tied to the company's vision for autonomous Robotaxis and humanoid robots than to its electric vehicle sales. About the Author John Bromels has been a contributing Motley Fool stock market analyst since 2012 covering information technology, communication services, industrials, energy, materials, utilities, and healthcare sectors. He finds investing to be more interesting and profitable than collectible trading card games and is an award-winning puzzle designer. TMFTruth2Power John Bromels has positions in Ford Motor Company and Tesla. The Motley Fool has positions in and recommends Tesla. The Motley Fool recommends General Motors and Stellantis. The Motley Fool has a disclosure policy . Stocks Mentioned Tesla NASDAQ: TSLA $433.88 ( 0.03 %) $ 15.10 Ford Motor Company NYSE: F $13.84 ( +0.12 %) $ +1.50 General Motors NYSE: GM $69.66 ( +0.04 %) $ +2.81 Stellantis NYSE: STLA $10.89 ( +0.01 %) $ +0.14 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Tesla Returns to Double-Digit Revenue Growth. Time to Buy the Stock? 2 Reasons I'm Excited About Tesla Stock Following Last Week's Earnings Report Where Will Tesla Be in 1 Year? 1 Terrible Surprise From Tesla's Earnings Call Wednesday 3 Make-or-Break Items From Tesla to Note From Yesterday's Earnings Report"
    },
    {
      "title": "Narratives Can Fly, But Numbers Don't Lie: My Tesla Reckoning",
      "content": ""
    },
    {
      "title": "Analyst Says End of EV Tax Credits Positive for Tesla (TSLA) Amid ‘Catch-22’ Of Competitors",
      "content": "Analyst Says End of EV Tax Credits Positive for Tesla (TSLA) Amid ‘Catch-22’ Of Competitors Fahad Saleem October 8, 2025 4 min read In this article: TSLA GM F VOW.DE 7203.T We recently published Top 10 Trending Stocks as Famous Billionaire Predicts Massive AI Stock Rally Before Bubble Burst . Tesla Inc (NASDAQ:TSLA) is one of the trending stocks. Gene Munster, Deepwater Asset Management managing partner, said in a latest program on CNBC that the end of EV tax credits could bode well for Tesla Inc (NASDAQ:TSLA) because its competitors have been “under-investing” in the space, which is likely to give the Musk-led company an edge in the Full Self-Driving race. “Since the beginning of the year when this became clear, we saw GM, Ford, Volkswagen, and Toyota all make comments about cutting their EV factory output, the number of models, and in general think about a 20 to 30% cut just over the past few months. The reason why I mentioned that commentary from people who are buying Tesla Inc (NASDAQ:TSLA) now about FSD, because they get that three-month free trial, is that in fact if these traditional car companies have taken the bait and decided to pull back investment in EVs because of the removal of the tax credit, it puts them in an awkward position. What’s going to happen with autonomy is it’s not going to slowly improve. We’re going to have this breakthrough moment. And for traditional auto to monetize this, they have to have an electric fleet. You’re not going to have a gas-powered EV. That’s just not going to happen. So by them essentially underinvesting, they’re not going to get to scale. It’s a catch-22. And I think they’ve really read the tea leaves wrong in terms of how to invest around the removal of the tax credit,” Munster said. Analyst Says End of EV Tax Credits Positive for Tesla (TSLA) Amid ‘Catch-22’ Of Competitors Munster said that Tesla Inc (NASDAQ:TSLA) has been making EVs “profitably” while its competitors are losing money. “Then there’s this other part of the equation about where they are with FSD and how close we are. From that perspective, it’s really coming down to two companies. It’s coming down to Tesla and then I think what’s going on with Waymo. I do want to mention Tesla and what they’ve been doing in Austin has been slower on the robo taxi. I believe they’re seeing more interventions than they were hoping for, which has caused that slowdown. And I think it does speak to the fact that we’re just not there yet. But I think we will have a moment. It’s not going to be linear. I think it’s going to be a breakout moment when it comes to the ability of these models to drive safely.” Baron Focused Growth Fund stated the following regarding Tesla, Inc. (NASDAQ:TSLA) in its second quarter 2025 investor letter: “Tesla, Inc. (NASDAQ:TSLA) designs, manufactures, and sells electric vehicles (EVs), solar products, and energy storage solutions, while also developing advanced real-world AI technologies. Despite ongoing macroeconomic challenges and regulatory complexities, shares climbed after Tesla completed a limited commercial rollout of its highly anticipated robotaxi business in Austin—following more than a decade of development and billions of dollars in investment. This milestone signals a potentially transformative shift in the automotive industry and opens up a sizable new market beyond the company’s core operations. Investor sentiment also improved after Elon Musk stepped back from government-related engagements, boosting confidence in Tesla’s near-term execution. Tesla introduced a refreshed Model Y globally, featuring design and performance upgrades, and outlined plans to unveil new mass-market models starting next quarter. Meanwhile, the company is progressing toward scaling production of its humanoid robot, adding another dimension to its long-term growth story.” Story Continues While we acknowledge the potential of TSLA as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and have limited downside risk. If you are looking for an extremely cheap AI stock that is also a major beneficiary of Trump tariffs and onshoring, see our free report on the best short-term AI stock . READ NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now . Disclosure: None. This article is originally published at Insider Monkey . View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Top Midday Stories: Confluent Reportedly Explores Sale; TopBuild Buys Specialty Products and Insulation for $1 Billion",
      "content": "PREMIUM Top Midday Stories: Confluent Reportedly Explores Sale; TopBuild Buys Specialty Products and Insulation for $1 Billion MT Newswires October 8, 2025 2 min read In this article: CFLT BLD AAPL META All three major US stock indexes were up in late-morning trading on Wednesday as investors awaited t PREMIUM Upgrade to read this MT Newswires article and get so much more. A Silver or Gold subscription plan is required to access premium news articles. Upgrade Already have a subscription? Sign in Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla Stock Rose. Why Affordable ‘Standard’ Models Aren’t Exciting Wall Street.",
      "content": "Tesla Stock Rose. Why Affordable ‘Standard’ Models Aren’t Exciting Wall Street. Tesla Stock Rose. Why Affordable ‘Standard’ Models Aren’t Exciting Wall Street. · Barrons.com Al Root October 8, 2025 2 min read In this article: TSLA FEATURE Tesla stock rallied late on Wednesday after the company’s unveiling of two new “Standard” lower price models on Tuesday. Wall Street, curiously, doesn’t have much to say about the new vehicles, yet. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Trending tickers: Nvidia, TSMC, HSBC, Lloyds and Fast Retailing",
      "content": "Trending tickers: Nvidia, TSMC, HSBC, Lloyds and Fast Retailing The latest investor updates on stocks that are trending on Thursday Vicky McKeever · Business reporter 9 October 2025 5 min read In this article: NVDA 2330.TW 0011.HK LLOY.L 9983.T Nvidia ( NVDA ) Shares in chipmaker Nvidia ( NVDA ) rose 2.2% on Wednesday and were up another 1.2% in pre-market trading on Thursday, following the latest reports of its investment in AI. Bloomberg reported on Wednesday that Tesla ( TSLA ) CEO Elon Musk's startup xAI is seeking to raise its ongoing funding round to $20bn (£14.9bn), with Nvidia ( NVDA ) said to be investing as much as $2bn in the equity portion of the asset-backed transaction. Spokespeople for xAI and Nvidia had not responded to Yahoo Finance UK 's request for comment at the time of writing. Speaking to Yahoo Finance on Wednesday, DVx Ventures CEO and VistaShares co-founder Jon McNeill said: \"I think what it says is that Nvidia and Jensen [Huang] are deploying their balance sheet in very productive ways. Read more: Stocks mixed as Israel and Hamas agree to first phase of Gaza peace deal \"I think there's a lot of VCs that would love to have Jensen's returns right now I think he's up like five or 6X on CoreWeave ( CRWV ). He's up similar amounts in their investments into OpenAI.\" Nvidia ( NVDA ) recently announced that it would be investing up to $100bn in OpenAI, as part of a strategic investment with the ChatGPT developer. McNeill said Huang and Nvidia ( NVDA ) were \"building a kind of an envious portfolio that's generating the combination of great returns for their balance sheet, but also really seeding customers purchasing ahead of where their demand is.\" TSMC ( 2330.TW , TSM ) Another chipmaker in focus on Thursday was TSMC ( 2330.TW , TSM ), after the company reported stronger-than-expected sales in the third quarter. TSMC, the world's largest contract chipmaker, reported September revenue of 330.98 billion Taiwan dollars (£8.12bn). This took its total revenue for the third quarter to NT$989.92bn, according to Yahoo Finance UK's calculations. This was ahead of an LSEG Smart Estimate of NT$973.26bn, based on forecasts from 22 analysts, according to a Reuters report . Converted into US dollars (USD) the third quarter figure came in at $32.43bn, which would be around the middle of TSMC's guidance for the period of $31.8bn to $33bn, which it gives in USD. Steve Clayton, head of equity funds at Hargreaves Lansdown, said TSMC ( 2330.TW , TSM ) was \"benefitting hugely from the boom in AI demand\". \"TSMC ( 2330.TW , TSM ) is the most technologically advanced manufacturer of the chips that designers like Nvidia ( NVDA ) and AMD ( AMD ) are creating to power AI technology,\" he said. \"Robust demand from these clients and others saw TSMC report revenue growth of 30% in the latest quarter compared to the same period a year ago.\" Story Continues The results drove TSMC's ( 2330.TW , TSM ) Taipei-listed shares to a fresh high overnight, with the stock closing the session up 1.8%. HSBC ( HSBA.L ) On the London market, shares in HSBC ( HSBA.L ) slid 5.6% on Thursday morning, after announcing plans to take 100% control of Hang Seng Bank ( 0011.HK ) and take it private. HSBC ( HSBA.L ), which owns around 63% of Hang Seng ( 0011.HK ), said on Thursday that the proposal included an offer to pay 155 Hong Kong dollars for each scheme share. The bank said that its HK$106bn (£10.2bn) privatisation offer valued 100% of Hang Seng at HK$290bn on an equity value basis. Stocks: Create your watchlist and portfolio HSBC ( HSBA.L ) said that the proposal comes as it aims to grow its business in Hong Kong by strengthening the banking presence of HSBC Asia Pacific and Hang Seng ( 0011.HK ). Hargreaves Lansdown's Clayton said: \"Gaining control of Hang Seng ( 0011.HK ) comes at a premium, with HSBC ( HSBA.L ) offering to pay almost 30% above the previous market value of the listed minority shares in Hang Seng, prompting some investors to argue that the deal will be dilutive to the group’s returns.\" Lloyds Banking Group ( LLOY.L ) Another FTSE 100 ( ^FTSE ) banking giant in the red on Thursday was Lloyds Banking Group ( LLOY.L ), with shares falling 2.6% in early trading. This came after the bank warned that it may need to put extra money aside to cover costs relating to car financing compensation. Lloyds ( LLOY.L ) said on Thursday that it continued to \"consider the impact and implications of the recently published FCA consultation paper on motor finance. Read more: Bank of England warns of AI-driven stock market bubble \"Uncertainties remain outstanding on the interpretation and implementation of the proposals but based on our initial analysis and the characteristics of the proposed scheme, an additional provision is likely to be required which may be material,\" the bank said. On Tuesday, the Financial Conduct Authority (FCA) released fresh details about its compensation scheme for motorists affected by the car financing scandal. The regulator estimated that those who were owed money could expect to receive an average of £700 ($934) per agreement. The regulator is still consulting on the scheme, but it is due to open in early 2026. Fast Retailing ( 9983.T ) In Japan, shares of Uniqlo-owner Fast Retailing ( 9983.T ) climbed 3.4% on Thursday, after the company reported strong full-year results. Fast Retailing ( 9983.T ) reported full-year operating profit of 564.2 billion Japanese yen (£2.76bn), which was up 12.6% year-on-year. The company said these results marked the fourth consecutive record annual performance and that its new stores had been \"hugely successful\". Read more: The most popular stocks and funds investors bought in September How Instagram affects our spending UK economic growth slowed between April and June, ONS confirms Download the Yahoo Finance app, available for Apple and Android . Terms and Privacy Policy Your privacy choices"
    },
    {
      "title": "Intel pushes further into humanoid robotics with new chip, software",
      "content": "Intel pushes further into humanoid robotics with new chip, software Daniel Howley · Technology Editor October 9, 2025 2 min read In this article: INTC TSLA NVDA MSFT META Intel ( INTC ) is diving deeper into robotics with new chips and software, the company revealed on Thursday. The move comes via Intel's new Intel Robotics AI Suite software package, which includes things like advanced algorithms and vision-language models, as well as its Panther Lake chip. Combined, the company said, they'll help developers build robotics, such as individual robotic arms for future humanoid robots. \"Effectively, this is a Panther Lake that has almost 200 TOPS [trillions of operations per second] worth of performance and can run one of these humanoid robots on a board that's the size of your passport,\" Mike Masci, vice president of product management with Intel's Edge Computing Group, told Yahoo Finance, adding that this highlights the latest chips' power and energy efficiency. Intel's CEO Lip-Bu Tan speaks at the company's Annual Manufacturing Technology Conference in San Jose, Calif., on April 29. (Reuters/Laure Andrillon) · REUTERS / Reuters \"We're proving to the industry, effectively, the myth of x86 not being able to be low power and not being able to fit into these unique form factors; we're just basically challenging every one of those paradigms,\" he added. The tech industry is in the midst of an enormous race to create practical humanoid robots, with companies including Tesla ( TSLA ), Agility Robotics, Apptronik, and Boston Dynamics competing to be the first to bring the machines to market. And like Intel, Big Tech companies are keen on getting in on the action, with the likes of Nvidia ( NVDA ), Microsoft ( MSFT ), and Meta ( META ) developing and powering the AI that brings robots to life. We're still quite a way away from humanoid robots folding our clothes or taking the dog for a walk, but in the meantime, Intel said there are plenty of real-world applications for robotics software and chips that are being used today. \"Just one example is order accuracy in retail stores,\" explained Matthew Formica, senior director and head of edge product marketing at Intel. \"In fast food, you order online from Uber Eats ... When that order is fulfilled, it's humans putting the food into the bag, but increasingly they're trying to remove errors. There are solutions now to put a camera that points at what the person's doing that [compares] the order with what they're actually putting in the bag, and using the same [vision-language model]-style technology to have a deep understanding of what those items are.\" If someone forgets to add a soda to an order or puts in the wrong kind of burger, Formica explained, the system can then flag it and ensure they drop in the right product. \"So while humanoids are sort of the tip of the spear ... there's a lot of real markets today where the application of that technology is much more real,\" he added. Story Continues Sign up for Yahoo Finance's Week in Tech newsletter. · yahoofinance Email Daniel Howley at dhowley@yahoofinance.com. Follow him on X/Twitter at @DanielHowley . Click here for the latest technology news that will impact the stock market Read the latest financial and business news from Yahoo Finance View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Elon Musk May Still Reap Billions From Tesla's Trillion-Dollar Pay Package Even Without Meeting Goals: Report",
      "content": "Elon Musk May Still Reap Billions From Tesla's Trillion-Dollar Pay Package Even Without Meeting Goals: Report Badar Shaikh October 9, 2025 2 min read In this article: TSLA Tesla Inc. (NASDAQ: TSLA ) CEO Elon Musk could collect billions of dollars even if the billionaire fails to miss milestones laid out in the new pay package recently unveiled by the electric vehicle maker’s Board of Directors. What Happened: Musk could collect over $50 billion by hitting some of the easier goals laid out in the package, with Musk netting over $26 billion for hitting two of the board's targets and helping the company’s stock grow consistently, Reuters reported on Thursday. Tesla did not immediately respond to Benzinga 's request for comment. Don’t Miss: These five entrepreneurs are worth $223 billion – they all believe in one platform that offers a 7-9% target yield with monthly dividends An EA Co-Founder Shapes This VC Backed Marketplace— Now You Can Invest in Gaming's Next Big Platform The milestones include delivering over 1 million Tesla vehicles and 1 million Optimus robots, as well as reaching 10 million active FSD subscriptions and 1 million Robotaxis in operation. Reaching all four of these milestones with a valuation of $3.5 trillion would get Musk almost $93 billion, the report said. Tesla's Board has urged investors to vote in favor of all the recommendations it laid down ahead of November's shareholder meeting. Why It Matters: Tesla recently revised the meaning of the FSD technology as well as moved the on board safety operators in Tesla Robotaxis in Austin to the driver's seat as it expanded operations to highways. The company also debuted the Optimus robot at a red carpet event earlier this week. Musk, in a post on the social media platform X , had said that the vote, ahead of the investor's meeting in November, was not about compensation, but about retaining control over the EV giant. Tesla also recently revealed affordable trim levels of the Model Y and the Model 3. However, the company has received mixed reactions from experts, with Wedbush Securities ' analyst Dan Ives , a Tesla bull, expressing disappointment at the price point of the new models. Read Next: Kevin O'Leary Loves ‘Wonderful Recurring Cash Flows' — These Small Industrial Assets Deliver Just That Are you rich? Here’s what Americans think you need to be considered wealthy. Photo courtesy: Shutterstock UNLOCKED: 5 NEW TRADES EVERY WEEK. Click now to get top trade ideas daily , plus unlimited access to cutting-edge tools and strategies to gain an edge in the markets. Get the latest stock analysis from Benzinga? This article Elon Musk May Still Reap Billions From Tesla's Trillion-Dollar Pay Package Even Without Meeting Goals: Report originally appeared on Benzinga.com © 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla China Sales Turn Higher, Aided By New Model Y Variant",
      "content": "Tesla China Sales Turn Higher, Aided By New Model Y Variant Tesla China Sales Turn Higher, Aided By New Model Y Variant · Investor's Business Daily ED CARSON October 10, 2025 1 min read In this article: TSLA Tesla China sales rose in September vs. a year earlier, aided by the Model Y L variant. Sales should be strong in Q4. Continue Reading View comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Oversized Position In Tesla Stock Delivered Great Profits In Short Time",
      "content": "Oversized Position In Tesla Stock Delivered Great Profits In Short Time Oversized Position In Tesla Stock Delivered Great Profits In Short Time · Investor's Business Daily JUSTIN NIELSEN October 10, 2025 3 min read In this article: TSLA Especially when a winner comes with a larger position size. Tesla stock gives an example of how the decision can play out. After skirting around its 200-day line for a few months, Tesla finally seemed to lift strongly (1). Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Trump Adds 100% China Tariff After Stock Market Dives; Oracle, Tesla, Taiwan Semi In Focus",
      "content": "Dow Jones Futures Rise As Trump Says 'Eternity' Before Extra 100% China Tariff Dow Jones Futures Rise As Trump Says 'Eternity' Before Extra 100% China Tariff · Investor's Business Daily ED CARSON October 12, 2025 6 min read In this article: ^DJI ORCL ^SPX TSLA 2330.TW The stock market dived with President Trump imposing huge China tariffs late Friday. He said Sunday that \"all will be fine.\" Oracle AI World looms. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "3 Brilliant but Overlooked Driverless Vehicle Stocks to Buy and Hold for 10 Years",
      "content": "3 Brilliant but Overlooked Driverless Vehicle Stocks to Buy and Hold for 10 Years By Daniel Miller – Oct 11, 2025 at 1:54PM Key Points Mobileye can be a play on robotaxis that avoids Tesla and its headwinds. Aptiv is bringing next-generation safety and autonomous vehicle technology. Hesai Group is a leader in lidar solutions and has secured a number of design wins. NASDAQ : MBLY Mobileye Global Market Cap $11B Today's Change angle-down ( -4.61 %) $ 0.65 Current Price $ 13.44 Price as of October 24, 2025 at 4:00 PM ET If you're looking for hidden gems that could return significant value as driverless vehicles take over roads, start here. Like it or not, and whether we trust driverless vehicles yet or not, they're on the way, and the future is coming faster than many investors realize. The driverless vehicle market has enormous growth potential and is projected to be worth trillions of dollars in a decade's time. Don't take it from me: Goldman Sachs Research predicts that robotaxis' ride-share market alone is on the path for a 90% compound annual growth rate between 2025 and 2030, and that's merely scratching the surface. If you're looking to dip your toes into what could be a generational investing opportunity, here are three stocks to keep an eye on. One way to play robotaxis Mobileye Global ( MBLY 4.61% ) is in the business of developing and deploying Advanced Driver Assistance Systems (ADAS) and autonomous driving technologies and solutions. With a comprehensive collection of software and hardware technologies, Mobileye can offer end-to-end products and services for automakers. Investors should look at Mobileye as a solid robotaxi investment for those who don't want to deal with the drama currently surrounding Tesla . Expand NASDAQ : MBLY Mobileye Global Today's Change ( -4.61 %) $ -0.65 Current Price $ 13.44 Key Data Points Market Cap $11B Day's Range $ 13.13 - $ 14.37 52wk Range $ 11.58 - $ 22.51 Volume 11M Avg Vol 5.6M Gross Margin 46.90 % Dividend Yield N/A With the automotive industry heading toward driverless vehicles, Mobileye's technology and systems will bolster automotive safety, productivity, and vehicle utilization through solutions such as Supervision, Chauffeur, Drive, and EyeQ. Meanwhile, management has been working hard to secure new ADAS deals with large customers, while finding new opportunities with untapped clients. One driving force for the company is a growing adoption of multicamera setups due to the need for increased safety and a push toward hands-free highway driving. Adding to Mobileye's growth is its strategic partnerships , including ZEEKR , using Mobileye as its launch partner for its ADAS, and its design wins with automakers such as Porsche and Mahindra , among other major OEMs. Just this spring, Volkswagen announced a collaboration with Mobileye to improve safety and driving comfort for some of its upcoming vehicle pipeline. The company remains unprofitable, with full-year guidance expecting an operating loss between $436 million to $512 million. That said, Mobileye boasts roughly $1.7 billion in cash and cash equivalents, rising free cash flow, very little debt, and should be able to navigate choppy waters as the industry slowly figures out the path to full autonomous vehicles. The business of connectivity Aptiv PLC ( APTV +1.44% ) is a technology company working to bring the next generation of active safety, autonomous vehicles, smart cities, and connectivity through its decades of experience pioneering advances in the automotive industry. While the stock has faltered from its all-time highs as electric vehicle hype died down with slower-than-anticipated adoption in the U.S. market, it's still performing well, with earnings expected to check in at $7.48 per share in 2025, up significantly from $2.61 in 2021 -- a compound annual growth rate of 30%. But its growth prospects might improve even more, with the company's business split on the horizon for the first quarter of 2026. Aptiv plans to split into two companies: one that will focus on slower-growth electrical distribution systems (EDS), and the second on faster-growth safety and software -- the latter aimed at a more driverless vehicle focus. It's easy to understand the rationale behind the business breakup when you consider the EDS business generated 2024 sales of $8.3 billion at earnings before interest, taxes, depreciation, and amortization ( EBITDA ) profit margins of 9.5%, while the safety and software generated 2024 sales of $12.2 billion with EBITDA margins nearly double at 18.8%. The new Aptiv with a focus on safety and software that enable higher levels of autonomous functions won't be limited to vehicles either, with potential applications for planes and other machines. Aptiv has already begun branching out its overall business with its communications software acquisition of Wind River in 2022. All things autonomous Hesai Group ( HSAI +0.71% ) is a global leader in lidar solutions, with its products enabling a wide range of applications including passenger and commercial vehicles ADAS, autonomous vehicles, robotics, and nonautomotive applications such as last-mile delivery robots. Throughout the company's second quarter, Hesai secured a notable number of new design wins through 2026, with 20 models from nine leading OEMs, highlighted by a platform win for multiple 2026 models with one of its top two ADAS customers. The design wins help cement lidar as a standard feature across the specific customer's model lineups and will drive the company's order book higher in the near term. Expand NASDAQ : HSAI Hesai Group Today's Change ( 0.71 %) $ 0.16 Current Price $ 22.80 Key Data Points Market Cap $3B Day's Range $ 22.66 - $ 23.26 52wk Range $ 4.02 - $ 30.85 Volume 1.4M Avg Vol 3.1M Gross Margin 42.49 % Dividend Yield N/A Outside its automotive wins, the company's robotics business is also doing well, ranking No. 1 in lidar shipments in China for the first half of 2025, per Gaogong Industry Research Institute. Its robotics business is well positioned for the wave of physical artificial intelligence (AI), with lidars becoming essential for AI to perceive and sort the dynamic world we operate in, especially in driverless vehicles. \"In the first six months of 2025, total shipments have already surpassed those of full-year 2024. According to Gasgoo, we ranked first in installation volume among long-range lidar suppliers during this period,\" said Hesai cofounder and CEO Yifan \"David\" Li in a press release. Are the stocks buys? The number of robotaxis and driverless vehicles on the roads is set to increase in the coming years, especially as leading autonomous vehicle operators reduce costs and begin scaling the business. Right now, roughly 1,500 such vehicles operate across a handful of U.S. cities, but that figure is expected to soar to about 35,000 across the country in 2030. Even then, driverless vehicles will represent a fraction of the rideshare market, leaving plenty of long-term growth for investors who believe these companies have injected their technologies and solutions into the industry. Mobileye, Aptiv, and Hesai are all proven companies with products poised to push the boundaries of driverless vehicles, robotaxis, and ADAS going forward, and savvy investors would be wise to keep them on a watch list. About the Author Daniel Miller is a contributing Motley Fool stock market analyst covering industrials and consumer goods, with a focus on automotive companies. He previously worked as a product manager in the automotive aftermarket industry. Miller holds a bachelor’s degree in business management from Emporia State University. TMFTwoCoins Daniel Miller has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Goldman Sachs Group and Tesla. The Motley Fool recommends Aptiv, Mobileye Global, Porsche Automobil Se, and Volkswagen Ag. The Motley Fool has a disclosure policy . Stocks Mentioned Mobileye Global NASDAQ: MBLY "
    },
    {
      "title": "Should You Buy Tesla Stock Before Oct. 22?",
      "content": "Should You Buy Tesla Stock Before Oct. 22? By Robert Izquierdo – Oct 12, 2025 at 8:05AM Key Points Tesla faced difficulties this year as automotive deliveries dropped 13% year over year in the second quarter. The company rebounded in Q3 with a new high in vehicle deliveries. Tesla releases its full Q3 earnings report on Oct. 22. NASDAQ : TSLA Tesla Market Cap $1.4T Today's Change angle-down ( -3.40 %) $ 15.26 Current Price $ 433.72 Price as of October 24, 2025 at 4:00 PM ET The automaker's Q3 vehicle deliveries surpassed Wall Street expectations. It's been a rough 2025 for Tesla ( TSLA 3.40% ) . Unfavorable macroeconomic conditions, such as the Trump Administration's tariffs , the divisive actions of CEO Elon Musk, and critically, falling quarterly sales, hit the automaker, hurting business performance. But Tesla appears to be bouncing back. On Oct. 2, the company reported a record-breaking number of vehicle deliveries in the third quarter. Given this exciting news, Tesla stock may be worth picking up before the company's Q3 earnings report is released on Oct. 22. However, some key considerations suggest it's best to wait. Here's a deeper dive into whether now is the time to buy. Deciding on Tesla stock ahead of its Q3 earnings release Tesla's challenging 2025 led to Q2 sales of $22.5 billion, a 12% year-over-year drop from 2024. This was due primarily to a decline in vehicle sales, with Q2 total deliveries falling 13% year over year to about 384,000. After that disappointing outcome, Q3 deliveries came in at over 497,000. The record-setting performance handily beat Wall Street expectations. Expand NASDAQ : TSLA Tesla Today's Change ( -3.40 %) $ -15.26 Current Price $ 433.72 Key Data Points Market Cap $1442B Day's Range $ 430.17 - $ 451.68 52wk Range $ 214.25 - $ 488.54 Volume 95M Avg Vol 88M Gross Margin 17.01 % Dividend Yield N/A But the car sales boost could simply be due to consumers taking advantage of a beefy $7,500 federal tax credit before it disappears at the end of 2025. If so, demand could plummet in 2026. Another factor to consider is Tesla's share price valuation. Here's a look at the stock's price-to-earnings (P/E) ratio. Data by YCharts . The chart shows Tesla's P/E multiple in October is higher than it's been all year. This suggests the electric vehicle (EV) manufacturer's stock is quite pricey right now. That said, shares could surge in Q4 as consumers rush to take advantage of expiring tax credits. Beyond that, the EV environment appears fuzzy with no clear visibility on the overall industry's growth prospects. The combination of an elevated valuation and a potential sales plunge next year makes now a risky time to buy Tesla stock. About the Author Robert \"Izzy\" Izquierdo is a contributing Motley Fool stock market analyst covering information technology, consumer discretionary, consumer staples, and communication services sectors. Prior to The Motley Fool, Izzy was head of product management at Target Media Partners, developing and launching multimillion-dollar software used by businesses such as Charter Communications. Prior to that, he worked at Yahoo! and startups on software products in connected TV, AI, consumer apps, and digital advertising. He holds a bachelor’s degree in English literature from UCLA and is certified in software product management. TMFWryWrite Robert Izquierdo has positions in Tesla. The Motley Fool has positions in and recommends Tesla. The Motley Fool has a disclosure policy . Stocks Mentioned Tesla NASDAQ: TSLA $433.72 ( 0.03 %) $ 15.26 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Tesla Returns to Double-Digit Revenue Growth. Time to Buy the Stock? 2 Reasons I'm Excited About Tesla Stock Following Last Week's Earnings Report Where Will Tesla Be in 1 Year? 1 Terrible Surprise From Tesla's Earnings Call Wednesday 3 Make-or-Break Items From Tesla to Note From Yesterday's Earnings Report"
    },
    {
      "title": "Meet the Supercharged Growth Stock That's One of This Year's Big Winners. The Company Could Hit $50 Trillion by 2034, According to 1 World-Renowned Analyst",
      "content": "Meet the Supercharged Growth Stock That's One of This Year's Big Winners. The Company Could Hit $50 Trillion by 2034, According to 1 World-Renowned Analyst By Danny Vena – Oct 12, 2025 at 7:02PM Key Points Nvidia has delivered blistering gains since the advent of AI, but that could be just the beginning. One distinguished investor believes that the AI chipmaker could climb much higher over the next 10 years. While a $50-trillion market cap might seem like a pipe dream, investors shouldn't miss the forest for the trees. NASDAQ : NVDA Nvidia Market Cap $4.5T Today's Change angle-down ( 2.26 %) $ 4.13 Current Price $ 186.28 Price as of October 24, 2025 at 3:59 PM ET A track record of innovation, strong tailwinds, and an industry-leading position could drive this household name to new highs. The name James Anderson might not ring any bells with U.S. investors, but his track record and investing acumen are well documented. The legendary investor was a rock star at Scottish investment management firm Baillie Gifford for more than 40 years. He was in charge of the premier Scottish Mortgage Investment Trust for over two decades, generating returns of more than 1,700% during his term. Anderson secured his legacy early on, recognizing the dramatic growth potential of then early stage companies, including Netflix , Amazon , Tesla , and Nvidia ( NVDA +2.26% ) , delivering considerable profits for investors along the way. Given his track record, when Anderson talks, investors should listen. Most experts agree that the adoption of artificial intelligence (AI) is still in its early stages, and if the trend continues, Nvidia's market cap could surge to as much as $50 trillion by 2035, according to Anderson. While that might seem improbable on its face, Anderson's reasoning is worth a look. Image source: Nvidia. Dominating the space The dawn of generative AI in early 2023 created a windfall for Nvidia. The company pioneered the graphics processing units (GPUs) that quickly became the gold standard for AI. Nvidia rode the unprecedented demand for its chips to become the world's largest publicly traded company , valued at $4.58 trillion (as of this writing). After two successive years of triple-digit year-over-year sales growth, Nvidia's results have begun to moderate but are still enviable by any standard. In its fiscal 2026 second quarter (ended July 27), Nvidia generated revenue that grew 56% year over year to a record $46.7 billion, while diluted earnings per share (EPS) of $1.08 jumped 61%. Yet this could be just the beginning. The AI market is projected to be worth as much as $15.7 trillion by 2030, according to data compiled by \"Big Four\" accounting firm PricewaterhouseCoopers (PwC). The report suggests \"AI is still at a very early stage.\" If Nvidia earns just a small slice of that total opportunity, sales and profits could continue to surge, resulting in a windfall for the chipmaker and its shareholders. Anderson estimates the data center market, where most AI processing is conducted, is poised to grow 60% annually. If Nvidia's profit margin holds steady and the adoption of AI continues at its current pace over the next 10 years, Anderson estimates that Nvidia would deliver EPS of $1,350 and free cash flow of $1,000 per share. That would drive the stock price to about $20,000, pushing its market cap to roughly $49 trillion. Despite increasing competition, Nvidia currently dominates the data center GPU space, commanding 92% of the market, according to IoT Analytics. Anderson points out that the company's \"persistent exponential progress, the competitive advantages in hardware and software , and the culture and leadership are exactly what we look for.\" Expand NASDAQ : NVDA Nvidia Today's Change ( 2.26 %) $ 4.13 Current Price $ 186.28 Key Data Points Market Cap $4526B Day's Range $ 183.51 - $ 187.47 52wk Range $ 86.62 - $ 195.62 Volume 5.1M Avg Vol 173M Gross Margin 69.85 % Dividend Yield 0.00 % The fine print Make no mistake, plenty of things will have to go right for Nvidia to reach this astonishing benchmark, and there will be a lot of obstacles along the way. Demand for AI could falter, a rival chipmaker could \"invent a better mousetrap,\" so to speak, or the economy could go south -- and these are just a few examples of the challenges that could arise. Even Anderson admits that this \"isn't a prediction but a possibility if artificial intelligence works for customers and Nvidia's lead is intact.\" When asked about the potential for the stock to reach these meteoric heights, Anderson puts the odds at between 10% and 15%. However, investors shouldn't miss the forest for the trees. \"It is the long duration of the development of [GPU] usage in AI -- and not just AI -- from excitement, through potential pauses, to transformation of industries that is most important to us,\" Anderson said. There's also the matter of Nvidia's valuation. The stock has a price-to-earnings (P/E) ratio of roughly 54, compared to a multiple of 31 for the S&P 500 . However, at less than 30 times next year's expected earnings, I'd submit it's an attractive price to pay, particularly given the magnitude of the opportunity. Even if Nvidia doesn't hit a $50 trillion market cap over the next 10 years, all the available evidence suggests Anderson's thesis is directionally accurate. Furthermore, CEO Jensen Huang has proven particularly adept at identifying opportunities before they materialize and positioning Nvidia for future success. Given his track record, I wouldn't bet against him. That's why I believe Nvidia stock is still a buy. About the Author Danny Vena, CPA, is a contributing Motley Fool technology analyst specializing in artificial intelligence, cloud computing, semiconductors, software, cybersecurity, and consumer electronics. He is a Certified Public Accountant and previously worked as a controller and accountant across small and midsize businesses. Danny also served 13 years in the U.S. Army. He holds a bachelor’s degree in accounting from the University of Phoenix. TMFLifeIsGood X @ dannyvena Danny Vena has positions in Amazon, Netflix, Nvidia, and Tesla. The Motley Fool has positions in and recommends Amazon, Netflix, Nvidia, and Tesla. The Motley Fool has a disclosure policy . Stocks Mentioned Nvidia NASDAQ: NVDA $186.26 ( +0.02 %) $ +4.10 Netflix NASDAQ: NFLX $1094.69 ( 0.02 %) $ 18.90 Tesla NASDAQ: TSLA $433.88 ( 0.03 %) $ 15.10 Amazon NASDAQ: AMZN $224.21 ( +0.01 %) $ +3.12 S&P 500 Index SNPINDEX: ^GSPC $6791.69 ( +0.01 %) $ +53.25 *Average returns of all recommendations since inception. Cost basis and return based on previous market day close. Related Articles Prediction: Nvidia Stock Is Going to Soar After Nov. 20 Is the AI Boom Turning Into a Bubble? Here's What Smart Investors Should Watch. Prediction: This Will Be Nvidia's Stock Price in 2026 Is the Artificial Intelligence (AI) Boom Turning Into a Bubble or Just Getting Started? 3 Top Artificial Intelligence (AI) Stocks Ready for a Bull Run"
    },
    {
      "title": "Oracle Event Is Chance to Show $370 Billion Stock Rally Has Legs",
      "content": "Oracle Event Is Chance to Show $400 Billion Stock Rally Has Legs Ryan Vlastelica October 13, 2025 5 min read In this article: ORCL ^SPX OPAI.PVT (Bloomberg) -- Oracle Corp. will get a chance this week to reassure investors that a rally, which has added roughly $400 billion in market value this year, is on a stable footing. The software maker is hosting a four-day AI World conference starting Monday in Las Vegas, where much of the focus will be on Oracle’s cloud computing business, whose rapid expansion has fueled a 81% run-up in the stock that has made it one of 2025’s best performers in the S&P 500. Most Read from Bloomberg Newsom Stares Down LA Revolt in New California Housing Fight HUD Issues Layoff Notices, Targeting Fair Housing Staff With Deep Cuts Billionaire Caruso Says He No Longer Builds in LA Due to Prices Mapping a Way Out of the US Housing Affordability Crisis The Secret to Vancouver’s Public Transit Ridership Recovery The event comes just as concerns are building that Oracle is sacrificing profitability for growth from renting computing power to AI companies like OpenAI. Last week, the Information reported Oracle’s cloud margins are lower than many on Wall Street are modeling, sending Oracle shares down as much as 7.1% on Tuesday. Even though the stock quickly recovered the losses, there are lingering questions about the economics of the business, which Oracle has forecast will see revenue jump 700% in the coming three fiscal years. “There are absolutely investors who are concerned about margins, or concerned its targets are very aggressive,” said Mark Martiak, senior partner and financial adviser at Prudential Advisors, whose parent company has about $1.5 trillion in assets under management. “This is an opportunity for Oracle to ease concerns, since a lot of skeptics see the valuation as stretched, especially if a mega-deal like the one it has with OpenAI doesn’t deliver sustained revenue.” Tuesday will feature a keynote address from recently named co-CEO Mike Sicilia, as well as one from founder and chief technology officer Larry Ellison, whose stake in Oracle briefly made him the world’s richest person last month. On Thursday, an investor day is expected to bring updated financial targets. Hopes are high among many on Wall Street. The conference will be “a major catalyst where the company will clarify many of these debates,” Mizuho Securities analyst Siti Panigrahi wrote in a note last week, referring to questions over margins. Bernstein’s Mark Moerdler expects “additional details which should help put some of these issues to bed.” Heavy demand for cloud computing has boosted Oracle’s overall sales, but the big investments required to support it have weighed on profitability. Oracle’s revenue growth is projected to jump to 17% in its current fiscal year, from 8% the year before, according to the average of analyst estimates compiled by Bloomberg. However, gross margin, which excludes operating expenses, is expected to fall more than 2 percentage points to 68.4%. As recently as fiscal 2021, Oracle’s gross margin was above 80%. Story Continues Oracle’s rapid growth has firmly established the company as a key AI winner. It inked a cloud-computing deal with OpenAI in September said to be worth $300 billion over five years. A blowout earnings report sent the stock up 36% on Sept. 10. But its soaring stock price has also made it the subject of bubble talk with its valuation recently hitting levels not seen since the dot-com era more than two decades ago. At nearly 42 times profit projected over the coming 12 months, Oracle’s multiple is more than twice its 10-year average and well above that of the Magnificent Seven stocks with the exception of Tesla Inc., according to data compiled by Bloomberg. Beyond margins, there are concerns about the spending required to expand Oracle’s cloud computing capacity. The company’s capital expenditures are expected to hit $35.4 billion in fiscal 2026, which ends in May, up 67% from the prior year. As a result, free cash flow is expected to be negative $9.8 billion this year after falling into the red last year for the first time since 1990. Of course, AI bulls have plenty of reasons to be optimistic that the AI narrative will remain intact: Microsoft Corp.’s cloud business is struggling to meet strong demand, Dell Technologies Inc. boosted its revenue and profit growth forecasts for the next four years on AI expectations, and Taiwan Semiconductor Manufacturing Co.’s September sales were robust. Still, the interconnectedness of the major AI players could mean any hint of weakness or excessive sentiment at one could weigh on the broader group, according to Gene Munster, co-founder and managing partner at Deepwater Asset Management. “If one starts to falter, they all will, and the whole trade could break down,” said Munster, who spent more than two decades as an analyst covering companies like Apple Inc. “Oracle has only recently become part of the AI conversation, but until we get to earnings season, this event is what we have to consider whether we’re still at the beginning of the AI trade, or at the beginning of the end.” Top Tech News Wingtech Technology Co. plunged by its daily limit of 10% after the Dutch government moved to exert control over its European unit Nexperia, an unusual move that risks inflaming tensions between China and Europe. Xiaomi Corp. shares fell the most since April after reports that one of its SU7 electric sedan’s doors failed to open after a crash in the southwest Chinese city of Chengdu, trapping at least one person inside. Most major cryptocurrencies rebounded from steep losses suffered over a brutal weekend selloff, as President Donald Trump sought to quell concerns over trade between the US and China. For more than a decade, Tencent Holdings Ltd. developer Leo Yao toiled in relative anonymity, churning out one shooting game after another. Then he scored one of the biggest Chinese hits of 2024 with , a game that continues to attract 30 million players daily. Earnings Due Monday No major earnings expected. --With assistance from David Watkins. (Updates to market open.) Most Read from Bloomberg Businessweek ‘I Believe It’s a Bubble’: What Some Smart People Are Saying About AI A Shipwreck Killed 41 Crew and 5,900 Cattle. The Brutal Business Behind It Goes On Did Wall Street Just Admit It’s a Casino After All? Trump’s TikTok Deal Puts the White House in the Driver’s Seat How Din Tai Fung Became America’s Top-Earning Restaurant Chain ©2025 Bloomberg L.P. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Is Tesla (TSLA) One of the Best Growth Stocks to Buy Now?",
      "content": "Is Tesla (TSLA) One of the Best Growth Stocks to Buy Now? Maham Fatima October 13, 2025 1 min read In this article: TSLA Tesla Inc. (NASDAQ: TSLA ) is one of the best growth stocks to buy now . On October 9, RBC Capital analyst Tom Narayan maintained a Buy rating on Tesla and set a price target of $500.00. This rating came ahead of the company’s Q3 2025 earnings report. As for Q2, Tesla reported making $22.50 billion in total sales. This represented an 11.78% decline year-over-year. However, the company’s automotive revenue saw a 19% sequential increase, with total vehicle deliveries improving by 14%. The company generated $146 million in free cash flow. Despite these gains, costs were impacted by tariffs, resulting in a sequential cost increase of $300 million for both the automotive and energy sectors, with further increases anticipated. Is Tesla (TSLA) One of the Best Growth Stocks to Buy Now? Additionally, the impending expiration of consumer credits for residential storage by the end of the year poses challenges to the energy business. The company anticipated potentially rough quarters ahead due to the loss of US incentives and the inherent risks of being in the early stages of autonomy development. Tesla Inc. (NASDAQ:TSLA) designs, develops, manufactures, leases, and sells electric vehicles and energy generation & storage systems in the US, China, and internationally. While we acknowledge the potential of TSLA as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you’re looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock . READ NEXT: 30 Stocks That Should Double in 3 Years and 11 Hidden AI Stocks to Buy Right Now . Disclosure: None. This article is originally published at Insider Monkey . View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "US Equity Indexes Rebound After Trump Dials Back China Threats; Gold Breaks More Records",
      "content": "PREMIUM US Equity Indexes Rebound After Trump Dials Back China Threats; Gold Breaks More Records MT Newswires October 13, 2025 2 min read In this article: AVGO GC=F OPAI.PVT ^IXIC ^SPX US equity indexes jumped in midday trading on Monday after President Donald Trump softened his tone PREMIUM Upgrade to read this MT Newswires article and get so much more. A Silver or Gold subscription plan is required to access premium news articles. Upgrade Already have a subscription? Sign in Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Donald Trump Once Said The US Could Pay Off Its $37 Trillion Debt Burden With Bitcoin—But Could It Really?",
      "content": "Donald Trump Once Said The US Could Pay Off Its $37 Trillion Debt Burden With Bitcoin—But Could It Really? Parshwa Turakhiya October 13, 2025 6 min read In this article: BTC-USD NVDA TSLA ^SPX IDLE-USD Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below. President Donald Trump's past remarks about Bitcoin's potential to \"save America\" deserve scrutiny: what it would actually take for the cryptocurrency to cover the $37 trillion U.S. national debt ? Bitcoin Would Need $1.8 Million To Match U.S. Debt Trump has previously suggested the nation’s debt burden could be paid off with Bitcoin. But according to calculations based on Treasury data and blockchain supply metrics, Bitcoin's circulating supply of roughly 19.93 million coins would need to reach a combined value of $37 trillion to offset the U.S. debt load. That implies an average price of nearly $1.86 million per BTC, based on the current supply figures compiled by MacroMicro and the Committee for a Responsible Federal Budget. Trending: Missed Nvidia and Tesla? RAD Intel Could Be the Next AI Powerhouse — Just $0.81 a Share At today's levels, Bitcoin trades near $112,000, giving it a market capitalization of about $2.23 trillion — a fraction of what would be needed. Even on paper, the market cap required to match U.S. debt is astronomical, and converting that value into actual dollars would be impossible without crashing the market. Liquidity And Market Depth Make It Unworkable Economists say even if Bitcoin were to reach such valuations, converting that amount of crypto into cash would be self-defeating. Large-scale liquidation would erode liquidity and trigger cascading selloffs long before the government could access the full value. Additionally, a large portion of Bitcoin's supply is considered illiquid — locked in long-term wallets, lost keys, or institutional reserves. Estimates suggest more than 20% of all mined Bitcoin is effectively unrecoverable, further reducing available liquidity. Beyond market dynamics, there are also legal and political constraints. The U.S. government cannot forcibly seize or monetize all privately held Bitcoin without massive backlash and constitutional challenges. See Also: Accredited Investors Can Now Tap Into the $36 Trillion Home Equity Market — Without Buying a Single Property Economic Fallout Would Overshadow The Goal Analysts note that even if Bitcoin's market value equaled $37 trillion, attempting to convert that theoretical wealth into dollars would destabilize global markets. Selling that volume into any trading venue would collapse prices, trigger derivatives losses, and potentially ignite systemic contagion across currencies and equities. The Peterson Foundation has warned that fiscal solutions depend on sustainable economic growth and policy reform — not speculative asset revaluations. Story Continues Long-term debt reduction relies on GDP expansion, spending discipline, and tax reform, rather than the monetization of digital assets. Realistic Path Lies In Fiscal Policy, Not Bitcoin Economists say the only viable methods for reducing U.S. debt involve a mix of deficit management, interest cost control, and structural reforms. While Bitcoin may serve as a speculative hedge or diversification tool for sovereign reserves, it cannot replace fiscal policy. The numbers make the point clear: Bitcoin would need to appreciate more than 1,300% from current prices and maintain global demand equivalent to the combined market capitalization of every U.S. company in the S&P 500 . Image: Shutterstock Trending Now: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ? Maximize saving for your retirement and cut down on taxes: Schedule your free call with a financial advisor to start your financial journey – no cost, no obligation . Building Wealth Across More Than Just the Market Building a resilient portfolio means thinking beyond a single asset or market trend. Economic cycles shift, sectors rise and fall, and no one investment performs well in every environment. That's why many investors look to diversify with platforms that provide access to real estate, fixed-income opportunities, professional financial guidance, precious metals, and even self-directed retirement accounts. By spreading exposure across multiple asset classes, it becomes easier to manage risk, capture steady returns, and create long-term wealth that isn't tied to the fortunes of just one company or industry. Arrived Homes Backed by Jeff Bezos, Arrived Homes makes real estate investing accessible with a low barrier to entry. Investors can buy fractional shares of single-family rentals and vacation homes starting with as little as $100 . This allows everyday investors to diversify into real estate, collect rental income, and build long-term wealth without needing to manage properties directly. Worthy Bonds For those seeking fixed-income style returns without Wall Street complexity, Worthy Property Bonds offers SEC-qualified, interest-bearing bonds starting at just $10 . Investors earn a fixed 7% annual return, with funds deployed to small U.S. businesses. The bonds are fully liquid, meaning you can cash out anytime, making them attractive for conservative investors looking for steady, passive income. IRA Financial Self-directed investors looking to take greater control of their retirement savings may consider IRA Financial. The platform enables you to use a self-directed IRA or Solo 401(k) to invest in alternative assets such as real estate, private equity, or even crypto . This flexibility empowers retirement savers to go beyond traditional stocks and bonds, building diversified portfolios that align with their long-term wealth strategies. Moomoo Idle Cash Moomoo isn't just for trading — it's also one of the most attractive places to park cash. New users can earn a promotional 8.1% APY on uninvested cash , combining a 3.85% base rate with a 4.25% booster once activated. On top of that, eligible new users can also score up to $1,000 in free Nvidia stock—but the real draw here is the ability to earn bank-beating interest rates without having to move into riskier assets. SoFi Alt Investments SoFi gives members access to a wide range of professionally managed alternative funds , covering everything from commodities and private credit to venture capital, hedge funds, and real estate. These funds can provide broader diversification, help smooth out portfolio volatility, and potentially boost total returns over time. Many of the funds have relatively low minimums, making alternative investing accessible. Range Wealth Management Range Wealth Management takes a modern, subscription-based approach to financial planning. Instead of charging asset-based fees, the platform offers flat-fee tiers that provide unlimited access to fiduciary advisors along with AI-powered planning tools . Investors can link their accounts without moving assets, while higher-level plans unlock advanced support for taxes, real estate, and multi-generational wealth strategies. This model makes Range especially appealing to high-earning professionals who want holistic advice and predictable pricing. American Hartford Gold For investors concerned about inflation or seeking portfolio protection, American Hartford Gold provides a simple way to buy and hold physical gold and silver within an IRA or direct delivery . With a minimum investment of $10,000, the platform caters to those looking to preserve wealth through precious metals while maintaining the option to diversify retirement accounts. It's a favored choice for conservative investors who want tangible assets that historically hold value during uncertain markets. This article Donald Trump Once Said The US Could Pay Off Its $37 Trillion Debt Burden With Bitcoin—But Could It Really? originally appeared on Benzinga.com View Comments Terms and Privacy Policy Your Privacy Cho"
    },
    {
      "title": "Tariffs, Social Shopping, and an EV Reset",
      "content": "We're asking the big questions. In this podcast, Motley Fool analyst Emily Flippen and contributors Jason Hall and Dan Caplinger tackle three timely stories: Whether 2025's tariff push is actually \"working\" (and who's really paying). How a U.S. sale of TikTok could reshape social commerce just as Amazon 's big event feels less special. What the Sept. 30 expiration of federal electric vehicle tax credits means for demand at Tesla, BYD, Ford , and more. To catch full episodes of all The Motley Fool's free podcasts, check out our podcast center . When you're ready to invest, check out this top 10 list of stocks to buy . A full transcript is below. This podcast was recorded on Oct. 07, 2025. Emily Flippen: The landscape of commerce is turning increasingly social. EV demand has been dampening, and are tariffs actually working? We'll discuss today on Motley Fool Money. I'm Emily Flippen. Today, I'm joined by analysts Jason Hall and Dan Caplinger to discuss how the sale of TikTok in the United States could change the way we shop here at the start of Prime Day, as well as expectations for demand for electric vehicles now that domestic EV tax credits have expired. But first, I think it's worth taking a deeper look at whether or not we can call tariffs a success. I suspect all of our listeners are already familiar with the tariffs that the Trump administration has sought to implement over the course of the past year. Most empirical evidence says that, generally speaking, tariffs don't spur economic growth. In fact, most economists and investors speculated that they would actually cause profits to drop, stocks to fall, consumer spending to ease, and inflation to rise. But so far, it doesn't really seem like that's been the case. In fact, it's really been the opposite. Stocks are up. The economy has been really resilient, and inflation does seem to be moderating. Jason, when you look at this picture in terms of the economic policies we're seeing here, is it too early to call tariffs a relative success? Jason Hall: I think if you're talking about the administration's goal of boosting US manufacturing, it's definitely way too early. So far, the only industries that have really been helped are the ones where there's already an entrenched base. You think about metals production, steel manufacturing. They've basically gotten a free license to increase their prices based on the tariffs that are in place on imports in those industries. You look at other manufacturing industries like the auto industry, whole building construction is a massive buyer of manufactured goods. They've actually been net hurt because they rely on a lot of imported goods, and the US just can't flip the switch quickly to produce those goods domestically. The agricultural sector has been impacted. We've seen countries like China has pulled back on buying US soybeans because of reciprocal tariffs, and tariffs on Chinese goods that are imported into the US. Semiconductor companies are feeling a huge pinch in China. Chinese companies are basically being told don't buy US chips unless you have no other choice. You look at the stock market, guys, this is an AI story. A JP Morgan analyst put out a research note, and he pointed out that since ChatGPT came out in November of 2022, three quarters of the S&P 500 returns have come from AI-related companies. Over that same period, 80% of the S&P 500's earnings growth has come from those companies. If you start peeling back the layers, it's obvious that we have a bifurcated market and economy. Plenty of companies are not doing well. In a lot of cases, because tariffs are either increasing their costs and/or putting pressure on already squeezed consumers who have been feeling the pinch from inflation for four years now. Emily Flippen: I think it's a fair point that there's clearly this disconnect that's happening between what consumers are feeling and what the stock market is doing and what investors are experiencing. But if the stock market isn't actually the correct indicator of how well the economy is doing it, that's not the barometer we're looking at. If that's not the scoreboard, Dan, when you look at it, what is the right gauge for gauging or judging success? Dan Caplinger: Well, I think there's a couple of directions that you can go with that, Emily. The first is to judge it from the goals that the administration had. I think that one of the primary goals that the Trump administration had was to make companies, both foreign and domestic, have the internal conversation. Are we interested in expanding US manufacturing capacity? Are we interested in sourcing more products that go to US consumers from US sources? That's the goal. I think those conversations are happening that they have taken place. As Jason said, the answer is not always going to be necessarily what the administration wanted, but they've definitely been able to define the conversation. They've been able to set the subject and put that in front of people, and let those folks come to whatever conclusions they have for their businesses. I think for big businesses, like Jason said, it's not always going to be a matter of flipping the switch, but it is a matter of if they make the decision to move more production and sourcing to US, that's going to be an option for them. It's the small businesses that I think have more trouble. Emily, I live in the middle of nowhere in Western Massachusetts. No big cities near me. There are plenty of small businesses that really did rely on cheaper goods from other countries in order to keep afloat. These tariffs, they are the marginal companies. They are the companies that are having to go out of business because of the extra costs due to the tariffs. They don't have the margins to be able to absorb those tariffs temporarily. That's the distinction that I see. The other thing that I think is a real issue is not so much the tariffs themselves, but the uncertainty surrounding how long are tariffs going to be in place? Are they going to be permanent? Is the rate going to change? Is it going to go up? Is it going to go down? It's impossible for businesses to have a good long-term sense of, OK, if an investment is going to take 5-10 years to pay off, is the policy just going to change back? Or is it going to get worse? Or am I making a smart decision? It's just really difficult to figure that out. Jason Hall: That's exactly right, Dan. It takes years to transition manufacturing and supply chains. We're six months into this, guys. The bigger question that I think we don't know the answer to is will US buyers, whether it's consumers or businesses, are they going to be willing to soak up the higher cost to manufacture more things domestically? According to an American Enterprise Institute study, there's about $1.7 trillion in goods that the administration is targeting to try to bring to domestic manufacturing, and it would cost about 21% more to manufacture them at home. That's an extra $257 billion a year. Plus, there's another $348 billion in tariffs that the AEI estimates would have to remain in place to keep that US manufacturing competitive. That's $606 billion a year that American buyers would have to pay for the same goods we're buying today. I mentioned AI before. Maybe this is the problem that AI can help solve. Dan Caplinger: Being a little glib. Jason Hall: But maybe that actually is part of the answer. Emily Flippen: Dare to dream here. I have to say, I think that part of the impact and part of the reason why there is that disconnect is just because we haven't felt the full force of the economic brunt of these tariffs. I saw some interesting data that was collected by Bloomberg over the course of the past month. They tracked more than two dozen of Temu. That is the shopping site owned by Pinduoduo, PDD Holdings, their most popular products. They found that their prices actually fell nearly 20% between April and September because they were attempting to ma"
    },
    {
      "title": "Did You Know, María Corina Machado, Who Thanked Trump After Receiving The Nobel Peace Prize, Is A Bitcoin Supporter",
      "content": "Did You Know, María Corina Machado, Who Thanked Trump After Receiving The Nobel Peace Prize, Is A Bitcoin Supporter Did You Know, MarÃ­a Corina Machado, Who Thanked Trump After Receiving The Nobel Peace Prize, Is A Bitcoin Supporter Aniket Verma October 13, 2025 5 min read In this article: BTC-USD NVDA TSLA CHAA.PVT IDLE-USD Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below. Venezuelan opposition leader María Corina Machado , who recently won the Nobel Peace Prize, has been a Bitcoin (CRYPTO: BTC ) supporter, labeling it as a “vital means of resistance” earlier. Nobel Peace Prize Winner Is A Bitcoiner Machado was honored for her “tireless work promoting democratic rights for the people of Venezuela\" and her \"struggle\" against the Nicolás Maduro regime by the Norwegian Nobel Committee. Interestingly, Machado thanked President Donald Trump after receiving the award. Trump’s supporters were aggressively pushing for his Nobel Peace Prize victory leading up to the event. Trending: Missed Nvidia and Tesla? RAD Intel Could Be the Next AI Powerhouse — Just $0.81 a Share Amid the flow of congratulatory messages, several Bitcoin-focused X accounts began circulating clips from a 2024 interview in which Machado is seen supporting the apex cryptocurrency. BTC A ‘Lifeline’ For Venezuelans Speaking with Alex Gladstein, Chief Strategy Officer of the Human Rights Foundation, Machado described Bitcoin as a “lifeline” for Venezuelans during periods of hyperinflation. \"Bitcoin bypasses government imposed exchange rates and thus helps many of our people\",\" the opposition leader said. \"it has evolved from a humanitarian tool to a vital means of resistance.\" Machado said that a \"new democratic Venezuela\" will embrace Bitcoin and that she sees the digital asset becoming part of the country's national reserves. See Also: Accredited Investors Can Now Tap Into the $36 Trillion Home Equity Market — Without Buying a Single Property Hyperinflation Driving Demand? Venezuela ranked among the leading Latin American countries in cryptocurrency usage, recording nearly $45 billion in transaction volume during the period between July 2024 and June 2025, according to blockchain analytics firm Chainalysis. The Venezuelan bolívar collapsed by almost 98% against the U.S. dollar in the last 10 years, potentially accelerating the shift toward assets that can safeguard savings. Photo courtesy: Shutterstock Story Continues Trending Now: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ? Maximize saving for your retirement and cut down on taxes: Schedule your free call with a financial advisor to start your financial journey – no cost, no obligation . Building Wealth Across More Than Just the Market Building a resilient portfolio means thinking beyond a single asset or market trend. Economic cycles shift, sectors rise and fall, and no one investment performs well in every environment. That's why many investors look to diversify with platforms that provide access to real estate, fixed-income opportunities, professional financial guidance, precious metals, and even self-directed retirement accounts. By spreading exposure across multiple asset classes, it becomes easier to manage risk, capture steady returns, and create long-term wealth that isn't tied to the fortunes of just one company or industry. Arrived Homes Backed by Jeff Bezos, Arrived Homes makes real estate investing accessible with a low barrier to entry. Investors can buy fractional shares of single-family rentals and vacation homes starting with as little as $100 . This allows everyday investors to diversify into real estate, collect rental income, and build long-term wealth without needing to manage properties directly. Worthy Bonds For those seeking fixed-income style returns without Wall Street complexity, Worthy Property Bonds offers SEC-qualified, interest-bearing bonds starting at just $10 . Investors earn a fixed 7% annual return, with funds deployed to small U.S. businesses. The bonds are fully liquid, meaning you can cash out anytime, making them attractive for conservative investors looking for steady, passive income. IRA Financial Self-directed investors looking to take greater control of their retirement savings may consider IRA Financial. The platform enables you to use a self-directed IRA or Solo 401(k) to invest in alternative assets such as real estate, private equity, or even crypto . This flexibility empowers retirement savers to go beyond traditional stocks and bonds, building diversified portfolios that align with their long-term wealth strategies. Moomoo Idle Cash Moomoo isn't just for trading — it's also one of the most attractive places to park cash. New users can earn a promotional 8.1% APY on uninvested cash , combining a 3.85% base rate with a 4.25% booster once activated. On top of that, eligible new users can also score up to $1,000 in free Nvidia stock—but the real draw here is the ability to earn bank-beating interest rates without having to move into riskier assets. SoFi Alt Investments SoFi gives members access to a wide range of professionally managed alternative funds , covering everything from commodities and private credit to venture capital, hedge funds, and real estate. These funds can provide broader diversification, help smooth out portfolio volatility, and potentially boost total returns over time. Many of the funds have relatively low minimums, making alternative investing accessible. Range Wealth Management Range Wealth Management takes a modern, subscription-based approach to financial planning. Instead of charging asset-based fees, the platform offers flat-fee tiers that provide unlimited access to fiduciary advisors along with AI-powered planning tools . Investors can link their accounts without moving assets, while higher-level plans unlock advanced support for taxes, real estate, and multi-generational wealth strategies. This model makes Range especially appealing to high-earning professionals who want holistic advice and predictable pricing. American Hartford Gold For investors concerned about inflation or seeking portfolio protection, American Hartford Gold provides a simple way to buy and hold physical gold and silver within an IRA or direct delivery . With a minimum investment of $10,000, the platform caters to those looking to preserve wealth through precious metals while maintaining the option to diversify retirement accounts. It's a favored choice for conservative investors who want tangible assets that historically hold value during uncertain markets. This article Did You Know, María Corina Machado, Who Thanked Trump After Receiving The Nobel Peace Prize, Is A Bitcoin Supporter originally appeared on Benzinga.com View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Dow Jones Futures: Trump Tariff Comments Spark Market Gains; Broadcom, Nvidia, Oracle, Tesla Rally",
      "content": "Dow Jones Futures: Trump Tariff Comments Spark Market Gains; Broadcom, Nvidia, Oracle, Tesla Rally Dow Jones Futures: Trump Tariff Comments Spark Market Gains; Broadcom, Nvidia, Oracle, Tesla Rally · Investor's Business Daily SCOTT LEHTONEN October 13, 2025 4 min read In this article: ORCL AVGO NVDA TSLA ^DJI Dow Jones Futures: Trump tariff comments sparked big stock market gains Monday. AI giants Broadcom, Nvidia, Oracle and Tesla rallied. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla (TSLA) Just Flashed Golden Cross Signal: Do You Buy?",
      "content": "Tesla (TSLA) Just Flashed Golden Cross Signal: Do You Buy? Zacks Equity Research October 14, 2025 1 min read In this article: TSLA Tesla (TSLA) reached a significant support level, and could be a good pick for investors from a technical perspective. Recently, TSLA broke through the 20-day moving average, which suggests a short-term bullish trend. The 20-day simple moving average is a well-liked trading tool because it provides a look back at a stock's price over a 20-day period. Additionally, short-term traders find this SMA very beneficial, as it smooths out short-term price trends and shows more trend reversal signals than longer-term moving averages. Similar to other SMAs, if a stock's price moves above the 20-day, the trend is considered positive, while price falling below the moving average can signal a downward trend. Moving Average Chart for TSLA TSLA has rallied 6.3% over the past four weeks, and the company is a Zacks Rank #3 (Hold) at the moment. This combination suggests TSLA could be on the verge of another move higher. The bullish case only gets stronger once investors take into account TSLA's positive earnings estimate revisions. There have been 5 revisions higher for the current fiscal year compared to none lower, and the consensus estimate has moved up as well. With a winning combination of earnings estimate revisions and hitting a key technical level, investors should keep their eye on TSLA for more gains in the near future. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Tesla, Inc. (TSLA) : Free Stock Analysis Report This article originally published on Zacks Investment Research (zacks.com). Zacks Investment Research View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla's surprising delivery data hide a serious problem",
      "content": ""
    },
    {
      "title": "SPMO: Is This The Best Growth ETF To Own?",
      "content": ""
    },
    {
      "title": "Here’s the good, bad and ugly earnings surprises that could hit investors’ favorite tech stocks",
      "content": ""
    },
    {
      "title": "As Tesla Launches an Updated Model Y, Should You Buy, Sell, or Hold TSLA Stock?",
      "content": "Your browser of choice has not been tested for use with Barchart.com. If you have issues, please download one of the browsers listed here . Get your Portfolio automatically emailed to you up to 4 times a day with Barchart Premier. FREE 30 Day Trial Log In Menu Stocks | Futures | Watchlist | News | More Advanced search or Select a Commodity Wheat Corn Soybeans Soybean Meal Soybean Oil Oats Rough Rice Hard Red Winter Wheat Spring Wheat Canola Crude Oil WTI ULSD NY Harbor Gasoline RBOB Natural Gas Crude Oil Brent Ethanol Gold Silver High Grade Copper Platinum Palladium Aluminum Live Cattle Feeder Cattle Lean Hogs Pork Cutout Class III Milk Nonfat Dry Milk Dry Whey Butter Cash-Settled Cheese Cash-Settled Cotton #2 Orange Juice Coffee Sugar #11 Cocoa Lumber S&P 500 E-Mini Nasdaq 100 E-Mini Dow Futures E-Mini Russell 2000 E-Mini S&P Midcap E-Mini S&P 500 Micro S&P Nasdaq Micro S&P 500 VIX U.S. Dollar Index Bitcoin Micro Ether Micro British Pound Canadian Dollar Japanese Yen Swiss Franc Euro FX Australian Dollar Mexican Peso New Zealand Dollar South African Rand Brazilian Real T-Bond Ultra T-Bond 10 Year T-Note 5 Year T-Note 2 Year T-Note Ultra T-Note 30 Day Fed Funds 3-Month SOFR Crude Oil Brent Crude Oil WTI Gas Oil UK Natural Gas Dutch TTF Gas RBOB Blendstock Heating Oil Euro Bund Euro Bobl Euro Schatz Euro Buxl Euro OAT Long-Term Euro BTP Long-Term Eurex Conf Long-Term Euro Bono Long-Term 10-Year Long Gilt 3-Month EuriBor 3-Month ESTR 3-Month SONIA 3-Month SARON Rapeseed Feed Wheat Milling Wheat Corn Euro Stoxx 50 Index FTSE 100 Index DAX Index Swiss Market Index CAC 40 Index AEX Index BEL 20 PSI 20 IBEX 35-Mini OMX Swedish Index VSTOXX Mini Steel Scrap Steel Rebar Cocoa #7 Coffee Robusta 10-T Sugar White #5 Watchlist | Portfolio | Dashboard MAIN MENU Home Stocks Options Learn ETFs Futures Currencies Watchlist Investing News Tools Portfolio POPULAR Stocks Percent Change Top 100 Stocks Stocks Highs/Lows Stocks Volume Leaders Unusual Options Activity Options Volume Leaders Commodities Grains Energies Alerts Pre-Market Post-Market Stocks Stocks Market Pulse Stock Market Overview Market Momentum Market Performance Top 100 Stocks Today's Price Surprises New Highs & Lows Economic Overview Earnings Within 7 Days Earnings & Dividends Stock Screener Barchart Trade Picks Today's Top Stock Pick All Top Stock Picks Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Liquidity Indices Market Indices S&P Indices S&P Sectors Dow Jones Indices Nasdaq Indices Russell Indices Volatility Indices Commodities Indices US Sectors Indices World Indices Trading Signals New Recommendations Top Stocks to Own Top Signal Strength Top Signal Direction Stock Signal Upgrades Sectors Stock Market Sectors Major Markets Heat Map Industry Rankings Industry Heat Map Industry Performance Stocks by Grouping Options Options Market Pulse Options Market Overview Unusual Options Activity Options Flow Upcoming Earnings Volatility IV Rank and IV Percentile Implied vs Realized Vol Highest Implied Volatility %Change in Volatility Volume & Open Interest Most Active Options Unusual Options Volume Options Volume Leaders Highest Open Positions Change in Open Interest %Change in Open Interest Data & Tools Options Time & Sales Options Price History Options Calculator Options Learning Center Option Screeners Options Screener Long Call Screener Long Put Screener Income Strategies Covered Call Naked Put Vertical Spreads Bull Call Spread Bear Call Spread Bear Put Spread Bull Put Spread Protection Strategies Married Put Protective Collar Straddle and Strangle Long Straddle Short Straddle Long Strangle Short Strangle Horizontal Strategies Long Call Calendar Long Put Calendar Long Call Diagonal Short Call Diagonal Long Put Diagonal Short Put Diagonal Butterfly Strategies Long Call Butterfly Short Call Butterfly Long Put Butterfly Short Put Butterfly Long Iron Butterfly Short Iron Butterfly Condor Strategies Long Call Condor Short Call Condor Long Put Condor Short Put Condor Long Iron Condor Short Iron Condor ETFs ETFs Market Pulse ETF Market Overview Popular ETFs ETF Finder Top 100 ETFs Today's Price Surprises New Highs & Lows Top Dividend ETFs ETF Screener Performance Leaders Percent Change Price Change Range Change Gap Up & Gap Down 3, 4, 5 Day Gainers Before & After Markets Pre-Market Trading Post-Market Trading Most Active Volume Leaders Price Volume Leaders Volume Advances Trading Signals New Recommendations Top ETFs to Own Top Signal Strength Top Signal Direction ETFs Signal Upgrades Mutual Funds Today's Price Surprises New  Highs & Lows Performance Price Change Funds Screener Futures Futures Market Pulse Futures Market Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures Prices by Exchange Commodity Groupings Commodities Prices Currencies Energies Financials Grains Indices Livestock Metals Softs Mini & Micro Futures Trade Futures With Plus500 Futures Trading Guide Trading Guide Historical Performance Commitment of Traders Commitment of Traders Legacy Report Disaggregated Report Financial TFF Report Resources Contract Specifications Futures Expirations First Notice Dates Options Expirations Economic Calendar Cash Markets Cash Markets Overview Corn Indexes Soybean Indexes European Futures Euro Futures Overview Long Term Trends Today's Price Surprises Highs & Lows Futures Market Map Performance Leaders Most Active Futures European Groupings Commodities Prices Energies Financials Grains Indices Metals Softs Power Futures Carbon Futures Baltic Freight Indices European Trading Guide European Trading Guide Historical Performance Currencies Currencies Forex Market Pulse Forex Market Overview Long Term Trends Today's Price Surprises Highs & Lows Forex Market Map Performance Leaders Currency Converter Crypto Market Pulse Crypto Market Overview Market Capitalizations Bitcoin Futures Trading Signals New Recommendations Commitment of Traders Commitment of Traders Legacy Report Financial TFF Report Currency Groupings Popular Cross Rates Australian Dollar British Pound Canadian Dollar Euro FX Japanese Yen Swiss Franc US Dollar Metals Rates All Forex Markets Crypto Groupings Popular Coins Bitcoin Bitcoin-Cash Ethereum Litecoin Monero XRP Tether Zcash Investing Investing Investing Ideas Today’s Investing Ideas Top Performing Stocks Top Trending Tickers Barchart Screeners Insider Trading Insider Trading Activity Politician Insider Trading Today's Picks Chart of the Day Top Stock Pick Futures Trading Guide My Screeners Stock Screener ETF Screener Funds Screener Options Screener Technical Ideas Bullish Moving Averages Bearish Moving Averages Breakouts and Reversals Candlestick Patterns eMACD Buy Signals Hot Penny Stocks Standout Stocks Top Stocks Under $10 TTM Squeeze Up Trending Stocks Down Trending Stocks Dividend Ideas Best Dividend Stocks Dividend Aristocrats Dividend Kings Power Investors Cathie Wood Stocks Warren Buffett Stocks Themed Lists AI Stocks Battery Stocks Biotechnology Stocks Cannabis Stocks Clean Energy Stocks Crypto Stocks Cybersecurity Stocks Data Center Stocks EV Stocks Fintech Stocks Gold Stocks Magnificent 7 Metaverse Stocks Nuclear Energy Stocks Oil Stocks Power & Infrastructure Quantum Computing REIT Stocks Semiconductor Stocks Stagflation Stocks SPAC Stocks World Markets News News Barchart Markets Today Barchart News Exclusives Contributors Chart of the Day News Feeds Featured Authors Andrew Hecht Austin Schroeder Caleb Naysmith Darin Newsom Don Dawson Elizabeth H. Volk Gavin McMaster Jim Van Meerten Josh Enomoto Mark Hake Oleksandr Pylypenko Rich Asplund Rick Orford Sarah Holzmann All Authors Commodity News All Commodities Energy Grains Livestock Metals Softs Financial News All Financials Crypto Dividends ETFs FX Interest Rates Options Stock Market Pre"
    },
    {
      "title": "These Bitcoin, Ethereum and XRP ETFs Plan to Offer 5X Leverage",
      "content": "Coin Prices BTC $111,407.00 0.42% ETH $3,948.28 0.26% XRP $2.61 4.14% BNB $1,115.44 0.45% SOL $194.45 0.45% USDC $0.999902 0.00% STETH $3,946.71 0.27% DOGE $0.196824 -0.43% TRX $0.297796 -2.52% ADA $0.655671 -0.24% WSTETH $4,804.26 0.25% WBTC $111,393.00 0.37% WBETH $4,261.34 0.21% FIGR_HELOC $1.001 105.14% LINK $18.06 0.87% HYPE $43.42 9.67% WEETH $4,258.97 0.21% USDE $0.999452 -0.00% XLM $0.325961 2.09% BCH $506.53 0.82% SUI $2.54 1.23% USDS $0.999852 0.03% BSC-USD $1.00 0.01% WETH $3,946.21 0.21% AVAX $19.69 0.56% LEO $9.00 0.50% CBBTC $111,406.00 0.40% LTC $96.69 -0.27% HBAR $0.172935 0.99% USDT0 $1.00 0.01% XMR $336.56 3.29% WBT $42.39 0.26% SHIB $0.00001018 -0.58% CRO $0.151808 2.69% TON $2.15 -0.77% MNT $1.67 1.30% SUSDE $1.20 0.12% DOT $3.09 0.05% ZEC $275.03 5.87% M $2.25 -0.08% UNI $6.25 -0.45% TAO $389.49 0.01% WLFI $0.136855 0.37% OKB $166.97 1.87% AAVE $226.54 -0.93% SUSDS $1.074 0.09% ENA $0.470091 -2.78% BGB $4.68 0.31% PEPE $0.00000717 -0.04% USD1 $1.00 0.02% NEAR $2.28 0.74% BUIDL $1.00 0.00% JITOSOL $240.92 0.47% PYUSD $1.00 0.01% SOL $194.51 0.47% ETC $16.00 -0.07% WETH $3,947.23 0.30% APT $3.31 0.37% ONDO $0.737598 -0.74% ASTER $1.13 0.88% JLP $5.51 0.33% USDF $0.9996 0.11% XAUT $4,122.75 0.04% POL $0.195817 0.32% WLD $0.894178 1.00% USDTB $0.999285 -0.08% GT $15.55 -0.39% ARB $0.320676 0.37% RETH $4,516.46 0.29% HTX $0.00000187 -3.22% KCS $13.33 -2.07% PI $0.207846 0.53% BNSOL $209.83 0.42% IP $5.25 -2.39% ICP $3.13 -0.57% HASH $0.03278231 -3.09% ALGO $0.185826 -0.01% KHYPE $43.59 9.87% RSETH $4,169.48 0.21% KAS $0.056933 7.54% ATOM $3.15 -2.08% OSETH $4,165.19 0.13% VET $0.01732328 -0.35% PUMP $0.00410502 -1.90% COAI $7.39 -61.68% WBNB $1,115.59 0.45% LSETH $4,199.32 0.39% PAXG $4,109.32 -0.08% JUP $0.428885 9.04% SKY $0.058145 0.05% PENGU $0.02147518 1.76% BFUSD $0.999883 -0.01% LBTC $111,423.00 0.72% SYRUPUSDC $1.13 0.02% FLR $0.01702051 -0.42% RENDER $2.49 0.56% EZETH $4,190.51 0.21% SEI $0.200512 2.60% TRUMP $6.00 1.09% QNT $82.01 0.81% BONK $0.00001494 0.36% NEXO $1.14 0.52% USDC $0.999995 0.02% SOLVBTC $110,881.00 0.30% XDC $0.062746 0.89% FIL $1.56 -0.56% SYRUPUSDT $1.10 0.01% MORPHO $2.00 0.75% IMX $0.5385 0.99% FDUSD $0.997558 -0.01% METH $4,252.25 0.29% SPX $1.045 0.08% JUPSOL $223.02 0.36% USDG $0.999896 -0.01% CAKE $2.70 1.29% RLUSD $1.00 0.03% WBTC $111,339.00 0.33% TIA $1.048 1.43% CLBTC $111,240.00 0.00% OP $0.44812 -0.06% VIRTUAL $1.28 35.76% 2Z $0.240007 1.25% AERO $0.920348 12.77% LDO $0.922362 -0.39% INJ $8.45 -0.46% MSOL $259.43 0.52% STX $0.448324 0.04% FTN $1.87 -3.43% OUSG $113.06 0.00% USYC $1.10 0.00% USTB $10.87 0.00% CRV $0.535269 -0.64% XPL $0.387584 0.75% FLOKI $0.00007384 -0.70% LIQUIDETH $4,187.82 0.92% GRT $0.065065 0.02% WETH $3,946.17 0.20% USDX $0.99866 0.11% USDY $1.094 -0.09% FET $0.261357 -2.64% PYTH $0.115749 0.42% TBTC $111,029.00 0.28% XTZ $0.603742 0.17% KAIA $0.108348 -0.46% S $0.166397 0.63% H $0.340164 12.23% GTETH $3,948.18 0.22% ETHX $4,230.52 0.15% WETH $3,946.38 0.26% IOTA $0.147089 0.23% USDAI $1.012 -0.59% BDX $0.078258 -0.44% AB $0.00691058 -0.61% ETHFI $1.022 0.23% CFX $0.110836 -1.16% MYX $2.96 -6.95% THETA $0.553481 -0.01% WIF $0.550326 1.07% USD0 $0.99797 -0.03% DAI $1.00 0.03% USDC.E $0.999902 0.00% PENDLE $3.20 -1.27% CBETH $4,347.71 0.32% TWT $1.28 0.73% SWETH $4,352.89 0.26% SAND $0.214025 -0.33% BTC.B $111,465.00 0.53% STRK $0.120112 -1.31% JASMY $0.01069188 0.35% DASH $41.44 1.81% ENS $15.53 -0.11% GALA $0.01109974 -0.15% USDT $1.004 0.59% DOGE $0.19699 -0.21% BTT $0.0000005 1.17% TUSD $0.997242 -0.11% EETH $3,949.54 1.14% RAY $1.79 -0.80% STEAKUSDC $1.11 0.01% A $0.293953 -0.35% USDD $1.00 0.01% MANA $0.241617 -0.57% BORG $0.471933 -3.16% SAVAX $24.18 0.63% WEETH $4,254.58 0.24% ASBNB $1,179.67 0.39% JTO $1.14 1.14% FLOW $0.273335 -0.74% CMETH $4,262.33 0.62% EIGEN $1.11 1.59% SUN $0.02240009 -1.62% SYRUP $0.383899 1.48% WETH $3,943.99 0.28% BSV $21.44 -1.14% SNX $1.24 -5.53% SATUSD $1.001 0.02% ZORA $0.094086 -0.97% WHYPE $43.15 9.17% USDB $1.009 0.21% APE $0.450753 -7.83% GHO $0.999748 -0.01% FRXETH $3,915.90 0.36% NFT $0.00000041 -0.68% ATH $0.02826707 -3.74% VKHYPE $43.83 9.64% VSN $0.117979 -0.60% TRAC $0.781015 4.29% FARTCOIN $0.389967 2.72% AIC $0.385443 -7.02% APEPE $0.00000182 -2.02% MERL $0.389474 0.25% FF $0.161212 -3.63% HNT $2.01 1.09% DEXE $6.56 -1.82% EUTBL $1.21 0.00% SDAI $1.17 -0.04% 0G $1.74 -2.02% COMP $37.94 0.17% ZBCN $0.00388574 1.38% OHM $22.51 -0.85% TIBBIR $0.368121 -8.67% WAL $0.247937 -1.00% NEO $5.18 -0.04% UBTC $111,441.00 0.46% ETH+ $4,165.61 0.22% SENA $0.468349 -4.47% FLUID $4.58 0.32% TEL $0.00374165 -2.10% W $0.073419 -0.09% SRUSD $1.11 -0.01% TETH $4,822.11 0.26% GNO $130.95 1.47% ATONE $2.82 1.69% LION $0.0111378 1.54% RSR $0.00555665 -0.55% DSOL $223.92 0.44% JST $0.03343447 1.25% WAVAX $19.68 0.62% BBSOL $216.78 0.65% CHZ $0.03265293 0.19% TOSHI $0.00076925 6.81% WETH $3,957.32 0.94% XCN $0.00892122 0.24% XSOLVBTC $110,296.00 0.01% CGETH.HASHKEY $1,568.99 -54.93% BUSD $1.003 0.17% WEMIX $0.673046 3.77% ARK $40.35 1.23% Price data by BTC $111,407.00 0.42% ETH $3,948.28 0.26% XRP $2.61 4.14% BNB $1,115.44 0.45% SOL $194.45 0.45% USDC $0.999902 0.00% STETH $3,946.71 0.27% DOGE $0.196824 -0.43% TRX $0.297796 -2.52% ADA $0.655671 -0.24% WSTETH $4,804.26 0.25% WBTC $111,393.00 0.37% WBETH $4,261.34 0.21% FIGR_HELOC $1.001 105.14% LINK $18.06 0.87% HYPE $43.42 9.67% WEETH $4,258.97 0.21% USDE $0.999452 -0.00% XLM $0.325961 2.09% BCH $506.53 0.82% SUI $2.54 1.23% USDS $0.999852 0.03% BSC-USD $1.00 0.01% WETH $3,946.21 0.21% AVAX $19.69 0.56% LEO $9.00 0.50% CBBTC $111,406.00 0.40% LTC $96.69 -0.27% HBAR $0.172935 0.99% USDT0 $1.00 0.01% XMR $336.56 3.29% WBT $42.39 0.26% SHIB $0.00001018 -0.58% CRO $0.151808 2.69% TON $2.15 -0.77% MNT $1.67 1.30% SUSDE $1.20 0.12% DOT $3.09 0.05% ZEC $275.03 5.87% M $2.25 -0.08% UNI $6.25 -0.45% TAO $389.49 0.01% WLFI $0.136855 0.37% OKB $166.97 1.87% AAVE $226.54 -0.93% SUSDS $1.074 0.09% ENA $0.470091 -2.78% BGB $4.68 0.31% PEPE $0.00000717 -0.04% USD1 $1.00 0.02% NEAR $2.28 0.74% BUIDL $1.00 0.00% JITOSOL $240.92 0.47% PYUSD $1.00 0.01% SOL $194.51 0.47% ETC $16.00 -0.07% WETH $3,947.23 0.30% APT $3.31 0.37% ONDO $0.737598 -0.74% ASTER $1.13 0.88% JLP $5.51 0.33% USDF $0.9996 0.11% XAUT $4,122.75 0.04% POL $0.195817 0.32% WLD $0.894178 1.00% USDTB $0.999285 -0.08% GT $15.55 -0.39% ARB $0.320676 0.37% RETH $4,516.46 0.29% HTX $0.00000187 -3.22% KCS $13.33 -2.07% PI $0.207846 0.53% BNSOL $209.83 0.42% IP $5.25 -2.39% ICP $3.13 -0.57% HASH $0.03278231 -3.09% ALGO $0.185826 -0.01% KHYPE $43.59 9.87% RSETH $4,169.48 0.21% KAS $0.056933 7.54% ATOM $3.15 -2.08% OSETH $4,165.19 0.13% VET $0.01732328 -0.35% PUMP $0.00410502 -1.90% COAI $7.39 -61.68% WBNB $1,115.59 0.45% LSETH $4,199.32 0.39% PAXG $4,109.32 -0.08% JUP $0.428885 9.04% SKY $0.058145 0.05% PENGU $0.02147518 1.76% BFUSD $0.999883 -0.01% LBTC $111,423.00 0.72% SYRUPUSDC $1.13 0.02% FLR $0.01702051 -0.42% RENDER $2.49 0.56% EZETH $4,190.51 0.21% SEI $0.200512 2.60% TRUMP $6.00 1.09% QNT $82.01 0.81% BONK $0.00001494 0.36% NEXO $1.14 0.52% USDC $0.999995 0.02% SOLVBTC $110,881.00 0.30% XDC $0.062746 0.89% FIL $1.56 -0.56% SYRUPUSDT $1.10 0.01% MORPHO $2.00 0.75% IMX $0.5385 0.99% FDUSD $0.997558 -0.01% METH $4,252.25 0.29% SPX $1.045 0.08% JUPSOL $223.02 0.36% USDG $0.999896 -0.01% CAKE $2.70 1.29% RLUSD $1.00 0.03% WBTC $111,339.00 0.33% TIA $1.048 1.43% CLBTC $111,240.00 0.00% OP $0.44812 -0.06% VIRTUAL $1.28 35.76% 2Z $0.240007 1.25% AERO $0.920348 12.77% LDO $0.922362 -0.39% INJ $8.45 -0.46% MSOL $259.43 0.52% STX $0.448324 0.04% FTN $1.87 -3.43% OUSG $113.06 0.00% USYC $1.10 0.00% USTB $10.87 0.00% CRV $0.535269 -0.64% XPL $0.387584 0.75% FLOKI $0.00007384 -0.70% LIQUIDETH $4,187.82 0.92% GRT $0.065065 0.02% WETH $3,946.17 0.20% USDX $0.99866 0.11% USDY $1.094 -0.09% FET $0.261357 -2.64% PYTH $0.115749 0.42% TBTC $111,029.00 0.28% XTZ $0.603742 0.17% KAIA $0.108348 -0.46% S $0.166397 0.63% H $0.340164 12.23% GTETH $3,948.18 0.22% ETHX $4,230.5"
    },
    {
      "title": "3 Unpopular Stocks Walking a Fine Line",
      "content": "3 Unpopular Stocks Walking a Fine Line 3 Unpopular Stocks Walking a Fine Line Radek Strnad October 16, 2025 4 min read In this article: TSLA CINF HRB Wall Street’s bearish price targets for the stocks in this article signal serious concerns. Such forecasts are uncommon in an industry where maintaining cordial corporate relationships often trumps delivering the hard truth. Whatever the consensus opinion may be, our team at StockStory cuts through the noise by conducting independent analysis to determine a company’s long-term prospects. That said, here are three stocks facing legitimate challenges and some alternatives worth exploring instead. H&R Block (HRB) Consensus Price Target: $55 (7.4% implied return) Founded in 1955 by brothers Henry W. Bloch and Richard A. Bloch, H&R Block (NYSE:HRB) is a tax preparation company offering professional tax assistance and financial solutions to individuals and small businesses. Why Are We Hesitant About HRB? Muted 4.1% annual revenue growth over the last two years shows its demand lagged behind its consumer discretionary peers Anticipated sales growth of 3.3% for the next year implies demand will be shaky Waning returns on capital imply its previous profit engines are losing steam At $51.21 per share, H&R Block trades at 10.2x forward P/E. Check out our free in-depth research report to learn more about why HRB doesn’t pass our bar . Tesla (TSLA) Consensus Price Target: $362.34 (-16.6% implied return) Originally founded by Martin Eberhard and Marc Tarpenning in 2003, Tesla (NASDAQ:TSLA) is an electric vehicle company accelerating the world’s transition to sustainable energy. Why Do We Steer Clear of TSLA? Tesla's scale advantage in EV production leads to gross margins that exceed incumbents such as General Motors and Ford. However, a softer macroeconomic backdrop and tariff pressures have weighed on automobile sales, which are highly cyclical. The company's execution ability is a question mark given its long history of delays, such as the Cybertruck and Robotaxi launches. Its sizeable investments in projects with uncertain return timelines, like Optimus, also raise skepticism from investors. On the bright side, Tesla's Megapack product solves a critical problem for utilities needing renewable energy storage solutions. This innovation has made the energy segment the most profitable and fastest-growing business line for the company. Tesla’s stock price of $434.45 implies a valuation ratio of 211.5x forward price-to-earnings. Read our free research report to see why you should think twice about including TSLA in your portfolio, it’s free for active Edge members . Cincinnati Financial (CINF) Consensus Price Target: $167 (6.8% implied return) Story Continues Founded in 1950 by independent insurance agents seeking stable market options for their clients, Cincinnati Financial (NASDAQ:CINF) provides property casualty insurance, life insurance, and related financial services through independent agencies across 46 states. Why Is CINF Not Exciting? Scale is a double-edged sword because it limits the company’s growth potential compared to its smaller competitors, as reflected in its below-average annual revenue increases of 6.8% for the last five years Expenses have increased as a percentage of revenue over the last four years as its combined ratio degraded by 8.4 percentage points Estimated book value per share growth of 6.3% for the next 12 months implies profitability will slow from its two-year trend Cincinnati Financial is trading at $156.35 per share, or 1.7x forward P/B. Dive into our free research report to see why there are better opportunities than CINF . High-Quality Stocks for All Market Conditions When Trump unveiled his aggressive tariff plan in April 2025, markets tanked as investors feared a full-blown trade war. But those who panicked and sold missed the subsequent rebound that’s already erased most losses. Don’t let fear keep you from great opportunities and take a look at Top 9 Market-Beating Stocks . This is a curated list of our High Quality stocks that have generated a market-beating return of 183% over the last five years (as of March 31st 2025). Stocks that made our list in 2020 include now familiar names such as Nvidia (+1,545% between March 2020 and March 2025) as well as under-the-radar businesses like the once-small-cap company Comfort Systems (+782% five-year return). Find your next big winner with StockStory today for free . Find your next big winner with StockStory today . Find your next big winner with StockStory today StockStory is growing and hiring equity analyst and marketing roles. Are you a 0 to 1 builder passionate about the markets and AI? See the open roles here. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Dow Jones Futures Rise As Nvidia Chipmaker Taiwan Semi Crushes Views; Google, Tesla Near Buy Points",
      "content": "Dow Jones Futures Rise As Nvidia Chipmaker Taiwan Semi Crushes Views; Google, Tesla Near Buy Points Dow Jones Futures Rise As Nvidia Chipmaker Taiwan Semi Crushes Views; Google, Tesla Near Buy Points · Investor's Business Daily ED CARSON October 16, 2025 5 min read In this article: NVDA ^DJI GOOGL TSLA FTAI Futures: Nvidia chipmaker Taiwan Semiconductor easily beat earnings views and guiding up. Google and Tesla are near buy points. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Stocks Give Up Gains Again. Here's Why.",
      "content": "Stocks Give Up Gains Again. Here's Why. Stocks Give Up Gains Again. Here's Why. · Barrons.com Connor Smith October 16, 2025 1 min read In this article: ^SPX ^IXIC AAPL TSLA META The Nasdaq Composite was down 0.5%. The yield on the 2-year Treasury note was down to 3.48%. For the S&P, financials, industrials, energy, consumer staples, consumer discretionary, utilities, and materials were all down 0.1% or more. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tom Lee Just Declared 'A Bubble Burst'—Will BitMine And Strategy Be Ok?",
      "content": "Tom Lee Just Declared 'A Bubble Burst'—Will BitMine And Strategy Be Ok? Parshwa Turakhiya October 16, 2025 6 min read In this article: BMNR MSTR ETH-USD BTC-USD BUBBLE-USD Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below. Tom Lee , chair of BitMine Immersion Technologies Inc. (AMEX: BMNR ), has sounded the alarm on digital asset treasuries, warning that the sector is \"running out of steam\" as valuations collapse . Digital Asset Treasuries Face Reckoning Speaking on Fortune's Crypto Playbook podcast, Lee argued that the digital asset treasury, or DAT, trend that defined the past two years has run out of momentum. These companies, structured as public vehicles holding vast cryptocurrency reserves, have drawn comparisons to Strategy Inc. (NASDAQ: MSTR ), which pioneered the approach in 2020 by accumulating Bitcoin (CRYPTO: BTC ) as a corporate reserve. Trending: Missed Nvidia and Tesla? RAD Intel Could Be the Next AI Powerhouse — Invest Now at Just $0.81 a Share \"Many of these firms are now trading below their underlying asset value,\" Lee said, suggesting investors no longer view DATs as efficient exposure vehicles. \"If that's not already a bubble burst, what is?\" he added. From Strategy's Bitcoin Bet To BitMine's Ethereum Push Lee's company, BitMine, has sought to replicate Strategy's model with Ethereum (CRYPTO: ETH ) instead of Bitcoin . The firm, which rebranded from a mining company earlier this year, holds more than three million ETH—roughly 2.5% of the total supply and carries a market capitalization above $15 billion. Lee said BitMine's goal is to expand its holdings to 5% of Ethereum's supply, positioning it as a \"liaison between Wall Street and blockchain innovation.\" He added that Ethereum remains \"the blockchain of Wall Street,\" citing its growing role in tokenized assets and stablecoin settlement systems. See Also: Accredited Investors Can Now Tap Into the $36 Trillion Home Equity Market — Without Buying a Single Property Investor Appetite Cools Despite Ethereum Holdings While BitMine's accumulation strategy mirrors Michael Saylor's Bitcoin playbook, the broader DAT sector faces mounting skepticism. Analysts note that newer entrants focused on smaller altcoins, such as Worldcoin (CRYPTO: WLD ), have diluted market confidence. Several DATs now trade below the value of their crypto holdings, reflecting thin liquidity and waning institutional demand. Lee acknowledged the risks, saying that \"just holding crypto on a balance sheet doesn't guarantee long-term performance.\" Why It Matters For Investors Digital asset treasuries once promised a new way for companies to gain crypto exposure. Today, many trade below the value of their holdings. That shift questions whether balance-sheet crypto is innovation or a fading strategy. Story Continues For BitMine and Strategy, the market no longer pays a premium. The decline signals that ETFs, staking, and sovereign funds may now control the institutional path into crypto. Image: Shutterstock Trending Now: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it ? Maximize saving for your retirement and cut down on taxes: Schedule your free call with a financial advisor to start your financial journey – no cost, no obligation . Building Wealth Across More Than Just the Market Building a resilient portfolio means thinking beyond a single asset or market trend. Economic cycles shift, sectors rise and fall, and no one investment performs well in every environment. That's why many investors look to diversify with platforms that provide access to real estate, fixed-income opportunities, professional financial guidance, precious metals, and even self-directed retirement accounts. By spreading exposure across multiple asset classes, it becomes easier to manage risk, capture steady returns, and create long-term wealth that isn't tied to the fortunes of just one company or industry. Arrived Backed by Jeff Bezos, Arrived Homes makes real estate investing accessible with a low barrier to entry. Investors can buy fractional shares of single-family rentals and vacation homes starting with as little as $100 . This allows everyday investors to diversify into real estate, collect rental income, and build long-term wealth without needing to manage properties directly. Vinovest Vinovest lets investors diversify into fine wine — a historically stable, low-volatility asset class that has outperformed the S&P 500 over multiple decades . With professionally managed portfolios, secure storage, and insurance included, users can invest in wine without needing to be experts themselves. Minimums start at $1,000, and investors retain full ownership of their wine, which has the potential to appreciate in value as global demand grows. Worthy Bonds For those seeking fixed-income style returns without Wall Street complexity, Worthy Property Bonds offers SEC-qualified, interest-bearing bonds starting at just $10 . Investors earn a fixed 7% annual return, with funds deployed to small U.S. businesses. The bonds are fully liquid, meaning you can cash out anytime, making them attractive for conservative investors looking for steady, passive income. IRA Financial Self-directed investors looking to take greater control of their retirement savings may consider IRA Financial. The platform enables you to use a self-directed IRA or Solo 401(k) to invest in alternative assets such as real estate, private equity, or even crypto . This flexibility empowers retirement savers to go beyond traditional stocks and bonds, building diversified portfolios that align with their long-term wealth strategies. Moomoo Idle Cash Moomoo isn't just for trading — it's also one of the most attractive places to park cash. New users can earn a promotional 8.1% APY on uninvested cash , combining a 3.85% base rate with a 4.25% booster once activated. On top of that, eligible new users can also score up to $1,000 in free Nvidia stock—but the real draw here is the ability to earn bank-beating interest rates without having to move into riskier assets. SoFi Alt Investments SoFi gives members access to a wide range of professionally managed alternative funds , covering everything from commodities and private credit to venture capital, hedge funds, and real estate. These funds can provide broader diversification, help smooth out portfolio volatility, and potentially boost total returns over time. Many of the funds have relatively low minimums, making alternative investing accessible. Range Wealth Management Range Wealth Management takes a modern, subscription-based approach to financial planning. Instead of charging asset-based fees, the platform offers flat-fee tiers that provide unlimited access to fiduciary advisors along with AI-powered planning tools . Investors can link their accounts without moving assets, while higher-level plans unlock advanced support for taxes, real estate, and multi-generational wealth strategies. This model makes Range especially appealing to high-earning professionals who want holistic advice and predictable pricing. American Hartford Gold For investors concerned about inflation or seeking portfolio protection, American Hartford Gold provides a simple way to buy and hold physical gold and silver within an IRA or direct delivery . With a minimum investment of $10,000, the platform caters to those looking to preserve wealth through precious metals while maintaining the option to diversify retirement accounts. It's a favored choice for conservative investors who want tangible assets that historically hold value during uncertain markets. This article Tom Lee Just Declared 'A Bubble Burst'—Will BitMine And Strategy Be Ok? originally appeared on Benzinga.com View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Chinese EV makers from Leapmotor to Zeekr challenge Tesla in premium segment",
      "content": "Chinese EV makers from Leapmotor to Zeekr challenge Tesla in premium segment South China Morning Post October 17, 2025 4 min read In this article: 9863.HK TSLA ZK STLAM.MI Chinese electric-vehicle (EV) makers are raising the game in the premium segment by launching more spacious and longer-range models to challenge Tesla , which has been steadily losing market share on the mainland. Stellantis-backed Leapmotor has become the latest to join the fray against Elon Musk's Tesla, with founder and CEO Zhu Jiangming describing its decision to move up the value chain as a mission to offer consumers the best EVs at the best prices. \"Leapmotor is able to launch higher-end and more sophisticated models at affordable prices, which will prove to be a value-for-money proposition for all customers,\" he said at an event in Shanghai on Thursday to unveil the D19 luxury SUV. \"We have been fine-tuning our technologies and improving our capabilities for years.\" Do you have questions about the biggest topics and trends from around the world? Get the answers with SCMP Knowledge , our new platform of curated content with explainers, FAQs, analyses and infographics brought to you by our award-winning team. Hangzhou-based Leapmotor, 20 per cent owned by Stellantis, formerly Fiat Chrysler, has consistently racked up high sales this year in the highly competitive EV sector, as its low-priced intelligent models have been well received by young and middle-income consumers. An EV chassis is displayed at Leapmotor's event to unveil the D19 SUV in Shanghai on Thursday. Photo: Daniel Ren alt=An EV chassis is displayed at Leapmotor's event to unveil the D19 SUV in Shanghai on Thursday. Photo: Daniel Ren> The luxury SUV, which features extended-range battery technology, is the 10-year-old company's first vehicle in the premium segment. Extended-range electric vehicles, known as EREVs, use a small internal combustion engine to generate additional power to charge the battery when needed. Leapmotor's D19 EREV is fitted with an 80 kilowatt-hour (kWh) battery pack, the largest ever in an electric car of its kind, offering a 500km range before switching to hybrid mode. Tesla's new six-seat pure electric Model Y L assembled at its Gigafactory in Shanghai is powered by an 82kWh battery pack giving it a range of 751km on a single charge. The US carmaker began delivering the Model Y variant last month. \"Chinese-designed EVs are mounting a challenge to Tesla with models featuring bigger batteries and more sophisticated digital technologies,\" said Eric Han, a senior manager at Suolei, an ­advisory firm in Shanghai. \"They will take time to build their brands' reputation to convince global customers of their quality and performance.\" La historia continúa Hong Kong-listed Leapmotor delivered 66,657 units in September, up 102 per cent from a year earlier and an increase of 30 per cent from August, rewriting its sales record for the fifth consecutive month. It delivered 395,516 vehicles between January and September, a 129 per cent jump from the same period in 2024. In July, Leapmotor launched a midsize sedan that offers similar features to Tesla's Model 3 at less than half the price. The B01, priced from 89,800 yuan on the mainland, would be sold globally as it pursued growth amid cutthroat competition at home, Zhu said at the time. The CEO said on Thursday that the D19 SUV used components from world-class suppliers like Contemporary Amperex Technology, the world's largest EV battery producer , and ZF Group, a German chassis maker. Leapmotor has yet to disclose prices for the D19, which is also available in pure electric variants. The basic edition of Tesla's Model Y L carries a price tag of 339,000 yuan (US$47,580), compared with 263,500 yuan for the older entry-level model. Analysts expected Leapmotor's D19 to start at about 300,000 yuan. Voyah, an EV unit of state-owned Dongfeng Motor, began taking pre-orders for its flagship SUV, the Taishan, last month. Powered by a 65kWh battery pack and a full tank of petrol, the hybrid SUV can go as far as 1,400km. The battery alone offers a range of up to 370km. Voyah has not announced prices for the Taishan either. In late September, Zeekr, a premium EV subsidiary of Geely Auto , mainland China's second-largest carmaker, began selling its luxury hybrid SUV 9X, whose variants are equipped with 55kWh and 70kWh battery packs, offering a driving range of 300km to 380km when fully charged. Its superfast charging battery technology gives a car a range of more than 200km with just 10 minutes of charging. Tesla commanded a 16 per cent share of the Chinese EV market in 2020 when its Shanghai Gigafactory began producing Model 3 vehicles for mainland customers. That slumped to 6.9 per cent last year due to rising challenges from domestic firms. This article originally appeared in the South China Morning Post (SCMP) , the most authoritative voice reporting on China and Asia for more than a century. For more SCMP stories, please explore the SCMP app or visit the SCMP's Facebook and Twitter pages. Copyright © 2025 South China Morning Post Publishers Ltd. All rights reserved. Copyright (c) 2025. South China Morning Post Publishers Ltd. All rights reserved. Ver comentarios Condiciones y Política de privacidad Your Privacy Choices More Info"
    },
    {
      "title": "Tesla, Nvidia, Rigetti, Praxis: Trending Stocks",
      "content": "Tesla, Nvidia, Rigetti, Praxis: Trending Stocks Ramzan Karmali October 17, 2025 In this video: PRAX RGTI RGTIW TSLA NVDA Tesla ( TSLA ) continued its slide in the pre-market on another bearish analyst report, and mounting questions around Elon Musk company's ability to deliver on robotics and AI promises. Nvidia ( NVDA ) shares swing down then recover some ground ahead of the open. Meta ( META ) is close to a $30 billion financing deal for a data center in Louisiana, and shares of its AI glasses partner EssilorLuxottica ( EL.PA ) hit a new record. Micron ( MU ) abandons some of its chip supplying activities in China. Other top gainers and losers include Praxis ( PRAX ) and Rigetti ( RGTI ). For more live coverage of markets watch the full episode of Market Sunrise and head to Yahoo Finance . Video Transcript 00:09 Speaker A It's time now for today's trending tickers. We start with Tesla, which is continuing to fall in the pre-market after a tough session yesterday. 00:20 Speaker A Sentiment among investors is mixed to say the least, following another bearing report from analysts at BNP Pariba yesterday, even as Tesla sold more cars last quarter, as people were rushing to take advantage of the expiring tax credit. 00:32 Speaker A Tesla's valuation is based on Elon Musk's big promises for robots and AI, and for now, those promises still haven't materialized into anything concrete. 00:43 Speaker A Next up, Nvidia, and this will be seen as a key indicator for the whole stock market today to see if fears around regional banks spill into the pillars of the AI boom. 00:54 Speaker A The world's largest company has shown strong performance in recent weeks despite headwinds from geopolitical tensions, but it's dropped more than two and a half 1. 1.3% overnight. And of course, whatever happens to Nvidia today, will have an outsized impact on the rest of the stock market. 01:07 Speaker A Now, let's look at another tech giant, Meta. It's also in the red, and this follows the news from Bloomberg that Meta is close to clinching a $30 billion financing deal for a giant data center in Central Louisiana. 01:21 Speaker A That huge funding may come from Morgan Stanley. And this morning, with everything that's happening with banks, some investors might be worried about the massive size of this project, which also involves Blue Owl Capital. 01:32 Speaker A On the other hand, a key partner of Meta is hitting new record highs. Today in Paris, SLOR Luxottico, the world's leading maker of glasses, posted a sales beat driven by the success of Meta's AI smart glasses. 01:45 Speaker A And if you've been following AI news, you will be interested in Micron. Shares in the US chipmaker were in the red in pre-market trading after Reuters reported that the US chipmaker plans to cease supplying server chips to data centers in China following a prolonged business slump linked to a 2023 government ban. 02:03 Speaker A China accounted for around 12% of Micron's total revenue in the last fiscal year. 02:08 Speaker A Okay, let's move on to Quantum computing now. very briefly, the key thing you need to know is that Ragetti, which has been driven by speculation around quantum computers, is in free fall in the pre-market after it already lost nearly 15% in yesterday's session. 02:22 Speaker A Investors are worried about weak fundamentals. 02:26 Speaker A And before we go, write down this name. It's a stock that's almost tripled in value in the past 24 hours. Praxis precision medicines was the number one trending ticker on Yahoo Finance this Friday morning after the clinical stage bio phaceutical company unveiled plans to raise more than $500 million through a public share offering. View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Why Tesla May Blow Out Third-Quarter Earnings Estimates",
      "content": "Why Tesla May Blow Out Third-Quarter Earnings Estimates Why Tesla May Blow Out Third-Quarter Earnings Estimates · Investor's Business Daily KIT NORTON October 17, 2025 5 min read In this article: TSLA Tesla reports third-quarter earnings and revenue late Wednesday. Analysts still see EPS down sharply vs. Q3 2024. Tesla stock is setting up. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Stocks Turn Higher. Here's What's Leading the Way.",
      "content": "Stocks Turn Higher. Here's What's Leading the Way. Stocks Turn Higher. Here's What's Leading the Way. · Barrons.com Connor Smith October 17, 2025 1 min read In this article: ^SPX ^IXIC ORCL AVGO AMZN The stock market is starting to perk up. The S&P 500 was up 0.2% after opening lower. The Nasdaq Composite was up 0.2%. The Dow rose 150 points, or 0.3%. Roughly 320 stocks in the S&P 500 were rising, but its worst performers were among some of the year's big winners: Oracle was down 6. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla Stock At A Make-Or-Break Point (Rating Downgrade)",
      "content": ""
    },
    {
      "title": "Buy Now, Pay Later and 6 More Ways You Can Finance a Tesla in 2025",
      "content": "Buy Now, Pay Later and 6 More Ways You Can Finance a Tesla in 2025 ©Tesla Motors Sean Bryant October 18, 2025 3 min read In this article: TSLA KLAR So, you’re thinking about buying a Tesla this year. That’s exciting, and a little overwhelming, depending on your budget . Let’s get real for a second. Unless you’re paying outright in cash, the real question becomes how you’re going to finance it without stretching yourself too thin. The good news? There are options. A lot more than you might think. Keep reading as we look at six different ways you can pay for your new Tesla purchase ( beyond using buy now, pay later ). Check Out: What Does It Cost To Charge a Tesla Monthly Compared to Gas for a Honda CR-V? Read Next: 6 Hybrid Vehicles To Stay Away From in Retirement You Can Use Klarna, but With Limits You won’t be financing your actual car through Klarna, but you can split things like wall chargers or floor mats into four smaller payments. Tesla partnered with Klarna for shop items, not vehicles, and it’s interest-free for six weeks. It’s not flashy, but it helps when you’re staring down all the extras. Tesla’s Built-In Financing Tool Is Simple If you would prefer to avoid third-party lenders, you can apply for financing directly through Tesla when you order your car. They’ll walk you through everything online. You’ll get loan terms between 36 and 84 months, and you can even roll in things like Full Self-Driving. It’s not always the lowest rate, but it’s fast and easy. Learn More: The Surprising Reason Retirees Shouldn’t Pay Cash for a Car Credit Unions Still Come Out Ahead Sometimes Don’t sleep on your credit union . Most of the time, they’ll beat the annual percentage rate (APR) you’ll be offered by Tesla. This means it might be worth the extra steps if you want to save over the long term. You’ll need to apply and get pre-approved before placing your order, but people who’ve done it swear it’s worth it. Leasing Isn’t Dead When leasing a Tesla, you’ll likely receive a lower monthly payment than if you purchased, but it comes with a mileage limit and no ownership at the end of the lease. This makes sense if you don’t drive many miles or want the option to upgrade after a couple of years. Some People Just Pay Upfront If you’re sitting on enough cash to pay outright, Tesla takes wires and ACH transfers. That means no loan, no monthly payments and most importantly, no interest. This is the lowest total cost option if you’re planning to keep the car for a while. Home Equity Option A few folks take out a home equity line of credit (HELOC) to fund their Tesla. Rates can be lower than a car loan, but your house is collateral. Only do this if you’re comfortable with the risk and know you’ll be able to make the payments. Story Continues Personal Loans Are Still Available Personal loans aren’t tied to the car, so they’re a little riskier for lenders, and they’ll charge you for that. Interest rates are almost higher for personal loans than they are for auto loans, but it might be your best shot if you’re struggling to get a loan from an auto lender. So, What’s Your Move? If your goal is a low monthly payment, you might want to choose leasing. But if you would prefer to minimize your overall cost, you’re better off paying cash or using a low-cost auto loan. While Tesla’s own financing is an option, your local credit union will most likely offer a better interest rate. No matter how you plan to finance your new Tesla, just make sure the payment plan fits within your budget. More From GOBankingRates 3 Little-Known Social Security Rules That Could Save You Thousands I Paid Off $40,000 in 7 Months Doing These 5 Things 5 Types of Cars Retirees Should Stay Away From Buying The 5 Car Brands Named the Least Reliable of 2025 This article originally appeared on GOBankingRates.com : Buy Now, Pay Later and 6 More Ways You Can Finance a Tesla in 2025 View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Electricity Prices Are Soaring.  Six Stocks to Fix the Problem.",
      "content": "Electricity Prices Are Soaring. Six Stocks to Fix the Problem. Electricity Prices Are Soaring. Six Stocks to Fix the Problem. · Barrons.com Al Root Sun, October 19, 2025 at 4:00 AM EDT 3 min read In this article: TSLA D GEV OKLO BWXT William Blair analyst Jed Dorsheimer has a plan to make American electricity more affordable and resilient. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Elon Musk Pay Drama Heats Up Ahead of Tesla Earnings",
      "content": "Elon Musk Pay Drama Heats Up Ahead of Tesla Earnings Elon Musk Pay Drama Heats Up Ahead of Tesla Earnings · Barrons.com Al Root Sun, October 19, 2025 at 12:29 PM EDT 3 min read In this article: FFND TSLA ISS, the proxy advisor, recommends shareholders vote no on a proposed massive pay package for Musk. Investors aren’t likely to listen. Continue Reading View Comments Terms and Privacy Policy Your Privacy Choices More Info"
    },
    {
      "title": "Tesla Q3 EPS Preview: Momentum Meets Uncertainty",
      "content": "Tesla Q3 EPS Preview: Momentum Meets Uncertainty Andrew Rocco Sun, October 19, 2025 at 7:34 PM EDT 3 min read In this article: TSLA Tesla Earnings Are Due Wednesday Zacks Rank #3 (Hold) stock Tesla ( TSLA ), the worldwide electric vehicle (EV) leader and a dynamic technology innovator, will report third-quarter 2025 earnings after the market close on Wednesday, October 22 nd . Though Tesla has been one of the top-performing stocks since its IPO in July 2010 (with a 34,000% return), the stock has taken investors on a wild ride over the past few years. Namely, Tesla has had to weather new tariff policies, a slowing EV market, higher interest rates, and increased competition. Additionally, Tesla and its iconic but controversial CEO, Elon Musk, have faced intense political backlash from both sides of the political aisle. Despite its many challenges, TSLA shares are up a robust 93% over the past six months. Zacks Investment Research Image Source: Zacks Investment Research Tesla EPS Preview Below are some key details to know ahead of Tesla’s earnings: Tesla Consensus Analyst Estimates Zacks Consensus Estimates suggest tepid sales growth and negative EPS growth until 2026. Wall Street expects Q3 revenue of $26.45B (+5.05%), with EPS of $0.53 (-26.39%). Zacks Investment Research Image Source: Zacks Investment Research Tesla EPS Surprise History Tesla has delivered spotty earnings results recently. Despite tempered Tesla analyst expectations, Tesla has missed expectations in six of the past ten quarters. Zacks Investment Research Image Source: Zacks Investment Research Meanwhile, Tesla has missed analyst expectations by an average of 3.65% over the past four quarters. Zacks Investment Research Image Source: Zacks Investment Research TSLA Expected Move The options market implies a potential move of +/- $37.48 or an 8.53% implied move. Tesla has had an average move of +/- 10.53% over the past eight quarters. TSLA shares have been higher the day after EPS 50% of the time over that time. TSLA Technical View After breaking out from a low-level base structure in September, TSLA shares are coiling in a classic bull flag pattern. If Tesla exceeds expectations, the stock should make a run at its previous all-time high of $488. Should TSLA miss expectations, the stock is likely to test the confluence of the open price gap and rising 50-day moving average ~$400. Zacks Investment Research Image Source: TradingView Tesla EPS: 3 Key Catalysts Tesla’s post-earnings price action will likely be determined by the answer to three critical questions, including: 1. Has Tesla’s Legacy EV Business Bottomed? Tesla recently produced and announced a record number of vehicle deliveries. However, investors will be listening closely to see what Elon Musk and his team have to say about forward expectations in the wake of the removal of federal EV tax credits, lower interest rates, and the new ‘Model Y’ sales performance. Story continues 2. Will Energy Segment Growth Continue? In the absence of a growing EV business, Tesla Energy has been a bastion of growth. Last year, the segment grew at a robust 67%. Meanwhile, thus far in 2025, energy storage deployments have increased at a triple-digit pace. With the AI boom in full force, Tesla’s energy storage business should benefit as energy-hungry data centers require energy storage solutions like Tesla’s ‘Megapack.’ 3. Will Tesla Meet Timelines for FSD, Robotaxis, and Optimus? Elon Musk is well-known for his aggressive timelines for new products. However, if Musk can convince investors that future product roadmaps are still on track, investors will reward him. Bottom Line As Tesla prepares to report Q3 earnings, investors face a familiar mix of excitement and uncertainty. With the stock surging nearly 93% in the past six months, expectations are high – yet tempered by Tesla’s recent mixed track record. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Tesla, Inc. (TSLA) : Free Stock Analysis Report This article originally published on Zacks Investment Research (zacks.com). Zacks Investment Research View comments Terms and Privacy Policy Your Privacy Choices More Info"
    }
  ]
}